{"0":{"definition":"Where [Captain Planet] is taking [pollution].<br /><br />","time":1444017663081},"2012":{"definition":"i mean come on if you wrote calenders from the beginning of time dont you think you would have to stop at one point? shit would you like to sit around all day and write a fucking calender untill the end of time.. some dude must of just got tired and went and did somthing else with his life. <br /><br />","time":1444007471297},"queening":{"definition":"British Term :-<br />The act of a woman sitting on her subserviants face for the majority of the day.<br />Also known as throning","time":1444007375141},"throning":{"definition":"to send a text, update your facebook, twitter, myspace or any other internet social network status while sitting upon the toilet.","time":1444007385592},"catherine":{"definition":"An amazing individual who beasts at everything. She takes crap from no one and makes people laugh like there&apos;s no fucking tomorrow. Sweet most of the time but will shut a bitch up quick. Shes athletic and loves music.. and shes a sexy piece of ass as well. ","time":1444007400567},"gift":{"definition":"The period or better the curse. You cannot see, but for sure you can feel the inverted commas on it.<br />Most appropriately, a &quot;gift&quot; from [Mother Nature]: for girls, a confirmation of her sick sense of humour.","time":1444007418546},"ssj":{"definition":"super saiya-jin, an advanced level of power reachable only by members of the saiya-jin race or saiya-jin&#x2f;human hybrids.  it causes the person&apos;s hair to turn gold and stick up, the person&apos;s eyes to turn turquoise, and increases the person&apos;s fighting strength several times.  it is usually the result of extreme anger.  from dbz.","time":1444007456816},"poo":{"definition":"Poo well, they&apos;re are many types of poo in this universe<br /><br />There is<br /><br />THE SWEETCORN - Poo that has leftover sweetcorn from last night&apos;s dinner<br /><br />THE PELLETS - Little pellets of poo that comes out of your ass like a machine gun<br /><br />THE FIREBALL - A big poo that really hurts and leaving your ass hot, usually happens after a curry<br /><br />THE SLIPPY - A poo that swiftly moves out of your bottom that requires no wiping<br /><br />THE WATERHOSE - When a massive monsoon of shit comes out of your bottom and requires hours of wiping<br /><br />THE NEVERENDING STORY - An amazing acheivment is when a poo goes on and on and on.......<br /><br />THE STEAMY HEAPY - Boy, That is basically ONE MASSIVE SHIT!!!!!!!<br /><br />THE STICKY - When you have a poo stuck onto the hairs of your crack and requires hours of wiping (maybe a pair of scissors)","time":1444007463346},"poop":{"definition":"Bodily waste of varying color, viscosity, shape, odor and texture. Usually exits the body through your pooper, speed, noise and degree of pain may vary depending on what you ate. ","time":1444007468259},"poopoo":{"definition":"A substance (usually brown) very much like logs that is the result of digested food. It comes out of your anus as you sit on the can. It can also come out of your anus at any other given time.<br />see [poop] or [shit]","time":1444007472693},"pooppoop":{"definition":"It is mostly used as a greeting or a goodbye.  Poop poop is a noun describing someone in your life. So it takes the place of....buddy, pal, dude, brother, sister, father, mother ...etc. ","time":1444007483908},"wetpoop":{"definition":"poop that isnt solid. wet poop normally occurs after a long night of drinking<br />","time":1444007506736},"rof":{"definition":"Acronym for Roll on the floor starving.","time":1444007548564},"fucku":{"definition":"fuck you<br /><br />comeback:Fuck urself its cheaper<br />2nd comback if somone say combac 1 to u: I prefer the expensive way","time":1444007670912},"fuckyou":{"definition":"An expression of contempt.<br /><br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1444007676217},"no":{"definition":"The word that makes sex rape.","time":1444007681343},"yomomma":{"definition":"The answer to any question, when the correct answer could not be attained at the present time.","time":1444007685189},"yes":{"definition":"1) An affirmative answer to a question, the opposite of no.<br />2) An expletive shouted out during an orgasm.<br />3) A British [progressive rock] (or [art rock]) group known for their hits &quot;Roundabout&quot; and &quot;Owner of a Lonely Heart&quot;.<br />4) A brand of laundry detergent in the US.","time":1444007694834},"sperm":{"definition":"white squiggly liquid which causes your life to be ruined when reaches womans egg","time":1444007956277},"eggs":{"definition":"White on the outside, yellow on the inside. A whiter person who wants to be asian.","time":1444007979352},"versus":{"definition":"<br />Abbreviation: [VS].<br /><br />1. Against someone or something, especially in a competition or court case.<br /><br />2. Alternative to something: as opposed to or contrasted with such considerations as money versus job satisfaction.<br />","time":1444008002827},"lennyface":{"definition":"A unicode emoticon used when something might be edgy.<br />( ͡° ͜ʖ ͡°)","time":1444008564740},"hate":{"definition":"a special kind of love given to people who suck","time":1444008951633},"deeznuts":{"definition":"1) A sarcastic expression used to denote annoyance or frustration.<br />2) A term used when you just dont give a fuck<br />3) Look, my dick and balls are bigger than yours.","time":1444008960809},"njk":{"definition":"Not just kidding.","time":1444009097325},"hjk":{"definition":"Hilary J&apos;s Kid<br />A man who owns a girly car and is generally a loser. Might even have these initials in his registration plate.","time":1444009100082},"creatine":{"definition":"A high-energy, naturally occurring compound known as creatine phosphate that is widely used (totally legal) as a supplement to enhance athletic performance and&#x2f;or muscle gain.  It is most popular as a white powder which is mixed with juice or water.  It can also be taken as a serum or in pill form.  Side effects include a weight gain of 5-10 lbs, bloating (if you don&apos;t drink enough water), and increased chest size.  The good effects will only be seen when combined with a serious workout regiment.","time":1444009162375},"whp":{"definition":"Warm Hole Provider.<br /><br />A woman who you really don&apos;t care about at all, besides the fact that she provides you with a warm hole every once in a while.","time":1444009279201},"phone":{"definition":"that annoying thing that wakes u up in the middle of the night just because ur idiot friend  broke up with her loser boyfriend.","time":1444009402604},"bush":{"definition":"The only presendent of the United States of America to be all most assassinated by a pretzil.","time":1444010051395},"owo":{"definition":"Oral WithOut [condom]. The practise of giving oral sex without the use of a condom, usually by a [hooker] and resulting in [cim].","time":1444010325301},"^":{"definition":"Very useful signal that is typed when one pushes Shift and 6. It has many uses, some of which include:<br />1- An eye for the following emoticons: ^_^ and  ^*^<br /><br />2- A caret (symbol denoting that something is to be inserted somewhere)<br /><br />3- Upwards arrow<br /><br />4- Showing exponents (7^.5597)<br /><br />5. Goes over random letters (usually vowels) in the French, German, and Hungarian languages (aka the circumflex)","time":1444010363803},"rumble":{"definition":"A huge brawl involving many people.","time":1444010628844},"bokunopico":{"definition":"During summer vacation, Tamotsu is on break from work happens to visit a particular café. It is at this café that Tamotsu meets Pico, who works there for his grandfather. Tamotsu instantly falls for Pico, believing that Pico is a girl because of his feminine appearance. However, to his disbelief, Pico claims he actually is a guy. Undeterred, Tamotsu pursues a sexual relationship with Pico, to an extent where he even persuades Pico into wearing girl clothes. When Pico asks what is he to Tamotsu, he finds himself unable to answer...","time":1444011103135},"molly":{"definition":"Abr. of &apos;molecular&apos;.<br /><br />Pure form of MDMA (ecstasy), usually a free powder or in capsules. Oftentimes MDA is sold as molly. Should be white in color (when it&apos;s pure) but is more often beige or yellow-brown, and sometimes brown or rarely gray.","time":1444011130164},"penis":{"definition":"The tool used to wean and convert lesbians and virgins into useful, productive members of society.","time":1444011317018},"fuckboi":{"definition":"A guy who tries to get with everyone. A player. A guy who will lie to a girl to make them hook up with them or send pics. They think they are the shit when they aren&apos;t. A guy who will only date a girl for their body. A total ass. A guy that will make a girl cry and laugh, and a guy who lies when they said I love you","time":1444011350194},"chupacabra":{"definition":"A creature also known as a &apos;Goat Sucker&apos; simply because it drains the blood and body fluids out of goats, leaving them dry and lifeless. <br />Some people believe it came from another planet. Some say it looks much like a kangaroo. ","time":1444011365575},"svs":{"definition":"also known as shallow vag syndrome.  Is the condition of having a shallow vagina.","time":1444011370032},"minimod":{"definition":"A normal forum poster that takes it upon themselves to push forum rules and tell everybody how to conduct themselves instead of leaving it up to the mods. Typically reserved for people that don&apos;t know what they&apos;re talking about, act like they have some kind of authority, and&#x2f;or are obviously doing what they&apos;re doing to try to score points with the real mods and become moderators themselves. (especially if it becomes a regular thing for them and&#x2f;or they don&apos;t contribute much good to the community otherwise)","time":1444011597642},"enervate":{"definition":"A object steal B&apos;s energy. B will be no longer acting briskly than A. <br />Now, A is commander of B.","time":1444012277171},"hmu":{"definition":"Hold my unicorn.","time":1444012325430},"lesbo":{"definition":"A women who is homosexual. One that likes to have sexual encounters with other women. Gay women. (See [lesbian])","time":1444012364895},"alive":{"definition":"not dead","time":1444014509024},"died":{"definition":"A term used when a person has laughed so hard that they &quot;almost died&quot;.","time":1444014564638},"die":{"definition":"the process of no longer being alive.","time":1444014571725},"kia":{"definition":"1) Killed in Action<br />2) Sexual activity stopped by the appearance of a parent, cop, or other person","time":1444014575983},"mia":{"definition":"She is a crazy girl. Makes jokes most people do not understand. She is veryyyy pretty and has nice eyes. You will be stunned when you meet a Mia.","time":1444014587995},"cunt":{"definition":"Derogatory term for a woman.  Considered by many to be the most offensive word in the English language.","time":1444014632553},"boy":{"definition":"an animal that can talk","time":1444014769849},"soma":{"definition":"A drug used in Huxley&apos;s futuristic utopian novel &quot;Brave New World.&quot; The substance is supposed to have the affect of modern drugs, yet no side-effects. Could describe bliss, oblivion, pure love, or pure utopia.","time":1444014773440},"girl":{"definition":"A younger form of a woman. If you tried to have sex with a girl, you&apos;d be arrested, you damn pedophile.","time":1444014788722},"sai":{"definition":"An extremely good looking male who bears (what some men consider a gift) the curse of entrancing sexiness. He, without any effort, will make ANY woman fall in love with him. Whether the woman be a straight, lesbian, transgender, a crossdresser, or a man who desperatly longs for womanly parts, she (or he) will fall in love with the suave composure of a Sai. Beware when around this individual. You will lose your girlfriend&#x2f;wife, sister, mother, aunt and even your grandmother. Sex is a Sai&apos;s greatest weapon even though he unknowingly wields it.","time":1444015153203},"ily":{"definition":"I Love you","time":1444015199570},"gitgud":{"definition":"To get better. To &quot;Get Good&quot;.","time":1444015437491},"asshat":{"definition":"One who has their head up their ass. Thus wearing their ass as a hat. Asshat","time":1444015599880},"wood":{"definition":"Something hard that you must rub regularly to keep shiny. Wood can be found in lots of places, like in your son or daughter&apos;s bedroom. You can do many things with wood, like knock it, pound it or sit on it. People often enjoy using their wood, usually for productive activities or fun and entertainment.","time":1444015608386},"yuri":{"definition":"1. Explicit lesbian relationships in anime or manga<br />2.To be the first to do something. Derived from Yuri Gagarin, first human in space. ","time":1444016812866},"swell":{"definition":"adj.  Fantastic, great, wonderful, et.","time":1444017048924},"putytang":{"definition":"looking at a girls but and crotch","time":1444017847752},"tyrone":{"definition":"Proper noun: Tyrone is the general name for a black male whose true name is unknown. Unlike offensive generic names, like Toby or Kunta Kinte, the name Tyrone does not mean to carry an offensive quality.<br /><br />Also, the term can be used as a unit of measurment in reference to black males.","time":1444017851850},"twerks":{"definition":"The rhythmic gyrating of the lower fleshy extremities in a lascivious manner with the intent to elicit sexual arousal or laughter in ones intended audience","time":1444021936921},"yeet":{"definition":"Term used to express excitement; especially used in basketball when someone has shot a three-pointer that they are sure will go in the hoop. <br />Also used as one ejaculates.<br />Can be used as an exclamatory (YEET!), or a verb (to yeet someone) ","time":1444021977235},"dougie":{"definition":"Swag, Swagger<br /><br />originated in Dallas","time":1444024678104},"arana":{"definition":"spider","time":1444024976983},"cana":{"definition":"A type of deep, lesbian love. ","time":1444024983059},"forehead":{"definition":"The proper area on which to apply HeadOn.","time":1444025392570},"forhead":{"definition":"Having four chicks drooling all over your tool.","time":1444025404539},"fourhead":{"definition":"a forehead that is covered with the four digits of one&apos;s own hand. if the fifth digit, the thumb, is also needed to cover the forehead it is called a fivehead.","time":1444025418534},"chav":{"definition":"Picture this a young lad about 12 years of age and 4 ½ feet high baseball cap at ninety degrees in a imitation addidas tracksuit, with trouser legs tucked into his socks (of course, is definitely the height of fashion). This lad is strutting around, fag in one hand jewellery al over the over, outside McDonalds acting as if he is 8 foot tall and built like a rugby player, when some poor unsuspecting adult (about 17&#x2f;18) walks round the corner wanting to go to mcdonalds for his dinner glances at the young lad, the young lad jumps up in complete disgust and says “Whats your problem? Wanna make sommin of it? Bling Bling” when the adult starts to walk towards the young lad, the young lad pisses himself and runs off to either his pregnant 14-year-old girlfriend or his brother in the army crying his eyes out.","time":1444026291951},"pdh":{"definition":"Short for Palm Desert High School. Home of the most beautiful girls in the coachella valley, and the most athletic guys the desert has to offer. The football team isn&apos;t very good, but the school has so much spirit, it makes up for it. This school has been nicknamed &quot;STDPD&quot; because nearly all of the girls there are very easy to hook-up with. This school has more drugs than their rival school LQHS (La Quinta High School) but the only differance is that Palm Desert has so much money, they find a way to hide that. Most of the kids their started using drugs in their middle school years at pdms (now pdcms, palm desert charter middle school) All of the girls at PD dress like sluts to get attention. PD kids are known for their parties though- who would&apos;a guessed? Throughout the whole valley, teens talk about Palm Deserts Parties.. maybe because at these events, drugs and alchohal are always provided. Too many of these gorgeous girls lost their virginity before freshman year aswell, to the many heart breaking guys at Palm Desert. The smart girls will choose to pick someone who doesn&apos;t go to PD. I feel bad for all of these teens&apos; parents, spending so much time and money for each of these children to be screw ups. Palm Desert isn&apos;t a cheap place to live, and all of these kids will soon find this out after they realize that these are their last four years of being a child.","time":1444027002414},"ria":{"definition":"The most Beautiful Girl in the World.","time":1444027059652},"devils":{"definition":"Arch Angel Lucifer<br />As a biproduct of Lucifers jealously of god, he was cast out of heaven and took 1&#x2f;3 of all angels with him.  These 1&#x2f;3 angels were damned willingly and unfaithfully to god.  Lucifer was holy but angels too can go on their own volition, thus becoming fallen angels but unlike humans, cannot be redeemed like human kind.","time":1444027130565},"kat":{"definition":"Term refering to the hottest woman in the room.","time":1444027218918},"foreveralone":{"definition":"The relationship status of most people on Tumblr.","time":1444027235411},"shrimp":{"definition":"A person that is hot from the neck down. So called because, like shrimps, everything is good but the head.<br />","time":1444027260646},"rianna":{"definition":"A girl that laughs alot and can sing with awesomeness. Mostly always talented in different ways. Rebel and can jump really high. Hated and loved by different clicks. Good kid.","time":1444027270969},"johncena":{"definition":"Right as you cum while getting a blowjob, pull out of her mouth and blow your load right into her eyes. <br /><br />Proceed to wave your hand in front of your face and go &quot;YOU CAN&apos;T SEE ME!&quot;","time":1444027295568},"rian":{"definition":"The name of the most incredibly sexy, smart, sweet, hot, irrisistible, passionate, and lovable man in the universe.  He knows how to treat a girl right!  ","time":1444027340138},"inferior":{"definition":"adj. <br />Low or lower in order, degree, or rank<br /><br />n. <br />A person lower in rank, status, or accomplishment than another. ","time":1444028534301},"dafuq":{"definition":"[what the fuck] , but in a more confused manner","time":1444029781598},"ip":{"definition":"1. Internet Protocol, or Internet Protocal Address(IP Address), commonly used for various means of communication.<br />2. In Progress. Often used in old RTS games, such as WarCraft II.","time":1444038122187},"nt":{"definition":"This word is very popular in online gaming nowadays.This abbrieviation simply means:<br /><br />Nice try.","time":1444038614179},"n":{"definition":"Arguably the best free Flash game ever created.  The game is a platformer by genre, with a few puzzle elements that come from the stunts you must pull involving jumps.  N stands for Ninja, as you play a small stick figure ninja who is capable of running at very high speed, wall jumping, and jumping very long distances.  The game has staying power due to the users&apos; ability to make their own maps as well as play the levels other people create, though it could be months before you get through all the normal game&apos;s levels.<br /><br />You must avoid a variety of enemies, all of which kill you brutally and violently (though it couldn&apos;t be called disturbing, he&apos;s only a stick figure) which is made extra entertaining due to the game&apos;s physics engine.","time":1444038744552},"y":{"definition":"Depending on the context it can mean either why or yes.","time":1444038748584},"yus":{"definition":"Synonym of &quot;yes&quot;.","time":1444038757067},"yas":{"definition":"A Glaswegian expression used to make others aware of extreme satisfaction. Would generally be exclaimed if the speaker had achieved something or had been given&#x2f;granted something which gave them pleasure or brought them happiness.","time":1444038762150},"anime":{"definition":"noun:  a style of animation that originated and is still heavily centered in Japan.<br /><br />The word &apos;anime&apos; is based on the original japanese pronunciation of the american word &apos;animation.&apos;<br /><br />The stereotype of the anime style are characters with proportionally large eyes and hair styles and colors that are very colorful and exotic.  The plots range from very immature (kiddy stuff), through teenage level, to mature (violence, content, thick plot).  The classification of &apos;hentai&apos; is given to animes of a stong sexual nature.<br /><br />Although over 95% of anime has nothing perverted about it, most closed-minded idiots think anime is always a form of pronography.","time":1444043121510},"gordo":{"definition":"It&apos;s spanish for &quot;Fat&quot;","time":1444044266492},"mfw":{"definition":"Abbreviation for &quot;my face when","time":1444044539625},"ict":{"definition":"Information Communications Technology<br /> <br />a strange and unclear term for computers, made to sound more interesting by shoving everything with a processor under its label. Looked down on by Computing people as its really a load of theoretical shit","time":1444046882014},"it":{"definition":"The word the Knights of Ni cannot hear or say.","time":1444046897132},"fbgm":{"definition":"Fuck Bitches, Get Money.<br /><br />A way of life.<br /><br />Another way of saying Bros Before Hoes.<br /><br />The word money is simply a metaphor for wealth: Fuck Bitches, Get Metaphor.","time":1444047721422},"zlatan":{"definition":"The nice guy down the street. Acts simple minded, but is actually pretty smart. Party animal at time, and other times quiet and a romantic.","time":1444049406633},"dum":{"definition":"The way morons type the word dumb","time":1444049982707},"mud":{"definition":"Multiple Username Disorder: A condition that compels those inflicted to create a multitude of aliases on websites such as &apos;IMDb&apos;, in order to praise or defend their own message-board posts -- the ultimate goal being to elevate these aliases to becoming the board leaders, and thereby controlling all topics of discussion. Often, the MUD sufferer will create lengthy message-board threads, in which the posts are entirely by his&#x2f;her imaginary correspondents.","time":1444050733781},"rachel":{"definition":"A smart, sassy and sexy young woman who knows things from fashion to film to literature, from Manolo Blahniks to Mahatma Gandhi.","time":1444050735721},"adela":{"definition":"a girl who has a great heart and a wonderful mind and is amazingly hott","time":1444050743167},"sian":{"definition":"Perfection. Total Perfection.","time":1444050751248},"bailey":{"definition":"the most amazing girl you will ever meet. very musical and super sweet... also amazingly beautiful even though she doesnt believe it","time":1444050753333},"marlen":{"definition":"German in origin<br />Pronounced mar-LEEN  Adj:<br />Meaning : One brought forth by the angels. Beauty bestowed upon her by God.<br />A beauty others wish for.","time":1444050806535},"karina":{"definition":"Karina is a girl&apos;s name of Scandinavian origin. It means &quot;pure&quot; of &quot;loved&quot;. Karina is artistic and outgoing, she loves music. She also likes to party and have fun with friends. She likes apples! Karina tends to trust anyone, thereby she gets hurt a lot. Karina takes relationships seriously and she&apos;ll never hurt a guy she loves. For Karina: Opposites do attract!","time":1444050813338},"fa":{"definition":"A Fat Admirer, or a guy with a preference towards big girls [BBW]s. And yes, they do exist, and no, a FA is not the same as a [feeder]. Contrary to popular belief, Fat Admiration is not a fetish, it&apos;s no different to a preference for redheads or short girls.","time":1444052038236},"rookie":{"definition":"A Beginner. A starter. Somebody that just doing or trying something for the first time","time":1444052339577},"scrub":{"definition":"A scrub is a guy that thinks he&apos;s fly<br />And is also known as a buster<br />Always talkin&apos; about what he wants<br />And just sits on his broke ass<br />A scrub is a guy that cant get no love from me<br />Hanging out the passenger side<br />Of his best-friend&apos;s ride<br />Trying to holler at me<br />","time":1444052370814}}