{"titan":{"definition":"A massive humanoid beast that devours human beings because why the fuck not. They terrorize humanity with their massive naked bodies.","time":1444603433145},"pikachuing":{"definition":"When you hook jumper cables to a car battery and a girls nipples, while she she repeatedly screams &quot;PIKACHU&quot; as loud as she can till you cum in her vag. After, she calls you ash for the rest of the night","time":1444603458580},"kaori":{"definition":"It&apos;s a NAME (first name) --specifically a Japanese one for girls, the above examples are people&apos;s mis-hearings of the word &quot;kawaii&quot; or &quot;kakko ii&quot;<br /><br />The most common meaning of this name is &quot;fragrance&quot;","time":1444603489397},"coolkid":{"definition":"That twat everyone wanted to murder in school due to his&#x2f;her massively inflated ego, self-obsessiveness and downright sadism. Generally the bully, and often has repressed issues of their own, they are driven insane by the voices in their head telling them to be a conformist, and so drive everyone around them insane by doing the same thing, and yet ironically promotes himself&#x2f;herself under the nebulous moniker of a &quot;rebel&quot;. Murderer of self-worth, dignity, individualism and everything a modern society professes to stand for, yet promoted in the media and society in general as a great role model. Generally fails in life due to thinking they were too &quot;cool&quot; to get a job, or a house, or a source of income, and more often than not forced by terrible circumstances to work for the very nerds they were bullying. Listens to mediocre and downright bad pop music, and, assuming the pop to stand for popular, not populist, he&#x2f;she forces his&#x2f;her (lack of) taste onto other people. An all-round arrogant, sadistic tosser that should never have been let out of the asylum.","time":1444603525748},"thanos":{"definition":"Crazy sweet salty intellectual with a soft side and[bootylicious]domestic goddess and genius for research","time":1444603541886},"elc":{"definition":"some who is all these words combined emo lesbian and has cottage cheese in their hair","time":1444603614313},"tool":{"definition":"One who lacks the mental capacity to know he is being used.  A [fool].  A [cretin].  Characterized by low intelligence and&#x2f;or self-steem.","time":1444603629135},"devin":{"definition":"to have vigorous [passion]; an endless [sexual] appetite","time":1444603645950},"tsuya":{"definition":"The Japanese slang term a young cheap prostitute.","time":1444603965544},"twentyonepilots":{"definition":"Two guys from central Ohio, Tyler Joseph and Josh Dun, that make some of the most amazing music that will ever grace your ear drums. They don&apos;t want to be heard, they want to be listened to. If you&apos;re looking for a crazy, high evolvement concert with plenty of sweat to go around and crowd surfing galore, by all means, go to their next show!  From their website:<br />&quot;Basically, we are all responsible for the preservation of our personal joy; but happiness is different. Joy is not circumstantial, happiness is. You can be depressed and still have joy. You can be suicidal and still have joy. We all stop thinking and we all stop talking and we all stop sharing and we all stop creating, because by doing any of these things we quickly find out just how unhappy we are. But that&apos;s ok. That&apos;s normal. Don&apos;t let the fear of unhappiness cripple your pursuit of finding what it is you believe. Since joy is found in belief, we all have to push through unhappiness to find joy. Basically.&quot;  Check them out at twentyonepilots.com","time":1444604065433},"twerk":{"definition":"The rhythmic gyrating of the lower fleshy extremities in a lascivious manner with the intent to elicit sexual arousal or laughter in ones intended audience","time":1444604300617},"can'ttouchthis":{"definition":"MC Hammer had a hit with the name &quot;U Can&apos;t Touch This.&quot; Generally means &quot;I&apos;m too good for you.&quot; or &quot;You&apos;ll never be as good as I am.&quot;","time":1444604304039},"gitgud":{"definition":"To get better. To &quot;Get Good&quot;.","time":1444604322607},"confirmed":{"definition":"To confirm a sentence. ","time":1444604374152},"ag":{"definition":"AG or &quot;aggressive&quot;... a thug gay girl that looks and dresses like a guy. a tomboy.","time":1444604752532},"kg":{"definition":"The act of licking the sensitive area between the ball sac and the anus.","time":1444604767153},"beast":{"definition":"UK Slang- a person who is very good at something","time":1444604769787},"ps3":{"definition":"Sony&apos;s newest system.<br /><br />The PlayStation 3, will use Blu-Ray discs as its media format. The discs can hold up to six times as much data as current-generation DVDs. It will also support CR-ROM, CD-RW, DVD, DVD-ROM, DVD-R, DVD+R formats. It also confirmed the machine would be backward-compatible all the way to the original PlayStation. It will also have slots for Memory Stick Duo, a SD slot, and a compact flash memory slot. It will also sport a slot for a detachable 2.5 inch HDD somewhat similar the Xbox 360&apos;s.<br /><br />Out of the box, the PS3 will have the capability to support seven Bluetooth controllers. It will also have six USB slots for peripherals--four up front and two in the back.<br /><br />Sony also laid out the technical specs of the device. The PlayStation 3 will feature the much-vaunted Cell processor, which will run at 3.2 Ghz, giving the whole system 2.18 teraflops of overall performance. It will sport 256mb XDR main RAM at 3.2 Ghz, and have 256MB of GDDR VRAM at 700mhz.<br /><br />Sony also unveiled the PS3&apos;s graphics chip, the RSX &quot;Reality Synthesizer based on Nvidia technology. The GPU will be capable of 128bit pixel precision, 1080p resolution, some of the highest HD resolution around. The RSX also has 512mb of graphics render memory and is capable of 100 billion shader operations and 51 billion dot products per second. It also has over 300 million transistors, larger than any processor available commercially today. It will be manufactured using the 90nm process with 8 layers of metal. The RSX is more powerful than two GeForce 6800 Ultra video cards, which would cost roughly $1000 total if bought today.<br /><br />To show off the PlayStation 3&apos;s graphical brawn, Sony showed several game demos, including an Unreal 3 tech demo of what appeared to be Unreal Tournament 2007. In what must come as a relief to developers, Epic Games&apos; Tim Sweeney was on hand to vouch for the PS3, saying it was &quot;easy to program for&quot; and that Epic had received its first PS3 hardware two months ago. He proved the tech demo was real time by showing it again and manipulating the camera and zooming in.<br /><br />The PlayStation 3 will also sport some hefty multimedia features, such as video chat, internet access, digital photo viewing, digital audio and video","time":1444604813109},">:)":{"definition":"Evil grin smiley. Typically used when planning evil deeds.","time":1444604965539},"relative":{"definition":"People who are related to you, whether you like it or not.","time":1444605235142},"posse":{"definition":"your crew, your hommies, a group of friends, people who may or may not have your back","time":1444605235205},"lisp":{"definition":"The most cruel and torturous word in the English Language, where a person has a speah impediment that stops them from speaking correctly.","time":1444605441731},"bipedal":{"definition":"One who uses two legs for locomotion. People, big foot, ext...","time":1444606017888},"aces":{"definition":"Excellent! Very good!(Australian slang) ","time":1444606314650},"asexual":{"definition":"a person who is not interested in or does not desire sexual activity, either within or outside of a relationship. asexuality is not the same as celibacy, which is the willful decision to not act on sexual feelings. asexuals, while not physically sexual-type folks, are none the less quite capable of loving, affectionate, romantic ties to others.  ","time":1444606363606},"bisexual":{"definition":"The ability to reach down someone&apos;s pants and be satisfied with whatever you find.","time":1444606399531},"plox":{"definition":"Generally used by the more veteran users of games and the internet.  Used generally as a parody of stupid users who say [plz] or [pls].","time":1444606563396},"fuckoff":{"definition":"1. A message used by the hand that is a direct insult to another person.<br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1444607086237},"fuckyou":{"definition":"An expression of contempt.<br /><br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1444607109651},"cat":{"definition":"The definitive pet. <br />Cleans self. Knows how to catch it&apos;s food.<br />Probably gave humans the idea for a &quot;vaccum.&quot; Is intelligent and curious. <br />Likes to lay around alot, sort of like a couch potato. That&apos;s cool though.<br /><br />They are usually quiet and know where to use the bathroom, unlike dogs.","time":1444607115682},"punchintheface":{"definition":"When one&apos;s fist unwillingly (or sometimes willingly) makes an other-than-delicate connection with your face.","time":1444607126896},"fuckyoutoo":{"definition":"A conversational stopgap measure or oratorical place holder that fills in for witty, biting reparte until a classier and to the point, cutting remark suitable to the occasion can be thought of hours later.","time":1444607127706},"sweg":{"definition":"instead of using &quot;Swag&quot;, you use &quot;Sweg&quot; to be more hipster&#x2f; indie.","time":1444607142404},"swog":{"definition":"The way one presents him or herself in an uncool, loser-like fashion. Also known to be the opposite of Swag.<br />-NigaHiga","time":1444607167191},"swig":{"definition":"1. Sex With Intoxicated Girls  2. Hard rock band from North Hollywood, California, winner of 2008 Rock City News Best Hollywood band award.","time":1444607180440},"swug":{"definition":"Senior Washed-Up Girl","time":1444607195977},"nyan":{"definition":"The sound a japanese cat makes. Much like the American &apos;meow&apos;. ","time":1444607233893},"heft":{"definition":"Hefting is a night-time sport played in dormitories and other communal sleeping places (tents, hostels, etc.). Once the lights are out, a player leves their own bed to attack another person by wrestling the victim (Heftee) on their bed; whoever is on-top when the lights are switched on wins. Due to this, a Heft must be conducted when the lights are out. If the Heftee ends up on-top, they win the Heft.<br />A &quot;Flying Heft&quot; is conducted by jumping from a top bunk-bed straight onto a heftee&apos;s bed.<br />An &quot;Owen&quot; is a mis-Heft caused by two or more people simultaneously attempting to Heft another whilst, unbeknownst due to the darkness, that person is already Hefting someone else, and the two luckless Hefters end up unwittingly Hefting each other insead.","time":1444607250471},"meme":{"definition":"(noun)   <br />    <br />1 : an idea, belief or belief system, or pattern of behavior that spreads throughout a culture either vertically by cultural inheritance (as by parents to children) or horizontally by cultural acquisition (as by peers, information media, and entertainment media)  <br />    <br />2 : a pervasive thought or thought pattern that replicates itself via cultural means; a parasitic code, a virus of the mind especially contagious to children and the impressionable <br /><br />3 : the fundamental unit of information, analogous to the [gene] in emerging [evolutionary theory] of culture  <br />  - meme pool (n.) : all memes of a culture or individual   <br />  - memetic (adj.) : relating to memes   <br />  - memetics (n.) : the study of memes   <br />    <br />4 : in [blogspeak], an idea that is spread from [blog] to blog <br />    <br />5 : an internet information generator, especially of random or contentless information   <br />    <br />(Etymology : meme : derived from the Greek mimëma, &apos;something imitated&apos;, by [Richard Dawkins] in 1976)","time":1444607671936},"sex":{"definition":"What kind of moron are you that you look up sex in the urban dictionary?","time":1444607696971},"anal":{"definition":"What to avoid in prison.","time":1444607703635},"onahole":{"definition":"A Japanese male masturbation silicon vagina (pussy).","time":1444607726003},"fleshlight":{"definition":"Shaped like a flashlight, but you have sex with it. Made for male masturbation.","time":1444607744881},"bp":{"definition":"Burn and Pollute","time":1444607751103},"lennyface":{"definition":"A unicode emoticon used when something might be edgy.<br />( ͡° ͜ʖ ͡°)","time":1444608591254},"okami":{"definition":"1.Okami is an amazing game for the PS2 and Soon for the Wii it based heavily on japanese myhtology and features great gameplay and original traditional japanese music It is cel-shaded and made to look like sumi-e drawings you will play as the japanese sun god Amaterasu incarnated as a wolf along with you is a little sassy sprite or poncle Issun,you will defeat different japanese monsters and learn history while playing a video game.Okami was basically knighted by critics unfortunatly it suffered poor sales.<br /> <br />2.Okami also means great deity<br /><br />3.and lastly Okami means wolf","time":1444608674105},"kit":{"definition":"Acronym for &quot;keep in touch&quot;","time":1444608733852},"jonahfalcon":{"definition":"Jonah Falcon (born July 29, 1970) is an actor and writer. He is perhaps best known for the size of his penis, measuring 9½ inches (24 cm) flaccid and 13½ inches (34 cm) erect.","time":1444609268248},"cookies":{"definition":"a woman&apos;s wet vagina","time":1444609380106},"charizard":{"definition":"While having sex with a girl with pubic hair, light her pubes on fire as you ejaculate.  Your semen will put out half of the burning hair, and afterwards while she is flapping her arms about wildly, scream: &quot;YOU DON&apos;T HAVE ENOUGH BADGES TO TRAIN ME!&quot; and run out of the room.","time":1444609418189},"pepe":{"definition":"The Most Powerfull being in the whloe universe after Chuck Norris, he&apos;s indestructible and invincible, some people think he is only a myth, but he&apos;s 100% Real","time":1444609495178},"hingo":{"definition":"The bane of everything that is good in the universe.  Should be avoided and shunned at all costs.  Widely associated with the fall of civilization into the depths of Hell.  Also, the exact opposite of [blarg].","time":1444609821670},"blarg":{"definition":"Blarg is a unique word, being the only word that not only means anything you want it to, or is used to show disinterest or boredom, but also is the only word that thousands upon thousands of people have claimed to have made up but has been around since man discovered they could use tools. Hobo Dave and Raymond Donn are amongst those who claim to have created the word, as well as some wierd dude called John who worked in the Games Workshop in Falkirk. I have also been known to use the word frequently in the past. I suppose, the true use of this word is to fill a gap in a sentence where appropriate. If a stoned person says &quot;blarg&quot;, it is usually used to replace a word they cannot think of, or which they have forgotten.","time":1444609844570},"smh":{"definition":"Acronym for &apos;shake my head&apos; or &apos;shaking my head.&apos; Usually used when someone finds something so stupid, no words can do it justice. Sometimes it&apos;s modified to &apos;smfh&apos; or &apos;smmfh&apos; by those that prefer profanity in their internet acronyms.","time":1444610070309},"roasting":{"definition":"A Term Used To Explain Sexual Hunger","time":1444610413496},"banhammer":{"definition":"1 - A symbol of violence and imaginary power over others, used by peniley-challenged jerks, at websites, to make themselves feel better about being so inadequate, and unliked by anybody  2 - a symbol used by bossy creeps at websites, to try and make you &quot;fear their power&quot; you&apos;re supposed to imagine they have...but really they have no power..or friends..because they are just assholes.  3 - a picture that should be thrust as far up the offending admin or mods nazi ass as possible, except they&apos;d probably like it","time":1444610765980},"fratparty":{"definition":"A sausage fest with douchebag frat boys who let a lot of girls in and hardly any guys so they can slip date rape drugs into the girls drink and have sex with them because obviously they can&apos;t rely on their charm. <br /><br />A big gathering of fags","time":1444610917811},"tomboy":{"definition":"A girl who dresses and sometimes behaves the way boys are expected to, often into more masculine things like &quot;stronger&quot; sports, computers, or cars.  Stereotypically wears jeans, baseball caps, and denim vests&#x2f;jackets. Often brought up with a lot of brothers or a child of a single father.","time":1444610956736},"tomgirl":{"definition":"A man or male identified individual that does not conform to heterosexual&#x2f;heterosexist masculine behaviors. This person may or may not behave or dress in a way that others label as feminine, although the tomgirl may not use those labels or agree with them. A tomgirl is not ashamed of femininity and takes pride in who they are. Often times more sensitive, compassionate, and emotionally secure than other types of men.","time":1444610958978},"heterosexual":{"definition":"A person who is attracted to the oppisite sex","time":1444610971048},"homophobic":{"definition":"Fear of homosexuals, usually found in guys. Truthfully makes no sense, considering lesbians are homosexuals. Can we say &quot;double standard&quot;?","time":1444610982267},"doublestandard":{"definition":"When a situation is desireable for one group but deplorable for another. Typically used in reasons to support feminists [feminazi], but completely ignoring the terrible double standard favoring them.","time":1444610998926},"heron":{"definition":"noun<br /><br />1. slang for heroin.","time":1444611070749},"rp":{"definition":"Roleplaying. An interactive social activity for people with the ability to write and improvise.<br /><br />Sadly, roleplaying is being invaded by people who can&apos;t write OR improvise OR follow common rules of etiquette.<br /><br />By the way, roleplaying is a game. Anyone who thinks that it relates directly to real life any more than, say, Crazy Eights does might want to have their head examined.","time":1444611171769},"thewalkingdead":{"definition":"The most baddass zombie aftermath show exclusively on tv.","time":1444611294015},"inb4":{"definition":"Generally used on internet forums, inb4 refers to a user posting a reply to a message&#x2f;topic &quot;before&quot; another user posts an obvious response. When used appropriately, inb4 is followed by a word or short phrase that the user knows will eventually appear in the topic conversation.  ","time":1444611295615},"farmville":{"definition":"The absolute worst, most unappealing, downright stupid, idiotic, mind numbing, horrendous, dick-limping, vagina-drying, waste of time humanly possible. This sad excuse for an online game represents how far mankind has fallen, and shows just how severe peoples dumbness can be. How someone can find such a chore like FARMING so entertaining is laughable. So many lives are wasted everyday when people go and play this shit stained program on their facebook profiles. Some even have the audacity to speak of this wretched atrocity, gloating about how useless they are and how great their farm looks. This ends up disturbing the lives of the majority of the population who actually matter (the people who dont play farmville). Farmville is the kind of bad habit that can destroy life-long friendships or end a marriage, the hate inducing game is so downright awful, people go so far as to plot the murder of those who play it, which is understandable. When it comes to the future of the human race, all the addicts who believe there are part of something popular when playing farmshit, will hopefully be killed off by natural selection. While the rest of the people in the world, who deserve to live, are out living their lives continue to procreate, all of the inept addicts who are busy locked up by their computers playing farmfuck will slowly make the world a better place, right before they get to harvest that last goddamn crop, by dying.","time":1444611426598},"clubpenguin":{"definition":"a game where you dress up as a virtual penguin, but for most kids its too virtually date other penguins and harass one another.<br /><br />ex, throwing snowballs, cheating on one another, making hearts, going in other peoples igloos other than your gf&#x2f;bf, etc.","time":1444611443339},"candy":{"definition":"n.<br /><br />1. euphamism for sex<br />2. something (usually flashy like a [lure]) used to get sex<br />3. drugs, particularly cocaine, [crack], or [E]","time":1444611563319},"wandering":{"definition":"When not [smashed], but [baked] to some extent you have the incredble urge to go wandering and steal candy from 7-11 for your munchdown and walk for a long discussing topics of our modern world.<br />","time":1444611620202},"bae":{"definition":"Bæ&#x2f;bae is a Danish word for poop. Also used by people on the internet who think it means baby, sweetie etc.","time":1444611685343},"anorexic":{"definition":"catch word used by 350 pound whales with low self-esteem to describe any woman who isn&apos;t obese and&#x2f;or attracts male attention.<br /><br />","time":1444611711663},"js":{"definition":"short for jordans (shoes worn by michael jordan)","time":1444611949405},"stoned":{"definition":"A state of mind which occurs after smoking enough marijuana to the point where the user stares blankly into whatever catches his&#x2f;her attention","time":1444612173431},"stone":{"definition":"A weight measurement (chiefly european) where one &quot;stone&quot; is equivalent to 14 lbs. or roughly 6 kgs.","time":1444612176612},"squrtle":{"definition":"A person so ugly they look like a squirrel and a turtle.","time":1444612296312},"squirtle":{"definition":"This pokemon will rape you with bubbles.<br />With a smile on its face.","time":1444612431656},"sack":{"definition":"Male scrotum.","time":1444612530546},"blastoise":{"definition":"One of the great water pokémon, fully equipted with a duel hydro pump.  He must have a HUUUGE BLUE COCK!","time":1444612547318}}