{"1":{"definition":"The IQ of President George Bush.","time":1444527381666},"2":{"definition":" the middle of 1 and 3.","time":1444527394866},"3":{"definition":"a number coming after 2, but not overshadowing it. Also a number coming directly before 4 but refussing ro be bullied or made feel less than by it. Strong number, yet emotionally sensative. In other words a number that knows its place.","time":1444527400278},"4":{"definition":"1) A number. After 3 and and before 5.<br /><br />2) What retards use for the word &quot;for&quot; and the letter &quot;A&quot;","time":1444527418670},"5":{"definition":"5 is an elite, nerdy way of saying &quot;LOL&quot;  See [120].<br /><br />[LOL] means &quot;Laughing out loud&quot; and is a common acronym used in chatting everywhere.<br /><br />LOL (or lol), written in [1337] is 101.<br />101 in binary is equal to 5 in decimal.<br /><br />So, LOL = 5","time":1444527431015},"6":{"definition":"What Drake says many times in his songs. For example- You &amp; The 6, Know yourself, and Legend. Drake is refering to Toronto. When he says 6 he means one of Toronto&apos;s Area Codes, 416.","time":1444527450745},"7":{"definition":"The fiercest digit known to man.","time":1444527463682},"8":{"definition":"Texting shortcut for oral sex.","time":1444527469984},"9":{"definition":"A number which was eaten by 7","time":1444527477223},"10":{"definition":"Top grade woman (= 10 out of 10). From the movie &apos;10&apos;, featuring Dudley Moore and Bo Derek.","time":1444527484211},"11":{"definition":"1 louder, innit. The highest number in the world of rock. The ultimate rock n&apos; roll number. <br /><br />If you need that extra push over the cliff, turn it to 11!","time":1444527491499},"12":{"definition":"The Police.  Any law enforcement agent.  See also &quot;PO-PO&quot; and &quot;ONE-TIME.&quot;","time":1444527500342},"13":{"definition":"A number commonly known for superstitious beliefs about it being unlucky. Originally it was a holy number, but somewhere along the way it was hijacked and portrayed as unlucky. Fear of this number is called triskaidekaphobia.","time":1444527508311},"14":{"definition":"The age of sexual consent in CANADA.   When you turn 14 you can be fucked.","time":1444527519653},"15":{"definition":"One of the worst ages of being a teenager.  You are in the middle and you wind up with the most problems that age. You are too young to drive without an adult, cannot go to the prom, and get a part time job like real teenagers.  Your head is up your ass and one day you are still a kid watching cartoons and another day you&apos;ll like to have sex.  This is also the age when most teen problems occur such as anorexia and cutting.","time":1444527535479},"16":{"definition":"Legal age for fucking in the UK.","time":1444527548219},"17":{"definition":"The right age to start having sex, according to Chef on South Park","time":1444486263506},"18":{"definition":"The age where an American can:<br />1. Legally buy pornography<br />2. Legally buy cigarettes<br />3. Legally gamble in Indian Casinos<br />4. Legally be concidered an adult<br />5. Be tried as an adult in a court of law<br />6. Be drafted for a war they don&apos;t believe in<br />... but still cannot buy alcohol.","time":1444527564206},"19":{"definition":"The Canadian drinking age. 2 years better than [21].","time":1444527638870},"20":{"definition":"location or current status&#x2f;activity","time":1444527646096},"21":{"definition":"The age at which one is finally considered human.","time":1444488999510},"22":{"definition":"The age after 21 where you realize you still have another 3 years to get your shit together","time":1444527658216},"23":{"definition":"The greatest number of all time. <br /><br />Reasons why: It is...<br /><br />1. a prime number, as are 2 and 3. <br />2. Michael Jordan&apos;s number.  <br />3. the NBA record for most consecutive points scored by a single player in a game, done by none other than Michael Jordan.<br />4. the number of chromosomes in a human sperm or egg.<br />5. the angle between the earth&apos;s magnetic and rotational axis.<br />6. the Tropic of Cancer at 23 degrees N Latitude.<br />7. the Tropic of Capricorn at 23 degrees S Latitude.<br />8. a .com and the page is very cryptic.<br />9. the most quoted Psalm in the bible (&quot;The Lord is my shepherd...&quot;<br />10. the number of people executed in &quot;A Tale of Two Cities&quot;<br />11. the smallest number of people for which there is at least a 50% chance that two will share the same birthday.<br />12. the standard TCP&#x2f;IP port for Telnet.<br />13. one of the &quot;Lost&quot; numbers on the television show....also the sum of two of the other numbers (8 &amp; 15)and the solution to 42-15-4=23, all of which are also Lost numbers.<br />14. the number of times Caesar was stabbed in Shakespeare&apos;s Julius Caesar.<br />15. has been prominently featured in the following: Serendipity, Futurama, Star Wars A New Hope, Monty Python The Life of Brian, Seinfeld, The Big Lebowski, The Matrix Reloaded, and Die Hard III among MANY MANY other movies.<br />16. the number of flavors Dr. Pepper claims to be a blend of.<br />17. the number of distinct orientations of Tetris pieces.<br />18. the sum of U2, the greatest band ever. U is the 21st letter of the alphabet.<br />19. the number of letters in the latin alphabet.<br />20. the number of the Illuminati.<br />21. the letter W in the english alphabet, a letter with 2 points down and 3 points up.<br />22. the smallest number of integer sided boxes that tile a box such that no two boxes share a common length.<br />23. the only US president to serve between nonconsecutive terms of another president (23rd president Benjamin Harrison serving between Grover Cleveland&apos;s terms).","time":1444527664085},"24":{"definition":"24, The Jack Bauer Power Hour. The most entertainment you can stuff into a single day. Full of twists, turns, violence, and Elisha Cuthbert.","time":1444525065688},"25":{"definition":"a measurement, usually in inches or a standard smaller (such as centimeter or nanometer), in reference to the size of a male schlong","time":1444527691995},"26":{"definition":"750ml of alky","time":1444527705352},"27":{"definition":"the age all rockstars die at:<br />jimi hendrix<br />jim morrison<br />janis joplin<br />kurt cobain<br />alexander the great<br />james dean<br />river phoenix<br />brad nowell (lead singer to sublime) died at the age of 28 years and 2 days (2 days from joining the club)<br />","time":1444527711376},"28":{"definition":"The number 28 means to titty bite.  The number 2 is meant to look like a jaw while the 8 being titties.","time":1444527737877},"29":{"definition":"The age at which most women stop aging (or so they say!).<br /><br />","time":1444527753456},"30":{"definition":"A 30 pack 12 oz cans of beer.","time":1444527761213},"31":{"definition":"turkish symbol for masturbation<br /> - 3 is the hand<br /> - 1 is the cock","time":1444527768590},"32":{"definition":"The number &quot;32&quot;. what the fuck else would it be?","time":1444527781347},"33":{"definition":"The percentage of sexually active highschoolers who will have intercourse with more than 4 people before gradcuation- often used as a replacement for the words slut, hoe, whore etc.","time":1444505137575},"34":{"definition":"Slang for [anal] sex, similar to [69] or [89].<br /><br />The 3 represents a butt while the 4 represents the top vie of a man holding his penis towards the butt-hole.","time":1444527802294},"35":{"definition":"1&#x2f;8 of an ounce of Marijuana.","time":1444527814836},"36":{"definition":"The Correct Canadian Slang for the number &apos;36&apos; is Pussy.","time":1444527823147},"37":{"definition":"#1) Number often used in fiction because it is inconspicuous:  A prime number greater than 25 but less than 50.<br /><br /><br />#2) Number that usually results in cheap magician&apos;s trick:  Ask someone to pick a number in his&#x2f;her head between 1 and 50 with both digits odd and the first digit less than the second.  Victim usually picks 37 because of #1).<br /><br /><br />#3) Birthday number most likely to trigger a mid-life crisis.<br /><br /><br />#4) The number of men a woman must give a blowjobs to in order to become a slut (see the movie &quot;Clerks&quot;).","time":1444527834338},"38":{"definition":"38, also known as &apos;Balls Deep&apos;. Adapted from 1337 speak. Where a penis can be represented as 8==D and anal sex can be represented as 3==8. So when the 3 and theh 8 have no = signs, meanning you cannot see the &apos;shaft&apos; thus you are &apos;balls deep&apos;","time":1444527869027},"39":{"definition":"The act of doggy style, hitting it from the back ferociously, sliding up to the bumper in order to saddle up and ride. Other variations include [pterodactyl] and is based on [doggy style]. Phallus can be inserted into anus or vagina. True 39ing normally includes a great deal of screaming. Blood flow may ensue. 39ing never includes homosexuals [queer](s) and [faggot](s).","time":1444527883243},"40":{"definition":"A bottle containing 40 fluid ounces of malt liquor beer. The beer is of low quality and fairly cheap to buy. A bottle can run you usually between 2 and three dollars depending on brand. 40&apos;s are popular in a variety of areas and are drunken by many types of people. Gangstas will drink 40&apos;s and will sometimes pour out a little of the beer onto the ground for their dead homies. Teenagers also like to drink 40&apos;s because it is a fast way to get drunk and all the beer is in one bottle opposed to drinking several smaller 12 ounce bottles and&#x2f;or cans. Some brands of beer produced in the 40 ounce variety are Clot 45, Olde English, Mickey&apos;s, and King Cobra.","time":1444527903218},"41":{"definition":"close to the answer for Life, the Universe, and Everything","time":1444527909166},"42":{"definition":"The Almighty Answer to the Meaning of Life, the Universe, and Everything. It was calculated by the computer Deep Thought for seven million years and when asked to build a better computer to discover the Question to the Life, the Universe, and Everything, it built the Earth. Before the Earth could tell the Question however, it was destroyed by the Vogons to make room for an interstellar highway bypass. For more information, see The Hitchiker&apos;s Guide to the Galaxy.","time":1444527914980},"43":{"definition":"A # that can stand for &quot;LOVE YOU&quot;<br />cause love has 4 letters and you has 3","time":1444527930683},"69":{"definition":"Simultaneous oral sex. Can be practised by M+M, M+F or F+F.<br /><br />The reference is that the numerals 6 and 9 are inverted versions of each other, reflecting the physical position that the couple must adopt when engaged in this sexual practice.","time":1444497898136},"70":{"definition":"69, with a finger","time":1444585498270},"350":{"definition":"A common [Chevy] smallblock engine used everywhere from trucks to musclecars.  The 350 refers to the engine&apos;s displacement in cubic inches. Production began in 1968 and was discontinued with the demise of the camaro in 2002 however parts are plentiful and these engines can be made quite powerful. ","time":1444576381768},"619":{"definition":"The area code of San Diego, CA. Also a finishing move of the WWE&apos;s Rey Mysterio.","time":1444480979999},"666":{"definition":"The Mark of the beast, and the men who follow the beast of the earth will bear this mark to display their allegiance to the beast. It has been disputed by some scholars that certain numeric ciphers would translate it over to certain words, names, etc... For example, one of the more popular translations was Nero Caesar, and before that, Lateinos, etc...<br /><br />&quot;...And that number is 666.&quot;<br /><br />Widely implied that it was 666 because it was an imperfect number to represent the impurities of man and their evildoings and sinful ways.<br /><br />Read the book of revelations, at the end of the New Testament; it tells all about that, the seven seals, the apocalypse, Armageddon, Megiddo, etc...","time":1444578140326},"747":{"definition":"1) An airplane made by Boeing, competetor of Airbus.  It is the fastest subsonic jet in the world, crusing at .855 Mach, or 85% of the speed of sound.  The 747-400 can seat up to 630 passengers.  It has 4 engines; however, it can still fly with only two operational engines.  It is used for international flights.","time":1444576359317},"900":{"definition":"two and a half rotations (a nine-hundred degree turn).  usually this is done as a trick on a skateboard, bmx bike, or with in-line skates.  if you&apos;re really insane, you&apos;ll pull it off in a car.","time":1444407906592},"smagma":{"definition":"The sweat produced as a result of intense physical effort by the nutsack, either sexually or through sports, as opposed to normal nut sweat that occurs during everyday wear and tear.","time":1444367755911},"cyber":{"definition":"Online sex that loners engage in if they are too ugly and boring to get a real boyfriend&#x2f;girlfriend.","time":1444368247749},"rotmg":{"definition":"Short for the online game &quot;Realm Of The Mad God&quot;","time":1444368493790},"hooters":{"definition":"what you have to look at when a girl is talking to you","time":1444368929491},"dylan":{"definition":"Guy with an incredibly huge penis and is totally awsome compared to any bitch ass Russians.<br /><br />(if you know anybody named dylan next time you see him give him a high five unless your a chick in that case give him a hug but no fatties)<br />","time":1444368965299},"funbags":{"definition":"Slang word for womens breast. Such as tits, boobies, hotters and so on.","time":1444368993689},"logic":{"definition":"Systematic thinking process of coming to the best solution, which somehow seems evade most parents.","time":1444371867982},"swampass":{"definition":"A common condition in which the ass crack and crotch becomes overly moist, sweaty, and stinky from one or all of the following:<br />- sweating on a hot day<br />- not bathing enough<br />- long day of work, sports, play<br />- incomplete wipe due to rush or laziness<br /><br />The crack will often feel squishy, wet, unpleasant, and itchy.  It is recommended to take a bath with soap to sanitize the condition.","time":1444373857995},"inb4":{"definition":"Generally used on internet forums, inb4 refers to a user posting a reply to a message&#x2f;topic &quot;before&quot; another user posts an obvious response. When used appropriately, inb4 is followed by a word or short phrase that the user knows will eventually appear in the topic conversation.  ","time":1444377083625},"fanny":{"definition":"UK, Australia, NZ. Fanny= pussy<br />Silly yanks, fanny= bum<br />They do seem to have a lot arse about. Even funnier when a girl says &quot;i&apos;ll stick that in my fanny pack&quot; which does make for a lot of shocked faces.","time":1444377227022},"cretin":{"definition":"A Person that is: brainless, stupid, child-like, and full of pointless information that makes no sense and appeals only to other cretins.  They can be found in abundance in every single populated internet forum, where they race to post as many mind-numbing messages as possible in a single session.  In addition, they seemingly interbreed with other cretins, ensuring that their cretinous genes continue long after they end up dead meaning the Internet will never be rid of their kind.  More&apos;s the pity.","time":1444383550657},"oy":{"definition":"(sense 1): Interjection signifying pain, weariness, disgust, resignation, etc.  Very often part of [oy vey] or [oy vas mir]. Compare to English [Jeez].  (from Yiddish &quot;oy&quot;, probably from old German; probably cognate to English &quot;oh&quot;).<br /><br />(sense 2): Interjection signifying annoyance. Very similar to sense 1, but more annoyed than resigned.  (Probably from Cockney accent of English &quot;Hey&quot;.)<br /><br />(sense 3) Greeting meaning &quot;hello&quot; or &quot;Hi&quot;. (Probably from Cockney &quot;hi&quot;).","time":1444383587640},"nob":{"definition":"British slang term for the penis. Typically used as an excellent cheap insult. Used in jest (above &quot;moron&quot;, just below &quot;twat&quot;, and well below &quot;cunt&quot;), or used to describe someone who is doing something you think is annoying or a bit crap.","time":1444385615785},"lunatics":{"definition":"A reckless or psychopathic individual. Derived from &apos;Lunar&apos; which in turn is derived from the Latin word for &apos;Moon&apos;.<br />It used to be popular belief that insane and psychologically disturbed people had been effected by the phases of the moon.","time":1444390150824},"pso2":{"definition":"PSO2 is short for Phantasy Star Online 2, the most recent, free-to-play Japanese MMO created by Sega.  The game, as all previous games of the Phantasy Star series have done so in the past, is being updated weakly from weekly maintenance, as new content is usually fresh. It is similar to other popular MMO&apos;s as it is, &apos;grindy&apos;, somewhat sluggish, and a matter of time consumption to gain levels. PSO2 seems to be most popular in Japan, and North &amp; South America. However, people from all around the world play the game, regardless of Sega&apos;s refusals to localize the game, as well as the ToS (Terms of Service) specifically claiming non-JP IP&apos;s are not to be playing their game. It has been noted that Sega was at first lethally active at removing foreign players, but now has the &apos;rule&apos; mostly relaxed. Sega still seems to occasionally ban foreign players. It is clear that Sega favors the Japanese players in favor of certain rules, as this is who they purely cater to, in the original release of the game.  You may download PSO2 from www.pso2.jp","time":1444391436243},"pso":{"definition":"1. Short for Phantasy Star Online<br />2. An addicting drug that is taken through the eyes, highly addictive in large doses, smaller doses cause intrigue","time":1444391456128},"johncena":{"definition":"Right as you cum while getting a blowjob, pull out of her mouth and blow your load right into her eyes. <br /><br />Proceed to wave your hand in front of your face and go &quot;YOU CAN&apos;T SEE ME!&quot;","time":1444392441766},"imo":{"definition":"&quot;In My Opinion&quot;","time":1444393671404},"sexdungeon":{"definition":"Any form of dungeon where sexual activities occur.  At one extreme this is a spare room in a house containing some vaguely dungeony artefacts like plastic handcuffs where a consensual couple may role play S&amp;M when they are in the mood for some minor kink.  The other extreme is an actual dungeon in the dark, dank bowels of an actual castle where individuals are held permanently against their will and forced to perform unspeakable acts for the gratification of their captor.","time":1444394884418},"bass":{"definition":"A misunderstood and underestimated instrument. Some retards with no musical sense think that a bass player is a lesser form than a guitar player but they don&apos;t realise that in many songs, a guitar would sound very shitty without the bass. Same goes for the guitar, a bass sounds... boring without a guitar. The two go hand in hand, whether added synthetically or actually played. I am a bassist and I have never layed hands on a guitar, they just don&apos;t interest me. So alot of bassists aren&apos;t failed guitarist. I chose to be a bassist because I love the sound and have an appreciation for its importance.","time":1444395938634},"allaboutthatbass":{"definition":"This song is by far the most...  Fucking stupid of all Meghan Trainor songs. And all of her songs are stupid. This song is tired, out dated, and annoying. Also this phrase is used to describe fatness","time":1444395956647},"circleofdeath":{"definition":"a crazy drinkin game where you get wasted make up dumbass rules drink at every opportunity and wake up with no knowledge of the previous night","time":1444396278412},"black":{"definition":"1.Darkness, a dark colour, the colour of this text is black.<br /><br />2.A race - The black race can range from African american to polynesian.","time":1444396700580},"white":{"definition":"1. The color white.<br /><br />Contrary to popular belief the word &quot;white&quot; is not a racial comment or slur.","time":1444396718425},"selena":{"definition":"The coolest bitch. Shes bad ass as hell. Talk shit expect to get hit. Hot. Pretty. Beautiful. Don&apos;t hate. She&apos;s nice to everyone. Hates drama. And bitches. The complete oppostie from a hoe&#x2f;slut&#x2f;whore. Get it right.","time":1444397194228},"bonsoir":{"definition":"1. The French translation for &quot;good evening&quot;<br />2. Elegant way of expressing the term &quot;fuck you later&quot;","time":1444400002819},"nillas":{"definition":"This word came about for a need to have a racial slur for white people that is as cool as nigger for black people.  It does not imply the lameness of honkie or cracker.  Instead, a nilla is a white kid, who is both a slave to the freaky ass booty and enjoys chillin with his boys.  Note: Nilla&apos;s do not act black","time":1444400130699},"pike":{"definition":"Nickname for the Pi Kappa Alpha Fraternity.  Pike is renowned nationally for its size and prominence. Pike may refer to the physical fraternity house or the social organization.   ","time":1444400643601},":t":{"definition":"a side- smile. can show innocence, or used  to lighten up awkward situations ","time":1444400674107},"couch":{"definition":"Where you sleep when you get your girlfriend mad; but not mad enough to be kicked out of the house.","time":1444402183387},"catfishing":{"definition":"The phenomenon of internet predators that fabricate online identities and entire social circles to trick people into emotional&#x2f;romantic relationships (over a long period of time).  Possible motivations: revenge, loneliness, curiosity, boredom  The term catfishing was inspired by the 2010 documentary &quot;Catfish.&quot;","time":1444402201327},"starbomb":{"definition":"A holy shit amazing album about Nintendo games by [Egoraptor] And [Ninja Sex Party].<br />There has been one album at the time of this definition, but there is going to be another&#x2f;more.","time":1444403331180},"ass":{"definition":"(_!_) = Normal Ass<br />(__!__) = Big Ass<br />(!) = Tight Ass<br />(_?_) = Dumb Ass<br />(_E=MC2_) = Smart Ass<br />(_$_) = Rich Ass<br />(_x_) = Kiss My Ass<br />(_X_) = Get Off My Ass<br />","time":1444403384962},"omd":{"definition":"The French counterpart of OMG, omd is internet slang for O Mon Dieu.","time":1444404235051},"mdr":{"definition":"French equivelant of LOL, litterally meaning &quot;mort de rire&quot;, &quot;Death from laughter&quot; or &quot;dying of laughter&quot; (though it should be note that most French people still know LOL)","time":1444404248301},"fdr":{"definition":"The thirty-second President of the United States.  Guided the U.S. through World War II, helped millions of Depression-stricken Americans with his relief programs, and instituted the remarkably effective Tennessee Valley Authority.","time":1444404840690},"jfk":{"definition":"a.k.a. &quot;The Magic Bullet&quot; - Have a girl wear a blindfold while she is giving you head. At the same time, have a friend sneak in behind her and pleasure himself behind her. Both of you let &apos;em rip at the same time and nail the skank with goo from both sides of her head. She will always question if there was a second shooter or it was just a magic load.","time":1444404857099},"perma'd":{"definition":"Permanently banned.","time":1444404861436},"mybaby!":{"definition":"The most amazing, beautiful, perfect girl in the whole world.","time":1444405375547},"netflixnchill":{"definition":"When you burrito yourself in a blanket and watch Netflix alone &apos;cause your bae doesn&apos;t want to visit pound town.","time":1444406144996},"netflixandchill":{"definition":"It means that you are going to go over to your partners house and fuck with Netflix in the background.","time":1444406161609},"youtubeandchill":{"definition":"When you want to get laid but you can&apos;t afford $14.99 a month.","time":1444406195517},"that":{"definition":"A universal measurement, can be used for almost anything.<br />A way of measuring the extent of adverb.","time":1444406935897},"thot":{"definition":"A Thot is a hoe. Plural: Thotties","time":1444406945193},"who":{"definition":"A legendary rock band. They wrote songs like &quot;My Generation&quot;, &quot;Love Rein O&apos;er Me&quot;, &quot;The Seeker&quot;, &quot;Wont Get Fooled Again&quot;, &quot;Baba O&apos; Riley&quot;, and a bunch of other songs.","time":1444407217126},"hoe":{"definition":"1. A skank<br />2. A woman that is too loose in the booty.<br />3. Woman or man that fuck anything with two legs.<br />4. A promiscuous person.[syn: slut]<br />                        ","time":1444407220892},"ho":{"definition":"A word Santa Clause says three times when he sees your wife, mother and sister together in the same room.","time":1444407226310},"maybe":{"definition":"You can use this word for anything, it can mean yes or no or just an answer because you cannot be bothered making up anytbing more elaborate. It can piss people off, it can amke them happy all in all it seems to be a pretty great word.","time":1444407247223},"serious":{"definition":"Intense; hardcore.","time":1444407312916},"hardcore":{"definition":"Intense.  Relentless.","time":1444407343727},"relentless":{"definition":"someone who is cruel, evil, pitiless, merciless, and that never ceases to be bad to others. (the jails are full of these people). ","time":1444407368754},"crook":{"definition":"someone who has committed (or been legally convicted of) a crime","time":1444407890927},"dinosaurus":{"definition":"The ultimate [dinosaur].","time":1444407896951},"nickiminaj":{"definition":"a female rapper from the US who is so completely insane that she makes Lady GaGa, look kind of boring","time":1444407913531},"ladygaga":{"definition":"A very bad joke played on all of us by Tim Burton.","time":1444407923723},"virgin":{"definition":"n.  Person who has not yet had sex.  Largely believed to be mythological.<br />","time":1444407998265},"gaylord":{"definition":"The Ultimate insult...in which nothing can outmatch. In using Gaylord you are saying somebody is essentially the Ruler of all Gays.<br /><br />A Gaylord is a about 100x10^999 times more insulting than all of those words combined. Unlike many other definitions claim, Gaylord cannot be beaten by &quot;fuck you&quot; or any other insult. <br /><br />Gaylord is a classic insult used many centuries ago, but recently has become lost in time...fortunatly it is slowely being brought back into everyday use.","time":1444408168916},"roflmao":{"definition":"<br />This Awsome Accumulation of letters means Rolling on Floor Laughing My Ass Off<br />","time":1444408186141},"pasta":{"definition":"One of the most good, healthy, handy, inexpansive food ever.","time":1444408194870},"chaotic":{"definition":"The Danish card game brought over by 4kids Entertainment to the Americas. ","time":1444408499627},"finland":{"definition":"Also home of great rally drivers and people who can drink pretty much anyone under the table.","time":1444408673120},"island":{"definition":"A bowel movement so large that it breaks the surface of the toilet water, creating an island in the bowl.","time":1444408685502},"stop":{"definition":"To cease a motion.<br />","time":1444408699007},"iceland":{"definition":"Iceland is, as has been well documented, a small island in the North Atlantic. It was settled in the 9th century, mainly by Norwegians and other Scandinavians, but also by a few Celts from Scotland and Ireland. There is a theory that the Norwegians in particular left for Iceland to escape the growing tyranny and expanding power of the Scandinavian Kings, especially King Harald Fair-hair of Norway. The first settler was Ingolfur Arnarson, arriving in 870 AD, and he built a farm on the site of modern day Reykjavik, the capital. Iceland was the first republic and developed a system of proto-democracy with a national Parliament called the Althing established in 930 AD, and a very sophistocated system of law developed. This was surprisingly liberal; women had practically equal rights to men. For instance, they could take part in legal proceedings and declare themselves divorced whenever they wished, whilst retaining all property rights. Considering women only got equal property rights in Britain in the 19th century, this is impressive I feel. <br />The term &apos;Viking&apos; as an ethnic term is wrong; to the Scandinavians it meant specifically a raider, so not all, or even most, Icelanders were Vikings. Practically all were simple farmers. No towns existed in medieval Iceland, and farms were self-sufficient units.<br />An Icelander was the first to land on Greenland, which was settled by Eirik the Red after he had been outlawed from Iceland, who called it this to make it more attractive to other settlers. It was his son, Leifur, nicknamed Leif the Lucky, who was the first European to set foot on the continent of North America (not Christopher Columbus) around 1000 AD, the year in which Iceland became Christian by democratic vote. Leif christened the area Vinland, after the wild grapes he found there. Nobody has been able to prove the exact location of Vinland.<br />Geographically, Iceland is mostly volcanic, and large areas of it are covered in lava fields. It has geysers, hot springs and sulphorous jets of steam coming from the ground, as well as active Volcanoes. The amount of geothermal energy at her disposal means that Iceland is a very environmentally green country. However, it also means that all the washing water smells slightly of egg. Iceland also has Europe&apos;s most powerful waterfall (Dettafoss) and Europe&apos;s largest glacier (Vatnajokull), which did feature in the James Bond film &apos;Die Another Day&apos;.<br />Iceland is famous for its medieval literature, which ranks as amongst the finest in the world. These are mostly sagas, the most famous being Egil&apos;s Saga, Njal&apos;s Saga, Laxdaela Saga and Volsunga Saga, the last of which was a major inspiration for Tolkein and Wagner. However, Iceland also produced histories such as The Book of Icelanders and The Book of Settlements by Ari the Learned, and the most important source on Norse mythology, Prose Edda by Snorri Sturluson.<br />Icelandic has changed relatively little since then, and the system of patrynomics, and sometimes matrymonics is still used. For example if a man called Njal Eiriksson had a son and a daughter, they might be called Ingolfur Njalsson and Gudrun Njalssdottir; they would not have the surname Eiriksson.<br />In 1262, Iceland came under the control of Norway, and Denmark in 1380, but regained Home Rule in 1874 and became fully independent in 1944. Today, Iceland is most commonly known for musicians Bjork and Sigur Ros, being the most expensive country in Europe, puffins and reindeer, the Northern Lights, and being cold. However, this does not even come close to doing justice to this beautiful, sometimes bleak, truly unique landscape and its rich and fascinating history and mythology.<br />","time":1444408709594},"greenland":{"definition":"Despite the name, Greenland is white with ice and snow. ","time":1444408723346},"u":{"definition":"Shorthand for the word &quot;you.&quot;  Commonly used on the internet by those of low intellect, or those who are much to lazy to type a three letter word.","time":1444408737804},"africa":{"definition":"A place where constant genocide, slavery, raping, and primitive human behavior can be seen on a daily basis. In short a cluster fuck of a continent. Tribal battles, fighting over natural resources and overall lack of cooperation ensure this place will stay the way it is for centuries to come. Africa has a history of being taken advantage of by both corporations, foreigners, and even its own people. Somewhat like the Middle East. Africa is also a money pit for anyone trying to help out because the money gets stolen, poorly distributed, or embezzled by the very officials that are supposed to be helping their countries. The only good thing to come from Africa is my fiancés engagement ring.","time":1444408739269},"smh":{"definition":"Acronym for &apos;shake my head&apos; or &apos;shaking my head.&apos; Usually used when someone finds something so stupid, no words can do it justice. Sometimes it&apos;s modified to &apos;smfh&apos; or &apos;smmfh&apos; by those that prefer profanity in their internet acronyms.","time":1444408765217},"merica":{"definition":"America","time":1444408779503},"murica":{"definition":"The way un-educated Americans (generally rednecks, hicks, republicans, or very patriotic people) say America.","time":1444408787527},"america":{"definition":"A country that claims the name of an entire continent to itself alone for no compelling reason.","time":1444408810882},"southamerica":{"definition":"The place where the people are BEAUTIFUL, PROUD, and WARM, where the sites are BREATH-TAKING, where culture LIVES, and there is always a PARTY near by!","time":1444408821702},"germany":{"definition":"The country Hitler wasn&apos;t born in.","time":1444408867702},"austria":{"definition":"a very beautiful country in europe, famous for the ALPS and the amazing scenery, good music, fantastic food and gorgeous girls!<br />the best skiers are from austria! arnold schwarzenegger is too! mozart is ! sigmund freud (the sex-obsessed psychoanalysist) is ! red bull aswell! and beautiful heidis!","time":1444408879482},"rofl":{"definition":"ROFL is an internet accronmym for Rolling On Floor Laughing, and like all things internet it has adapted to nerd culture and has taken on new real-life use, though usually in a satirical way.<br /><br />ROFL can be merged with other accronyms to created super [l33t] acronyms that &quot;r0x0r y0ur b0x0rs&quot; per se. Some examples of the merged accronyms are as follows:<br /><br />ROFLAARP: Rolling On Floor Looking At Assorted Rodent Pornography<br /><br />or<br /><br />ROFLEW: Rolling On Floor Laughing whilst Eating Waffles","time":1444409403453},"elephantiasis":{"definition":"The correct term for the medical condition commonly known as [elephantitis]. It is the massive swelling of the legs and genitals, generally caused by obstructions of the lymphatic vessels.","time":1444409592749},"shz":{"definition":"Going to be a Virgin for life","time":1444410254644},"aranryan":{"definition":"A complete psychopath that originates from Ireland, who also happens to be a boxer. If you don&apos;t put up a good fight, he will use taunts such as, &quot;You&apos;re pretty, like my sister.&quot; And, &quot;Ya probably got cheeseburgers in those gloves, have ya Mac?&quot; He also has a creepy stare. If you see him, just run for your life.","time":1444410333104},"paint":{"definition":"The greatest art package of all time. Ships with versions of [word]windows[&#x2f;word]. Pictures created in Paint often look like they were drawn by children.","time":1444411010931},"bluejays":{"definition":"The greatest baseball team in the American League, fuck New York or Boston, thy&apos;ve had thier time. Joe Carters walk-off World Series winning homerun was the highlight of the whoe AL for all its rich history. to prove they are the greatest, they shut out the New York Yankees 22-0. All i have to say is LETS GO BLUE JAYS","time":1444411129365},"dude":{"definition":"A word that americans use to address each other. Particularly stoners, surfers and skaters.","time":1444411960412},"headquarter":{"definition":"aka HQ<br />1. A central place for a group or organization.<br />2. Slang for PC Shop where people play World of Warcraft, Dota and other gay ass games.","time":1444411984284},"kkk":{"definition":"A bunch of racist morons, who think that they are superior only because they are to stupid to obeserve their low position amongst the scum of society. In fact so stupid they burn their own religion to show faith!? The word stupidty doesnt begin to explain the moronic logic and manupulative ways in which they scheme only to discoer the abomination to mankind that they are.","time":1444412208448},"whori":{"definition":"Whori is a usually a girl named Tori. She&apos;s soo much of a wanna be whore that it&apos;s inevitable she will be one in the future. Even if a girl&apos;s name isn&apos;t Tori, as long as she&apos;s a wanna be whore she can be given the name &quot;Whori&quot;.","time":1444413241966},"lvl":{"definition":"lvl=level<br /><br />Often uses when talking about computer games, often rpg ([rpg]) games.","time":1444413554227},"nu":{"definition":"Derived for Yiddish: meanng &quot;So?&quot;","time":1444413728167},"os":{"definition":"ounces,particularly of crack <br />","time":1444413829476},"oreo":{"definition":"what black kids at my school are called if they aren&apos;t intolerant and disrespectful trolls who hold up the hallway everyday in between class pushing pot and cutting the entire lunch line.","time":1444413843169},"boypussy":{"definition":"Often associated with homosexuality, the boypussy is the male anus.","time":1444413918674},"afk":{"definition":"Away From Keyboard.","time":1444413951764},"af":{"definition":"The acronym stands for &apos;as fuck.&apos;","time":1444413953056},"imdead":{"definition":"You died of laughter, aka something is that funny you laughed so hard you died.","time":1444413998293},"cus":{"definition":"term used for friend(kuz)<br />","time":1444414010142},"donaldtrump":{"definition":"Living proof that money can&apos;t buy good hair.","time":1444414039998},"suckmydick":{"definition":"It informs people you have an erection, and wish for your penis to be sucked.","time":1444414172050},"hooter":{"definition":"what you have to look at when a girl is talking to you","time":1444414508878},"pepe":{"definition":"The Most Powerfull being in the whloe universe after Chuck Norris, he&apos;s indestructible and invincible, some people think he is only a myth, but he&apos;s 100% Real","time":1444414728675},"doge":{"definition":"wow<br />so urban<br />very informatiev<br />much confuse  wow","time":1444415149387},"mk":{"definition":"Shortened version of umkay, which is slang for okay.","time":1444416314866},"lennyface":{"definition":"A unicode emoticon used when something might be edgy.<br />( ͡° ͜ʖ ͡°)","time":1444417185374},"pussy":{"definition":"The box a dick comes in","time":1444417210549},"deadspace2":{"definition":"A survival horror video game. The game features an extremely easy starting area that only one person has failed to complete. See [zotted]","time":1444417402092},"inazumaeleven":{"definition":"a shoujo anime that&apos;s suppose to be about soccer, but it&apos;s really about the budding relationship between endou and gouenji before gouenji turned to drugs and became the seitei","time":1444417421837},"p3":{"definition":"Ther ethics of smoking maryjane<br /><br />Puff Puff Pass ","time":1444417425898},"ayylmao":{"definition":"A common phrase spoken by extra terrestrials, the only phrase that does or ever will matter and could mean anything.","time":1444417554976},"ded":{"definition":"adj.  Ded is when you are dead from joy, hilarity, sexiness, or other great feelings as such.<br /><br />There is a large difference between ded and [dead].  Do not confuse the two.<br /><br />The verb form is &apos;deds&apos; or &apos;dedded.&apos;<br />","time":1444417566560},"dead":{"definition":"Britney Spear&apos;s career","time":1444417583877},"rickandmorty":{"definition":"Rick and Morty is a crazed animated Adult Swim show that features an alcoholic mad scientist (Rick)<br />who drags his hapless grandson (Morty) into outrageous sci fi adventures.","time":1444418223948},"rock":{"definition":"used to defeat scissors in a game","time":1444418301213},"papar":{"definition":"the high class word for cool.","time":1444418334503},"paper":{"definition":"Slang term for &quot;money&quot;.","time":1444418345026},"scissors":{"definition":"Verb meant to describe any situation where two females engaged in lesbian lust spread their legs wide open facing each other. Then they hook up their meat pockets by sreading around each other&apos;s vag. Kicking their legs jumping jack-style is an exciting finishing move to go along with scissor action.","time":1444418353592},"et":{"definition":"An asshole alien with a large finger that it uses to violate innocent men, women, children, and doggies alike.","time":1444418464406},"darksouls":{"definition":"Dark Souls is the Sequel to the 2009 PS3 exclusive title &apos;&apos;Demon&apos;s Souls&apos;&apos;. Dark Souls is an action RPG released in October 2011 by Bandai Namco and From Software.  In Dark Souls you play as a chosen Undead or &quot;hollowed&quot;. Aside from the opening cinematic, the game lacks any real overarching story and is instead told by your interactions with various NPCS. The game features an open world with many interesting bosses each with their own unique looks and attacks.  Dark Souls is mistakenly considered a very difficult game, however, it is more of a trial and error game similar to Capcom&apos;s Mega man franchise. Players are meant to die in the game over and over until they eventually learn what they are supposed to do.  Dark Souls features a unique online multiplayer system where players can enter another players game and assist them with killing enemies or to duel in PVP.  The game features a lot of character and weapon customization and will keep players occupied for a long time.","time":1444418584225},"sisterfister":{"definition":"The act of fisting your sister. Commonly refered to as incest.","time":1444418669217},"darksouls2":{"definition":"Long story short: Death Simulator 2014.  Dark Souls 2 is the sequel to From Software&apos;s 2011 smash hit &quot;Dark Souls.&quot; In Dark Souls 2, the player takes the role as an undead who bears the curse of Hollowing each time he or she dies. During the player&apos;s endeavours within the open world of Drangelic, the world within the game, he or she will encounter dangerous enemies, traps, and most certainly bosses. These bosses can be simple, or they can be hair-tearing-out rage inducing, much like &quot;Dark Souls.&quot;  NOTE: Life may occur in Dark Souls 2. If you stay alive for more than one hour, you may be hacking.","time":1444418704063},"saur":{"definition":"Sympathetic audio urinary reflex.<br /><br />The sudden uncontrollable urge to urinate when pouring liquids  or hearing the sound of pouring liquids.","time":1444419095453},"whatarethose":{"definition":"This is what you say&#x2f;scream when you see someone wearing shoes or other footwear that are dirty and&#x2f;or non-brand unknown. You should also point your finger in the air then while saying &quot;what are those?!&quot; Make your way down to the person shoes, all while their back is turned.","time":1444419634501},"fuckboy":{"definition":"A person who is a weak ass pussy<br />that ain&apos;t bout shit.","time":1444420169232},"fuckboi":{"definition":"A guy who tries to get with everyone. A player. A guy who will lie to a girl to make them hook up with them or send pics. They think they are the shit when they aren&apos;t. A guy who will only date a girl for their body. A total ass. A guy that will make a girl cry and laugh, and a guy who lies when they said I love you","time":1444420177569},"bitchnigga":{"definition":"A man who, instead of behaving in a manly way, such as standing up for his actions or staying out of other people&apos;s buisness, behaves the way a woman, or bitch would, participating in gossip and talking behind other people&apos;s backs, with the ultimate goal of causing drama, like a woman (bitch) would.","time":1444420180887},"spam":{"definition":"spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam ","time":1444420545270},"jw":{"definition":"just wondering","time":1444420628892},"sober":{"definition":"A state in which you are not under the influence of any intoxicating substance.","time":1444420909805},"xanadu":{"definition":"A song about an ice mountain paradise by the band Rush.","time":1444421881956},"paramedics":{"definition":"An absolute hero. Largely unappreciated by the general population until they are gasping for their last breath after 25 pints of Stella and a kicking par excellance on a Friday night.","time":1444422627999},"scales":{"definition":"A common bathroom item that when you step on it, it makes you cry. ","time":1444422755009},"izzy":{"definition":"Izzy is a midget with amazing hair and a pretty face. She is one of the loudest people you will ever meet and she is very opinionated and will stick by you, no matter what. Izzy is the bestest friend you could wish for.","time":1444422913390},"lizzy":{"definition":"Usually a name associated with extreme maturity and an amazing sense of humor as well as some serious junk in the trunk.","time":1444422972002},"digimon":{"definition":"1.  An anime series that has been constantly slandered by pokemon fans and attempts to ruin it were made by horrible dubbers, but is still truly one of the greatest(And darkest.) anime of all time, and has spawned quite a large fandom(And some truly great fanfics.)  Anyone who says they saw the dark masters arc and didn&apos;t shed a single tear is either inhuman, lying, or having a serious problem with his or her tear ducts.(AKA [Digimon Adventure])<br /><br />2. [Digimon Tamers]<br /><br />3. [Digimon Frontier]<br /><br />4. An assortment of various monsters that are the native inhabitants of the digital world in any of the digimon series.","time":1444422980156},"mon":{"definition":"Jamaican way of saying man.","time":1444422991655},"salvation":{"definition":"A gift from God through Jesus","time":1444423071167},"noticemesenpai":{"definition":"It&apos;s a Japan thing. Apparently, it&apos;s from anime. Senpai means someone you&apos;re suppose to look up to. (in this case a senior or a teacher if you&apos;re thinking of that chick from Misao who liked her teacher.) All in all &apos;Notice Me Senpai&apos; means you want someone older than you to like you.","time":1444423519375},"senpai":{"definition":"Someone who will never notice you.","time":1444423528143},"jd":{"definition":"1.The coolest dork i know and the main character on scrubs.<br /><br />2. somebody who [trip]s or hallucinates frequently.","time":1444423988379},"uglycute":{"definition":"Used to describe a homley, funny looking pet; usually a doggy or pussycat that is so ugly it&apos;s actually cute. You tend to feel sorry for this critter. The runt of the litter. Bull dogs, pugs, chihuahuas, manx and hairless cats come to mind.","time":1444424174641},"css":{"definition":"Counter Strike: Source<br />Counter Strike ([cs])on the [Source] engine.","time":1444424241487},"twat":{"definition":"1) A great word to shout out.<br />2) A woman&apos;s vagina.<br />3) A blow to the face or genitalia.<br />4) Used by Tweety.<br />5) An offensive term for a person.<br />6) Acronym for The War Against Terrorism.","time":1444424352620},"ro":{"definition":"Racial Oppression. Unfair treatment of a specific ethnic group. See the [Holocaust].","time":1444424637378},"row":{"definition":"a verbal fight","time":1444424638304},"boat":{"definition":"1000 pills of ecstasy","time":1444424640129},"rowboat":{"definition":"A politically correct word to say retard.","time":1444424650840},"casa":{"definition":"Casa is Spanish for house.","time":1444424762794},"essu":{"definition":"Essu is a bro who lifts. He has uber $w@g and ain&apos;t there nuttin&apos; he can&apos;t fite against cuz all dat brosciencemagic","time":1444424767621},"racy":{"definition":"1)a very sexy girl, only some can pull that name off<br />2)risque<br />3)sexual impropriety","time":1444425124944},"falter":{"definition":"To hesitate, quit!","time":1444425149900},"ghast":{"definition":"The Huge, flying, white, ghost-like enemy found in The Nether in the computer game [Minecraft]. They shoot fireballs.","time":1444425269785},"fetish":{"definition":"1. An object thought to have [magical], especially magically sexual, powers<br /><br />2. A sexual fixation or obsession with a usually non-sexual object. EX. socks, horses, monkeys, pain, bondage","time":1444425616475},"root":{"definition":"1.  A Kiwi&#x2f;Australian slang that is used in place of the more commonly used term &quot;fuck.&quot;<br />","time":1444425886465},"faggoy":{"definition":"A person that is stupid or lame, but not gay. Oftentimes spends an inordinate amount of time on imdb or picking out sandals and socks combos.","time":1444425958964},"faggot":{"definition":"In these times not really used if somebody is really a homosexual mostly used insteap of calling somebody stupid or a loser.","time":1444425972508},"oreos":{"definition":"what black kids at my school are called if they aren&apos;t intolerant and disrespectful trolls who hold up the hallway everyday in between class pushing pot and cutting the entire lunch line.","time":1444426076082},"breakfast":{"definition":"A mythological event before the dawn of time.","time":1444426307240},"mynigga":{"definition":"your partner through think and thin. someone who will always help you out, no matter the situation.","time":1444426332066},"nigganigga":{"definition":"Your niggas nigga.  So much a good nigga that he gotta be your best niggas nigga.","time":1444426352149},"nigganigganigga":{"definition":"An amazing parody song on YouTube describing niggas. In the &quot;This is Gangsta Rap&quot; series.  Look up: This is gangsta rap- nigga nigga nigga","time":1444426362394},"cbb":{"definition":"Can&apos;t be bothered","time":1444426400870},"rg":{"definition":"An internet chat abbreviation for &quot;retarded giggles&quot;; applicable when reading a message and in stead of &apos;laughing out loud&apos;, you let out a short, obnoxious, manatee-sounding laugh. An &apos;RG&apos; can also be considered such if the person tilts there head back in laughter, appearing to unhinge their jaw from hysteria. ","time":1444426492655},"smogon":{"definition":"Smogon is definitely a happening. It all dates back to a while ago when Brainman was getting bored and decided to get a new IRC nickname. He chose Smogon. Little did he know that he was about to unleash a huge plague on the world; greater than the bubonic plague even!<br /><br />Smogon, the German Nazi Koffing, would soon dominate the web! Pokemon on the internet. Let&apos;s make it happen.","time":1444426900157},"honedge":{"definition":"When two males with erections get naked and fight to the death with their &quot;Honedges&quot;","time":1444427555547},"d":{"definition":"&quot;a way of referring to your dick without the extra letters&quot;","time":1444427579987},"peeness":{"definition":"needing to go pee","time":1444427585034},"global":{"definition":"synonym for dank. something that is way bomb.","time":1444427673517},"putin":{"definition":"Pronounced: &quot;Huylo&quot; [xʊj&apos;lo]  Sitting Russian Tsar.","time":1444427993354},"charge":{"definition":"When your friend puts the end of a blunt in his mouth, and blows the smoke into your face while you breath in as much smoke as possible.","time":1444428098949},"ward":{"definition":"sections of a citiy usually divided up for municipal or district purposes. Wards are typically similar in size but not always in numerical order;for example in new orleans the 15th and 16th wards are not close to each other at all.streets have nothing to do with the names of wards however certain streets do mark the border of a ward.","time":1444428108963},"chigga":{"definition":"What people call &quot;Asians who are influenced by urban hip-hop culture&quot; when it means &quot;Asians who want to be black.&quot; They say chigga because of the -Ch in Chinese and the -Igga from Nigga. They think that any asian who likes hip-hop is dying to be black.","time":1444428375382},"shrek":{"definition":"A large green ogre. With a donkey friend.","time":1444428513445},"cyberbullying":{"definition":"A terrible excuse for being an idiot on the internet and getting yelled at about it.","time":1444428527702},"yung":{"definition":"A slang pronoun, originated in the DC metro area, used in place of someone&apos;s name<br />Used randomly or in mid-sentence","time":1444428793911},"randy":{"definition":"Overly excited in a sexual manner. See also [horny].","time":1444428795221},"randymarsh":{"definition":"Father of Stan Marsh in [South park]. Can be overdramatic at times and is one of the most prominent parent characters in [South Park]. Has a drinking problem and is discreetly gay.","time":1444428803230},"li":{"definition":"A very common last name for Chinese people. Pronounced as &quot;Lee&quot;. Only dumbasses pronounce it as &quot;lie&quot;. It&apos;s also written as &quot;Li3&quot; in Chinese pinyin, not fricken Lee. Some people spell it Lee because of the retards out there saying it wrong.","time":1444428832285},"ky":{"definition":"the original and best sexual lubricant on the planet","time":1444428881376},"testical":{"definition":"1.A man&apos;s origin and source of supreme power<br />2.Superman is to sun, and man is to testicals, yet it is as superman is to kryptonite as man is to testicals<br />3.A man&apos;s power and weakness<br />4.Ball&apos;s of nerves, very sensitive to the touch, very agrivating to the tap, very nausiating to the punch, and death to whoever kicks them.","time":1444428964186},"cock":{"definition":"The male reproductive organ.  Used as a secondairy brain at times.","time":1444429653818},"plain":{"definition":"someone who may be [normal] or [boring]. <br /><br />nothing is really going on for them. physically just average features not ugly or pretty. <br />mentally just not exciting to talk to, dont do much cool stuff.","time":1444429748564},"hig":{"definition":"A sexual position which favours the woman often resulting in a mind blowing [orgasm]. Similar to [doggy style] but with a &apos;reach around&apos; towards the [clitoris] and the woman moving to spell the word &apos;HIG&apos;","time":1444429934794},"testicularcancer":{"definition":"Hurts like BALLS. Actually, just plain hurts balls.","time":1444430532262},"uk":{"definition":"A fantastic country that once ruled the world (yes, literally) and is much cooler than the USA because it is older and cleaner. Also has amazing music such as [Muse] and [Radiohead] and [Biffy Clyro] and [Arctic Monkeys] and [Mumford and Sons] and [Marina and the Diamonds] and [Florence and the Machine] and so much more. However, none of this amazing music ever gets in the charts for long because music charts have been hijacked by [chavs] and their fake RnB which actually is badly disguised pop (see [JLS]). However, amazing venues still exist across the UK, the best including the Hammersmith Apollo, the Brixton Acadamy, The O2 Arena and many, many more. Even Wembley Arena has its merits, despite their &apos;confiscating staplers at Arctic Monkeys concerts&apos; policy and the fact that I was hit on the head by a condom-balloon there.  Also very prevalent in the UK is clever people. Many students learn Latin and are teased mercilessly about it and amazingly avoid being &apos;binned&apos; by jealous chavs.","time":1444430809136},"ws":{"definition":"(n) Acronym for &quot;watersports&quot; or sexual contact involving pee or urine","time":1444430813527},"yk":{"definition":"abbreviation for &quot;you know&quot;","time":1444430818804},"chillout":{"definition":"Shut up, relax, calm dowm","time":1444430950517},"bo":{"definition":"B.O, body odour. A nice smelling smell that you get if you don&apos;t shower regulary and sweat a lot.<br />Pronounced as BEE-OH","time":1444430997419},"chan":{"definition":"a japanese honorific, or suffix added to the end of one&apos;s name. chan is usually used when:<br /><br />1. the person is a small child, ie, younger sibling or friends sibling<br /><br />2. the person is cute, usually younger, usually a girl<br /><br />3. can be used on pet cats, dogs, etc..<br /><br />-chan is mostly used by those in the anime community in america. chan is not often used unless you are familiar with that person and they are younger then you, or they are someone you are familiar with&apos;s younger sibling. since chan can mean cute, some boys looking to be manly may be a bit offended by it. also, it should be noted that the suffix chan is used mostly among friends. you wouldnt greet a freshman you dont know as chan, but perhaps as &lt;their name&gt;-kohai. (kohai meaning something along the lines of lower classman)","time":1444431006746},"ggwp":{"definition":"good game, well played","time":1444431673713},"doggone":{"definition":"A [politically correct] deviation of the expression &quot;[goddamn]&quot;. Mainly used in the southern United States.","time":1444432192583},"kg":{"definition":"The act of licking the sensitive area between the ball sac and the anus.","time":1444432306727},"beast":{"definition":"UK Slang- a person who is very good at something","time":1444432327842},"yorkshireterrier":{"definition":"A small dog that resembles a [toupee] with legs.  Its fur looks like something you would pull out a clogged drain in a bathtub.  Often owned by [overweight single women] due to the fact that it doesn&apos;t need as much exercise as most other dogs.<br /><br />Yorkshire Terriers are dumb, difficult to [house break], and tend to be [territorial] despite the limitations of their size.  They often attack strangers and larger animals, disregarding their own size disadvantage.  These behaviors are, however, encouraged by their owners because they see it as being &quot;cute&quot;.<br /><br />These dogs are probably the best example of [artificial selection].  They have weak bone structure which causes them to be unable to survive short falls.  They also are known to suffer from things like [seizure], [liver shunt], and [collapsed trachea].  ","time":1444432426313},"husky":{"definition":"[1] A term mothers often use to say to their overweight son when the son says he is fat.<br /><br />","time":1444432447914},"beagle":{"definition":"A miniature Foxhound, solid and big for his inches, with the wear-and-tear look of the hound that can last in the chase and follow his quarry to the death.<br />Usually stand no more than fifteen inches to the shoulder.<br /><br />OR<br /><br />A talisman of British ineptness at space exploration... currently a probe lying in zillions of pieces on the surface of Mars.","time":1444432464374},"poodle":{"definition":"a dog with a puffy tail","time":1444432471598},"martian":{"definition":"Some one who sees the world on a multidimensional level,yet has the understanding that everything and everyone is interconnected like a single organism. Many martians smoke weed and&#x2f;or use psychedelic drugs to further enhance their knowledge,creativity, and understanding of the universe.","time":1444432477470},"germanshephard":{"definition":"The German Shepherd Dog (GSD, also known as an Alsatian), (German: Deutscher Schäferhund) is a breed of large-sized dog that originated in Germany. German Shepherds are a relatively new breed of dog, whose origins date to 1899. As part of the Herding group, the German Shepherd is a working dog developed originally for herding sheep. Because of their strength, intelligence and abilities in obedience training they are often employed in police and military roles, in forces around the world. Due to their loyal and protective nature the German Shepherd is one of the most registered of breeds. Shepherds were bred specifically for their intelligence, a trait for which they are now renowned. They are considered to be the third most intelligent breed of dog, behind Border Collies and Poodles. In the book The Intelligence of Dogs, author Stanley Coren ranked the breed third for intelligence. He found that they had the ability to learn simple tasks after only five repetitions and obeyed the first command given 95% of the time. Coupled with their strength, this trait makes the breed desirable as police, guard, and search and rescue dogs, as they are able to quickly learn various tasks and interpret instructions better than other large breeds. German Shepherds have a reputation for aggression and have been banned in some jurisdictions as a result. In the United States, German Shepherds are responsible for more random bitings than any other breed, and have a known tendency to attack smaller breeds of dogs. Reports have found that statistically German Shepherds are the breed third most likely to attack a person. Another report found that German Shepherds accounted for almost half of the dog bites that required medical attention. These claims have been refuted on the basis that German Shepherds represent a higher proportion of the population than other breeds. However, reports indicate that Shepherds are over-represented when the statistics take into account the difference in population. German Shepherds are highly active dogs, and described in breed standards as self-assured. The [breed] is marked by a willingness to learn and an eagerness to have a purpose. Shepherds have a loyal nature and bond well with people they know. However, they can become over-protective of their family and territory, especially if not socialized correctly. An aloof personality makes them approachable, but not inclined to become immediate friends with [strangers]. German Shepherds are highly obedient and not easily distracted, but due to their strong self-will must be trained by &quot;[a firm hand]&quot;.","time":1444432484317},"pitbull":{"definition":"1) a breed of dog that is often stereotyped as being violent<br /><br />2) a rapper who is as talented as a bag of shit<br /><br /> ","time":1444432493011},"parolees":{"definition":"A person who has done jail time and fulfils four or more of the following criteria:<br /><br />1) Is from a broken home, particularly with herion addicted parents<br />2) Is a herion addict<br />3) Slit an old lady&apos;s throat for 35 cents<br />4) Stole the faceplate of your car stereo rendering it useless<br />5) Uses Salvation Army vouchers to eat, yet drives a $70,000 dumped BMW<br />6) Asks 5 year olds if they are &apos;chasing&apos;.<br />7) Someone stupid enough to get caught and go to prison in the first place.<br /><br />Shoot these people in the face on sight. There is no such thing as reform or public reintegration.","time":1444432499428},"ag":{"definition":"AG or &quot;aggressive&quot;... a thug gay girl that looks and dresses like a guy. a tomboy.","time":1444432535957},"latale":{"definition":"La Tale is an online MMORPG Developed by Actoz Soft and published by OGP (Online Gaming Planet). The Game was released in Northern america when OGP Signed a deal with Actoz for a north american version. The current NA version is still Beta.  The classes in La Tale are Warrior, Knight, Mage, and Explorer.  Warriors-----------------------------------  Warriors have average stamina levels and exceed in strength. Their speed is also average, and their maximum SP levels as well. This class is recommended if you prefer Offense.  Knights------------------------------------  The Knight is a class that specializes in maximum health. They&apos;re able to survive massive damage, providing a good Tanker character. A [Tanker] can also be referred to as a [Meatshield]. It&apos;s when a character distracts a boss or enemy and takes all the damage while the offense sneaks in and kills the enemy while it&apos;s attacking the tanker. Knights also have Average strength and SP levels.  Mages--------------------------------------  Mages have low health, and extremely high SP. (For example, a lvl 70 mage has health equivalent to a lvl 49 knight) However, of course, mages are very powerful and have healing powers (if your mage is water element.). These supplements make mages a necessity when fighting very powerful entities.  Explorers----------------------------------  Explorers are an all around, fairly good class. Average health and SP, and good attack power. Explorers also have great speed and backflip and other aero-dynamic capabilities. They can also do things other classes can&apos;t (like unlock treasure chests).  2nd Job advancements-----------------------  All classes have a 2nd job advancement they can become when they reach level 80.  Warriors can become Bladers, or Warlords.  Knights become Templars, or Guardians.  Mages become Bards, or Wizards.  Explorers become Treasure hunters, or Gunslingers.  Class weapons------------------------------  NOTE: ALL CLASSES CAN USE KNUCKLES.  Warrior: Two Handed Sword, Spear, Knuckles.  Knight: One Handed Sword, Mace, Knuckles.  Mages: Staff, Dagger &amp; shield, Knuckles  Explorer: Dagger, Bow, Crossbow, Knuckles.  -------------------------------------------  La Tale has not yet reached a high level of popularity, as it only launched in late 2008.  If you were considering to sign up for La Tale, I really hope this helped. Thank you for reading...","time":1444432607540},"bash":{"definition":"to masturbate furiously.","time":1444432617436},"shalom":{"definition":"The Hebrew word for peace, used as a greeting.","time":1444432676643},"allahuakbar":{"definition":"Literally &quot;God is great&quot; in Arabic. Nice thought, however...  what is said by people beheading hogtied victims &quot;in the name of God&quot;  or what is said by someone in a carbomb seconds before he fires it off in a crowded marketplace.","time":1444432685690},"kinky":{"definition":"Foot-sucking, rubber wearing, pee on me, fruit-fuckin&apos;, candlewax drippin&apos;, long fingernail scrapin&apos;, tossed salad eatin&apos;,multiple partner havin&apos;, she-male, oil-drenched, chocolate sauce, whipped cream covered,vibrator usin&apos;,dress-up,banned in 30 states type of sex.","time":1444432706535},"fettywap":{"definition":"Handsome young rapper&#x2f;singer from Paterson, NJ known for his song &quot;Trap Queen&quot; and his squad Remy Boyz ... 1738","time":1444432934671},"pineapples":{"definition":"what the fuck are you looking at the definition of pineapples for you stupid fuck?","time":1444433727378},"meiko":{"definition":"The first Japanese female Vocaloid, and essentially the first Vocaloid Meiko was created by Crypton Future Media. She has a very strong voice, and does not(and really shouldn&apos;t) sound &quot;cute&quot;, so when Hatsune Miku was released, her popularity went down, and it just kept on getting worse and worse. Eventually, there was even a fanmade version called &quot;Sakine Meiko&quot; to try and get her popularity back!  Anyway, Meiko honestly has some of the best Vocaloid songs I&apos;ve heard(Snow Rabbit&#x2f;Yuki Usagi, Accordion in the Golden Sunset, Far Side of The Sky, ect. By the way, these are all subbed.) so if you&apos;ve never heard of her, you should check her out.","time":1444433766287},"peanuz":{"definition":"It means PENIS. Yes, that thing you love more than life itself.","time":1444433809552},"help":{"definition":"what i need","time":1444434234930},"wallace":{"definition":"WALLACE : verb (to WALLACE, Wallaced, Wallacing)  ON THE RIVER Wallace takes three forms:  1) Upwards Wallace - where the boat is flipped and dumps the entire crew (rafting)  2) Downward Wallace - where the swimmer(s) take an especially nasty deep swim (rafting)  3) Baby Wallace - A dirtbag lost his or her seat, paddle, or maybe a custy or two (rafting)  kayakers and C-1ers are Wallaced when they get worked in a hole, run over by a rubber pusher, get an epic beat down, and of course anytime they swim.  OFF THE RIVER:<br />Dirtbags are well known by their frequent slapping of beers and other precious articles (such as paperwork) from each other&apos;s hands. They take the same form as on the river, Downward: off the feet. Upward: off the face. The Baby Wallace is a slight bump of the arm that results in slight spillage, kind of like a warning shot... &quot;Hey Dirtbag, pay attention!&quot; with the added caveat that one must properly declare the Wallace by yelling &quot;Wallace&quot; during the act. (IF YOU DON&apos;T DECLARE WALLACE WHILE BEGINNING THE ACT, YOU ARE AN ASSHOLE AND SUBJECT TO A PUNCH IN THE NOSE!)<br />And no crying or getting angry watching your Wallaced drink soak into the earth! Grab it and pound it out!!!<br />NOTE: highly frowned upon to WALLACE a full beverage. Large stack of paperwork... BONUS POINTS  WALLACE may also be used in lieu of the word BURN!, in it&apos;s declarative form.","time":1444434461984},"1.50":{"definition":"Means when someone is acting crazy or wild","time":1444434489603},"buckfifty":{"definition":"a wound that needs to be closed by approx. 150 stitches","time":1444434497011},"abuckfifty":{"definition":"If you are a UD Editor, it&apos;s how much I paid your Mom to blow me!","time":1444434504077},"cited":{"definition":"Short for excited.","time":1444434755643},"tempo":{"definition":"A midsize car that Ford introduced in 1984 available in 4-door or 2-door.  It was the design example to the Ford Taurus which came out in 1986.  In the late 80s and early 90s it was one of the top selling sedans in North America but sadly production of the vehicle ended in 1994.  It tops out at just under 90 mph and is also refered to as a &quot;put-put&quot; but it gets the driver where they need to go and the car resale is minimal at around $700 tops.","time":1444434771435},"airjuans":{"definition":"they make you run faster and jump higher, but you will still suck at basketball.","time":1444434838886},"aromantic":{"definition":"One who lacks interest in or desire for romantic relationships.","time":1444435155601},"asexual":{"definition":"a person who is not interested in or does not desire sexual activity, either within or outside of a relationship. asexuality is not the same as celibacy, which is the willful decision to not act on sexual feelings. asexuals, while not physically sexual-type folks, are none the less quite capable of loving, affectionate, romantic ties to others.  ","time":1444435169942},"pansexual":{"definition":"1. Adjective:  A group which is open to members of all sexual orientations or gender identities including [straight], [gay], [lesbian], [bisexual],  [transexual], or [transvestite].<br /><br />2. Noun:  A person who is sexually interested in other people regardless of gender including [male]s, [female]s, [transexual]s, [tansvestite]s, [gender bender]s,  [hermaphrodite]s, [intersexual]s, [androgenous] people, and those with [sex-chromosome anomaly] such as [klinefelter syndrome] or [turner syndrome].<br /><br />3. Noun: A person who is a member of a pansexual group or a person who associates with  people of all sexual orientations but is not necessarily interested in sex with people of all [sex]es or [gender]s though they may be comfortable with public displays of affection ([PDA]s) or semi-public sexual activity which is not confined to their own [sexual orientation].<br /><br />4. Noun: One who perceives all activities and experiences as sexual.<br /><br />5. Noun: One who believes that all consensual activities are ethical.<br /><br />6. Noun. One who believes that all<br />human behavior stems from the sex drive.<br /><br />7. Adj.  Pertaining to a person, group, or idea fitting the above descriptions.<br /><br />Derivation: From the greek &quot;pan&quot; (meaning &quot;all&quot;) and the english &quot;sexual&quot;<br /><br />Alternate forms: [pansexuality] [pansexualism] [pansexualist] [pansexualize]<br /><br />Synonyms: [omnisexual]","time":1444435219819},"tmi":{"definition":"Too Much Information - way more than you need&#x2f;want to know about someone.","time":1444435400600},"britannia":{"definition":"Some hot sexy chick, only one Britannia in the world is know..so far. She&apos;s tanned with mysterious brown eyes. She&apos;s a sexy beast ;)","time":1444435950874},"eleven":{"definition":"Derogatory term for Japanese","time":1444435962992},"one":{"definition":"&quot;Goodbye&quot;<br /><br />Shortened form of &quot;One Love&quot;","time":1444436011945},"two":{"definition":"The number that (usually) comes before [three]. Square root of [four]. Also the amount of people it takes to [tango].","time":1444436015496},"three":{"definition":"slightly higher than I can count.","time":1444436019383},"four":{"definition":"1. A number that comes after 3, and before 5. Duh.  2. A character from the blockbuster series &quot;Divergent&quot;(In my opinion, the best). In the book, he is Tris Prior&apos;s instructor in Dauntless (one of the factions in the city) initiation, but as the book goes on he eventually falls in love with her. His name is then found out to be Tobias Eaton, but his nickname is Four because he only has four fears; heights, confinement, shooting an innocent person, and his father abusing him. He is portrayed by Theo James (&lt;3) in the movie released on March 21st in USA, April 4th in UK.","time":1444436023199},"five":{"definition":"Five is an another word for cool.","time":1444436026249},"six":{"definition":"this is any car in Mercedes&apos; top-of-the-line 600 series...no matter what anyone tells you, it is not a car with a V6 engine. rappers rap about driving sixes; my grandmother&apos;s Buick has a V6...which makes more sense here?","time":1444436030774},"seven":{"definition":"the number after 6 you fucking morons.","time":1444436040422},"eight":{"definition":"sex on dance floor","time":1444436043459},"nine":{"definition":"Not the definition of the &quot;girth&quot; of the barrel, but rather it&apos;s bore - the width of the hole that goes through the barrel. Also, not coincidentally, the diameter of the bullet - 9mm.<br /><br />Refers to a pistol, usually a semi-automatic, ostensibly a 9mm.<br /><br />Aside: The U.S. Army&apos;s standard pistol is a 9mm semi-automatic.","time":1444436046894},"ten":{"definition":"A human being shaped so perfectly that their hotness is almost painful to look at: <br /><br /> Boys; know you&apos;ve met a ten when she tells you a joke and you accidentally spit coke in her face.  <br /><br />Girls; know you&apos;ve met a ten when the fact that he&apos;s even speaking to you makes you wet.<br /><br />Be careful! Tens know it. They have mirrors too. Their prettyness is so intense that you will forgive anything just to be around them. They are not always nice people.<br />","time":1444436056541},"su":{"definition":"calling of the Wu-Tang Clan","time":1444436192337},"deeznuts":{"definition":"1) A sarcastic expression used to denote annoyance or frustration.<br />2) A term used when you just dont give a fuck<br />3) Look, my dick and balls are bigger than yours.","time":1444436236586},"goteem":{"definition":"An exclamation used after a brilliant comeback, that is incapable of being topped.","time":1444436254014},"8=d":{"definition":"I though it was a smiley face. I used it everywhere. Now I&apos;m banned from lots of forums. =(","time":1444436570868},"kik":{"definition":"A smartphone app that allows users to chat with eachother, for free, whether they have an iPhone, iPod Touch, Blackberry, or Android device.  *Can also be used in the form of a verb, meaning to contact someone through Kik.","time":1444437181973},"wlel":{"definition":"To tell one that you wish them to do the thought that follows","time":1444437477602},"plug":{"definition":"a source from which to score drugs, principally marijuana","time":1444438114445},"rl":{"definition":"Abbreviation for Real Life, a free MMORPG&#x2f;FPS that automatically logs you in when you exit all other computer games. Some of the features include:<br /><br />-Insanely high FPS<br />-Virtually no lag<br />-No load times<br />-State of the art ragdoll physics<br /><br />Unfortunately, there&apos;s a very steep learning curve, and there doesn&apos;t appear to be any respawn for dead players.","time":1444439376573},"phe":{"definition":"the ultimate badass. super cute and can rock absolutely anything. Has magical powers to make you fall in love with her. Can shapeshift into a sneaky prawn","time":1444439479852},"mfw":{"definition":"Abbreviation for &quot;my face when","time":1444439754075},"irc":{"definition":"Abbreviation for Internet Relay Chat. A multiplayer notepad.","time":1444440117962},"raptor":{"definition":"A drunk female in high-heels. Usually characterized by lots of stumbling and screeching.","time":1444440350832},"fds":{"definition":"First Date Sex. When a first date goes well and ends in sex.","time":1444440883925},"fts":{"definition":"Abv. Fuck That Shit","time":1444440888255},"wristjob":{"definition":"when one gets there penis handled by a wrist.","time":1444440939517},"pce":{"definition":"Short form of &quot;peace&quot; meaning goodbye or seeya.","time":1444440978013},"fedora":{"definition":"A hat that went from the sure sign of an early 1900&apos;s tough guy, to the sure sign of a 1980&apos;s and onward loser who is desperately seeking for a style to call their own (and ruining everything they touch in the process).<br /><br />Definition inspired by epicurus&apos;s words.","time":1444441234968},"breadwinner":{"definition":"One who brings home the bread for the family, thus enabling its continued survival.","time":1444441309517},"lgi":{"definition":"Lets Get It!","time":1444441375871},"stronk":{"definition":"A typo of the word &quot;strong,&quot; originating from competitive play of a game of Heroes of Newerth. Mostly used sarcastically because of it being a mistype.","time":1444441756163},"hingo":{"definition":"The bane of everything that is good in the universe.  Should be avoided and shunned at all costs.  Widely associated with the fall of civilization into the depths of Hell.  Also, the exact opposite of [blarg].","time":1444442088373},"jane":{"definition":"short term name for marijuana...people who smoke pot often love Jane&apos;s<br /><br />the name of the most beautiful woman in the world, other woman were so jelous of Jane&apos;s that they made up a term for Jane&apos;s calling them plain because it rhymed and made them feel better about themselves cause they were not names jane and they are ugly.<br /><br />janes are always the girls with the sense of humor in any group<br /><br />jane&apos;s can also be that girl that had a crush on you in high school but you never dated, then she shows up at the reunion lookin all hot and successfull, then you kick your self in the ass for not being nicer to her because now she is hot and wont give you the time of day.<br /><br />jane&apos;s are better then everyone, and are usually associated with class and wealth and beauty<br /><br />the hot girl next door that you grew up next too is always named, or should always be named jane","time":1444442095404},"lee":{"definition":"When used in the context of an Australian Male, the Term&#x2f;Name &quot;Lee&quot; denotes awesomeness, In 1842 a great man predicted that all males named &quot;Lee&quot; in the year 1987 shall become &apos;King of the World&apos; upon their 20th birthday.<br /><br />Because this great philosophiser was shot in the back while dancing to the 1842 one hit wonder &quot;Hamertime&quot; (a song about communist oppression) the truth was never released to the public.","time":1444442134530},"rahul":{"definition":"One of the most amazing guys you&apos;ll ever meet. He can make the girl he loves smile all the time and can give butterflies to any girl that he wants. One of the most faithful guys on this earth and has a passion for cows and moons.","time":1444442191737},"hazey":{"definition":"Hazey  Hazey is the kind of girl who [doesn&apos;t] like to be noticed outside of her small group of friends. She&apos;s very talkative and outgoing, she just likes to keep very few people close to her because she&apos;s seen even the closest of friends get stabbed in the back by each other. The only time she&apos;s out spoken in large crowds is if she sees someone is being bullied. She&apos;s been bullied herself and can&apos;t stand it! If you see a girl named Hazey, make sure to give her a nice smile. A smile can brighten up anyone&apos;s day!","time":1444442205148},"deg":{"definition":"A round belly...abrrievation of degree. As a fat belly represents a 180degree angle. Can be used to insult anyone thats overweight!","time":1444442223059},"escort":{"definition":"noun, a term for a woman paid by the hour, not the act, but usually for sex.  A [prostitute].  Often, higher quality and cost compared to street [scrag].","time":1444442242859},"imperator":{"definition":"A term in Ancient Rome that was given to a Commander for his great acheivements on the battlefield.","time":1444442512007},">//<":{"definition":"An embarrassed&#x2f;frustrated smiley usually used on internet chat or role-playing sites. The &gt; and &lt; are the eyes and indicate that the smiley is squinting in frustration (like &gt;&lt;, &gt;_&lt;, &gt;-&lt;, or &gt;.&lt;) The &#x2f;&#x2f; mean that the smiley is blushing.  Not to be confused with &apos;^&#x2f;&#x2f;^&apos; which indicates the user is blushing with happiness&#x2f;excitement which has to do with love.  &gt;&#x2f;&#x2f;&lt; is usually used in a situation in which one would be humiliated or ashamed. Is usually but not always used by Anime fans, Role-players, or just purely awesome people.","time":1444442818541},"<.>":{"definition":"An expression of a person loosing his&#x2f;her mind.","time":1444442911426},"molested":{"definition":"The state of being so violently high that one can only describe the feeling as having been &quot;molested&quot; by marijuana.  A sudden and sinus-clearing onset gives way to a body high that replicates some symptoms of cerebral palsy and leaves the smoker pasted to the surface upon which they&apos;re seated.  The head high follows suit, with a brain-burning sensation that transforms any and all coherent thought and emotion into a thick molasses.  Most often occurs after ripping a giant bong.","time":1444442991439},"gz":{"definition":"slang for congratulations, used alot on diablo II","time":1444443068250},"ic":{"definition":"In roleplaying, short for In-Character.  If you are IC, that means you are pretending to be someone else (your character) rather than being yourself.  Antonym of [OOC].","time":1444443126596},";-;":{"definition":"many meanings: sad,tear,confusion, etc.","time":1444443201714},"may":{"definition":"may is the month where teachers think that they can control a classroom but really nothing gets done and no one cares about their grades anymore. usually this happens because summer break is only 30 days away","time":1444443247843},"january":{"definition":"The best month of the year with February right behind.when the coolest&#x2f;hottest people were born. Also the prettiest time of the year..snow &amp; winter time. Who doesnt love January?<br />","time":1444443397726},"february":{"definition":"February is the best month of the year. Its still nice and cold and snowy, but you know that spring is just around the corner if you&apos;re tired of all the bad weather. February is also the most unique month. 28 days long,(unless its every four years on a &apos;leap&apos; year) <br />[Valentines day] is also in February. (the fourteenth)It&apos;s a fun holiday named after [St. Valentine], and it&apos;s for cute happy couples. Many single or unhappy peope celebrate the anti Valentines day, ie. [Singles awareness day].<br /><br />People born in February are without a doubt the Cutest, Smartest, and Funniest set of people. If you are born after the 20th, you are also a [PICES]. This is the best Zodiac sign. ","time":1444443408979},"march":{"definition":"The month in which all sexy, drop dead gorgeous women are born.","time":1444443425637},"april":{"definition":"A left-leaning, cultured, intelligent, down-to-earth chic that has tons of friends throughout the world.  She&apos;s a lover of cinema and ethnic cuisines, has a witty sense of humor and is a great person to get advice from.  She&apos;s the friend that is always there if you need her.  She&apos;s also fantastic in the sack. ","time":1444443431511},"june":{"definition":"The month the hottest people in the world are born.","time":1444443442308},"july":{"definition":"A month when mostly the hottest girls are born","time":1444443447432},"august":{"definition":"The idea of perfection. The 8th Month of the year in certain European and Asian cultures signifies greatness in achieving perfection, or something close to it. ","time":1444443457481},"september":{"definition":"THE BEST BIRTHDAY MONTH OF THE YEAR!","time":1444443467138},"october":{"definition":"the birthstone for this month is Opal, but there is also a cheaper Rose Zicron.<br /><br />and it&apos;s also the best month ever if your birthday is in it","time":1444443474247},"november":{"definition":"The month in which the sexiest people are born (especially since most were concieved in february-the month of love-9 months earlier) ","time":1444443484868},"december":{"definition":"The month in which the hottest women are born.","time":1444443494969},"^//^":{"definition":"The smiley of a &apos;blushing&apos; face. Used to indicate that the user is blushing.<br />This &apos;blushing smiley&apos; indicates happiness or excitment afiliated with love, or somthing that makes one happy.","time":1444443531719},">///<":{"definition":"blushing face<br />show excitement<br />embarrassed<br />flustered ","time":1444444711411},"fast":{"definition":"A girl or guy who is quick to engage in sexual activities.","time":1444445499200},"bronze":{"definition":"the police","time":1444445834991},"neopets":{"definition":"A online game that started out as a good game, like [Pokemon] but now is horribly bad.<br /><br />Point 1: Overcommercialization.<br /><br />We&apos;ve got Neopets happymeals, Neopets plushies, Neopets keychains, Neopets stickets, etc. What happened to &quot;We don&apos;t want to make money, we just break even using the advertising!&quot; <br /><br />Point 2: Sponsor Games<br /><br />99% of the NEW games on the site are sponsor games. Most are the same as other games, and are very, very simple, but the characters or the background are changed. These games are the opposite of inventive.<br /><br />Point 3: Wars<br /><br />Wars on Neopets are very boring. You sit around and attack the same enemy a billion times and then you (might) be able to get a bigger one to fight!It&apos;s like in [Pokemon] where you have almost beat the game, except the developers have messed up and given you Level 2 Rattata to fight, rather than Level 70 Gravelers.<br /><br />Point 4: Message Boards<br /><br /><br />Greedy Adam and Donna. A while ago, there was a message board called General Chat, where all the media driven &quot;get a girlfriend cause you should!&quot; 7 year olds posted OMFFIGLJG 15&#x2f;M&#x2f;ALASKA WILL U BE MEH GIRLFRIENDSZ!?!&#x2f; Instead of hiring new monitors, they froze accounts of people that didn&apos;t do anything, and destroyed the GC, making the aforementioned people go to other boards where WE had to handle them.","time":1444446030882},"titillating":{"definition":"the act of opening a furtune cookie and not knowing what it means only that it is going to be a good day.","time":1444446088819},"alpaca":{"definition":"1. Something that is better than a Llama<br />2. Something that is better than you","time":1444446201556},"c:":{"definition":"The opposite of [:C]. An extremely happy face.","time":1444447068845},"rekt":{"definition":"Text for &quot;Wrecked&quot;, as sooo drunk you&apos;ve forgotten your name but can just about type a text to your mate whose missed called you","time":1444447379709},"deflowered":{"definition":"To lose your virginity via sexual contact- term is more often used in reference to girls losing their virginity.","time":1444447660803},"emo":{"definition":"Genre of softcore punk music that integrates unenthusiastic melodramatic 17 year olds who dont smile, high pitched overwrought lyrics and inaudible guitar rifts with tight wool sweaters, tighter jeans, itchy scarfs (even in the summer), ripped chucks with favorite bands signature, black square rimmed glasses, and ebony greasy unwashed hair that is required to cover at least 3&#x2f;5 ths of the face at an angle.  ","time":1444448548806},"dirty":{"definition":"not clean","time":1444448922090},"kem":{"definition":"Term used to subtly insert the word [cum] into an everyday conversation, perhaps with a colleague or your grandmother, while ideally avoiding public disdain and disgust. Often can be used to hilarious results. Must be spoken swiftly. Can be pronounced like &quot;kim&quot; if preferred.","time":1444449774167},"kys":{"definition":"quick and easy abbreviation for kill youself","time":1444449827127},"immortality":{"definition":"The path to ultimate boredom.","time":1444450418488},"e4":{"definition":"the most popular opening move in chess where the pawn immediately in front of the king moves two spaces forward.<br /><br />it immediately gains control of the center and also frees the queen and king&apos;s bishop. at the same time, it places a pawn on an undefended square and weakens d4 and f4.<br /><br />a response of 1...e5 results in an open game.","time":1444451573227},"stram":{"definition":"Another word used in place of the word &quot;Stream.&quot; Originated from a misspelling of the word stream. Used for livestreaming video games on livestreaming websites such as twitch.com or livestream.com. Can also be used in the form of stramming.","time":1444453244017},"pheonix":{"definition":"Mispelling of phoenix.","time":1444453466711},"phoenix":{"definition":"The capital of the state of Arizona and 4th largest city in the United States of America.","time":1444453479558},"vaginalcord":{"definition":"Medical term for the nerve connecting the vagina to the heart which prevents women from having meaningless sex.","time":1444453811966},"troubled":{"definition":"Mentally disturbed as a result of reckless behavior (Drug use,Alcohol, Excessive Partying)<br />Or by Depression, Anxiety&#x2f;Break from reality due to traumatic experiences.<br />Or, one of the aforementioned causing the other.","time":1444453851040},"charizard":{"definition":"While having sex with a girl with pubic hair, light her pubes on fire as you ejaculate.  Your semen will put out half of the burning hair, and afterwards while she is flapping her arms about wildly, scream: &quot;YOU DON&apos;T HAVE ENOUGH BADGES TO TRAIN ME!&quot; and run out of the room.","time":1444453932773},"ad":{"definition":"Anno Domini, Latin for &quot;in the year of our lord&quot;. AD marks the years after the birth of Jesus Christ.<br /><br />For politically correct reasons, AD is being replaced by [CE].","time":1444454392141},"newportbeach":{"definition":"1. the place by where i go to school<br />2. where the O.C. supposedly takes place<br />3. a town full of yuppies and their snobby kids, where the soccer moms are more silicon than should be allowed and the dads are rich conservatives<br />4. a place where everything, is closed by 11<br /><br />see [palley] for an example of a newport family","time":1444455589619},"costamesa":{"definition":"Sometimes known as &quot;costa misery,&quot; this area just north of Newport Beach is home to affluent Orange County residents and is actually quite nice.  They are not usually as rich as people in NB, yet the area is quite nice.  There are some cool parks in and around the city.  It&apos;s pretty calm, as well.","time":1444455594930},"austintexas":{"definition":"austin texas is a hippie town with lots of stoners and dank ganj. its fun and theres a bunch of music everywhere, like the most popular music festival acl. its a lot of fun and austin is cool","time":1444455603556},"orangecoastcollege":{"definition":"place god made for himself to live...its a community college with the hottest bimbos in socal where literally everywhere you turn theirs a hot blonde with fake tits in orange county and the gayest wana be bad boys...Girls are way too hot and playboy models are often reruited here and are also very slutty","time":1444455640700},"texasa&m":{"definition":"Texas A&amp;M University, often referred to as A&amp;M or TAMU, is a coeducational public research university located in College Station, Texas.  It is the flagship institution of the [Texas A&amp;M University System]. The seventh-largest university in the United States, A&amp;M enrolls over 48,000 students in ten academic colleges.  Texas A&amp;M&apos;s designation as a land, sea, and space grant institution reflects a broad range of research with ongoing projects funded by agencies such as the National Aeronautics and Space Administration (NASA), the National Institutes of Health, the National Science Foundation, and the Office of Naval Research.  The school ranks in the top 20 American research institutes in terms of funding and has made notable contributions to such fields as animal cloning.  The first public institution of higher education in Texas, the school opened on October 4, 1876, as the Agricultural and Mechanical College of Texas. Its original mission was to educate white males in farming and military techniques. To reflect the institution&apos;s expanded roles and academic offerings, the Texas Legislature renamed the school to Texas A&amp;M University in 1963.  The school&apos;s students, alumni, and sports teams are known as [&quot;Aggies&quot;].  The university offers degrees in over 150 courses of study through ten colleges and houses 18 research institutes. Texas A&amp;M has awarded over 320,000 degrees, including 70,000 graduate and professional degrees.","time":1444455746570},"americanuniversity":{"definition":"For those in the know, AU is THE University to find a girl in the DC area worth dating.  While Georgetown students are busy popping their pink collars, GW students are busy paying for an overpriced education, and Catholic students are busy being Catholic, American University is an absolute goldmine for intelligent girls (or men, if you swing that way).  For people that actually want to make a difference and not just ride Daddy&apos;s coattails to a soul-sucking Legal&#x2f;Medical profession, AU is where it&apos;s at. ","time":1444455831573},"abdicate":{"definition":"To proclaim or declare to be no longer one&apos;s own, to disclaim, disown, cast off; esp. to disown or disinherit children. Now only as a tech. term of Rom. Law (L. abdicare filium, also patrem); To depose (from an office or dignity). Obs.; refl. To formally cut oneself off, sever, or separate oneself from anything; esp. to divest oneself of an office (L. abdicare se magistratu). Obs.; trans. To put away, cast off, discard (anything). Obs.","time":1444456108152},"rayquaza":{"definition":"Rayquaza is the English name for a Pokémon originally named &quot;Rekkuzza&quot; in Japan. The English name was assigned by Nintendo of America.<br />   In Hoenn, an island region in the Pokémon world, legend states that this creature, the &quot;Master of the Skies,&quot; once descended from the clouds to end a cataclysmic battle between the Earth Titan &quot;Groudon&quot; and the Sea Titan &quot;Kyogre.&quot; Occording to legend, the battle almost destroyed the earth. Had Rayquaza not ended the fight, all would be lost.<br />   Thousands of years later, Rayquaza laid to rest atop a tall tower built long ago known as &quot;Sky Pillar.&quot; It slept for years until a young child came and awoke it once more, as the evil organizations Team Magma and Team Aqua had called forth the Titans of Earth and Sea once more, not knowing if the consequences.<br />   Upon being awakened, Rayquaza immediately flew to Sootopolis Mountain, modernly hollowed into a city and named Sootopolis City. This was where the Titans were clashing, much to the awe and fear of the local residents. Rayquaza repeated history and sent them back into their hidden caves, where they were to sleep peacefully forever more.<br />   Rayquaza has since been captured and exact statistics on this respectable beast have been recorded in the Pocket Monsters Index, or the PokéDex.<br />   Rayquaza measures in at a hight of 23 feet exactly, but only when sitting in a snake-like curl. Its long body from nose to tail has not yet been recorded, but is estimated to be about 60 feet or more. It weighs in at 455.2 lbs. It has the ability to pressurize the atmosphere around it, and nullifies all weather effects such as rain or intense sunrays. How it does this is yet to be explored. It is classified as Pokémon number 384 in the National PokéDex. It goes by the number of 200 amongst the Hoenn Region PokéDex. It has been dubbed the &quot;Sky High Pokémon,&quot; for its ability to live in altitudes as high as the ozone layer.<br /><br />A truely magnificent and rare beast indeed. There is only one in existance, but scientists in the Cinnibar Genetic Research Association are trying to clone it, so we may see more of this magnificent creature before the only one in existance dies.","time":1444456433862},"pokemon":{"definition":"A disease that started in Tokyo.  It first infected Gameboys in Japan in 1995.  Then in 1998 the disease infected Gameboys in America.  Soon channel WB11 was infected too, and now Cartoon Network.  The ever-so-popular &quot;Gameboy Advance&quot; systems got infected in 2002, and still is.  In 1999 the disease started spreading via cardboard aka &quot;Pokemon Trading Card Game&quot;.  &quot;Nintendo 64&quot; and &quot;Nintendo Gamecube&quot; are infected too.  The disease is also spreading via plastic and metal in the toy isles at Wal-Mart, K-mart, toys-r-us, and every other toy store.  It is now July 2004, almost 10 years after the start of this addicting, argument instigating disease and it is still out there, but not as bad as its most powerful years(1999-2001).","time":1444456443873},"magikarp":{"definition":"The best Pokemon in the universe. It&apos;s Splash attack can do over 9000 damage to any Pokemon on the game. It&apos;s weaker form, Gyarados, is used in OU play because Magikarp is so broken and godly.","time":1444456461937},":0":{"definition":"An emoticon used to express shock, or surprise.","time":1444456930983},"declan":{"definition":"an excessevily boyant boy who shaves his legs and wears gold hot pants","time":1444457160881},"beasto":{"definition":"Someone that has sex with animals in the ass with no lube.","time":1444457185348},"joe":{"definition":"The most sweet and sesitive man you will ever meet. His heart is so big, sometimes he doesn&apos;t know quite what to do with it. He is beauiful inside and out. underneath his ruggid figure, his heart is huge. If you fall in love with a Joe, don&apos;t ever let him go. he just might not come back. Dont ever break his heart. He is to fragile. He doesn&apos;t care much for play fighting. Josephs always give the best hugs, you know you are safe when you are in his arms. You don&apos;t have to even meet him to know he is the one for you. Unsure of himself at times. Knows what he wants and goes after it. Hard to read his mind, but not afraid to share it. Always protects the ones he loves. Will do great things with his life. Probably will even change the world.","time":1444457193558},"<3":{"definition":"Some people use this as a heart, but those people are wrong. It is clearly a ballsack.","time":1444457836150},"chub":{"definition":"a semi erect yet still malleable penis.<br />  .<br /> ( )<br /> | |<br /> | |<br />(_l_)  also see limp &quot;dick&quot;","time":1444458603216},"shortbus":{"definition":"A bus that people who can&apos;t spell derogatory take.","time":1444458781212},"strawman":{"definition":"A logic fallacy involving the purposeful misrepresentation of an argument in order to strike it down.","time":1444458951884},"cricket":{"definition":"A game of skill and gentlemanly conduct where everyone hates the Australians equally.","time":1444459197947},"brood":{"definition":"sexy femalee, hottie","time":1444460143117},"brooding":{"definition":"Expressing deep sorrow or remorse. To dwell on a misfortunate outcome of an event with regret or displeasure.","time":1444460151718},"shitler":{"definition":"Similar in process to a [Dirty sanchez]. There are 2 times this can be done:<br />1) When a man, after anal sex, puts his finger inside a girl (or guy&apos;s) ass and takes alot of shit on his finger and wipes the crap above the his partner&apos;s lip, which resembles a hitler-like moustache.<br />2) A sleepover prank. When someone is sleeping wipe shit on above their lip.<br />The only diffrence between a shitler and a dirty sanchez is that a shitler is thicker and has more crap then a dirty sanchez.","time":1444462144056},"ywh":{"definition":"It stands for &quot;You, Whatta Hater&quot;. Used when you want to show the man whose boss. <br />","time":1444462552042},"wuss":{"definition":"Invented in the summer of 1964 by an eight year old San Diego elementary school Boy named Don who needed to find a new name that none of the bullies would recognize. The popular insult names at that time were Wimpy, from the &quot;Popeye The Sailer&quot; cartoon and Pussy from the obvious. Wussy and Wuss kept them confused for a short time and gave the abused a short victory over the bullies. In the beginning Don actually had them conviced it was a compliment. By 1972 it had become a real comon word at Clairemont High School and was later momorialized in the 1982 movie &quot;Fast Times at Ridgemont High&quot; that characterized those people at Clairemont High.","time":1444463278857},"broly":{"definition":"His power is maximum","time":1444463702529},"pedo":{"definition":"A person who is sexually attracted to children. <br />Short for pedophile.","time":1444463913091},"pedophile":{"definition":"A person who suffers from Pedophilia; that is, an adult who is sexually attracted to children.<br /><br />Pedophilia is a mental disorder, not a sexual orientation or lifestyle choice.  Specifically, it is a Paraphilia.  The Paraphilias are characterized by recurrent, intense, sexual urges, fantasies, or behaviors that involve unusual objects, activities, or situations. Other examples of Paraphilias are Exhibitionism, Fetishism, Sexual Masochism, and Sexual Sadism.<br /><br />Terms like &quot;pedosexual&quot; are misnomers and nothing more than political activism on the part of organized groups of pedophiles attempting to legitimize and legalize their abuse and predation of children.","time":1444464071286},"socks":{"definition":"1. A garment usually worn between your foot and footwear which is meant to facilitate optimum body temperature, maximize comfort and decrease disgusting foot odor. Generally comes in pairs.  <br /><br />2. A disposable ejaculatory device used by lonely, socially inept young men who do not like to masturbate in the shower or ejaculate all over furniture.  ","time":1444464087248},"smell":{"definition":"Something that your nose picks up...can be nice, pungent or make you gag. ","time":1444464104286},"smellyfeet":{"definition":"Name given to a loved one who has smelly feet, it is a term of affection rather than an insult.","time":1444464119176},"etc":{"definition":"Everyone uses &quot;etc&quot; but some [noobs] do not know what it means.<br /><br />Heres the meaning:<br />et cetera, a Latin expression meaning &quot;and other things&quot; or &quot;and so on&quot;","time":1444464224317},"whore":{"definition":"A woman that sleeps with everyone but YOU!!!!!<br />SEE: SLUT  - A woman that sleeps with everyone.","time":1444464436971},"compromised":{"definition":"To have your home and all belongings pilfed while your away","time":1444464943867},"nuzlocke":{"definition":"ht tp:&#x2f;&#x2f;bulbapedia.bulbagarden.net&#x2f;wiki&#x2f;Nuzlocke_Challenge  (Usually recorded into a comic or piece of literature and characters are given personalities. ie. gary the jerk eventually becomes the protagonist&apos;s best friend or boyfriend......or murder victim)  (copy and paste, get rid of the space)","time":1444467050781},"knockin'onheaven'sdoor":{"definition":"(v.) To be undergoing spiritual enlightenment before ones death.","time":1444468534876},"dig":{"definition":"v.<br />1. To perceive and comprehend the nature and significance of; grasp; gather. “Ya dig? Yeah I can dig it”<br /><br />2. To find attractive, pleasant, to enjoy.  “I dig on that [Trim], man; girl is fine!”","time":1444469424064},"pertaining":{"definition":"An ordinary word that suddenly becomes more comical when spoken by a one Faraz Fooker.","time":1444469661096},"pertain":{"definition":"to be relevant or belong to something","time":1444469695686},"shialebouf":{"definition":"A man who enjoys shouting &quot;NO NO NO NO&quot; multiple times throughout an awful movie, however can make some beautiful things like Fury and became hench for a cage fight with Sia","time":1444470670103},"idd":{"definition":"Indeed","time":1444472849898},"oic":{"definition":"short for &quot;oh I see&quot;","time":1444474984074},"svs":{"definition":"also known as shallow vag syndrome.  Is the condition of having a shallow vagina.","time":1444475705043},"crustyballs":{"definition":"a man who dosnt wash and has dryed up sexaul organs","time":1444475800217},"sexual":{"definition":"the majority of Urban Dictionary&apos;s definitions","time":1444475809067},"fk":{"definition":"Short for the term [fuck] commonly used in [IRC]","time":1444476018027},"orgy":{"definition":"Sex party involving many partners","time":1444476155574},"gm":{"definition":"GM stands for General Motors.  This neologism is a synonym for bullshit, scam, ripoff and fucked (or similar). It may be used either as verb, adjective or noun.  &#x2f;tags: gm, bullshit, scam, ripoff, rip-off, rip off, steal, stealing, fuck, fucked, fucked-up, fucked up, sham, fraud, deceit, cheating, dupe, swindle, blackmail, hoodwink, bamboozle, neologism, general motors, american, all-american, customer satisfaction, customer dissatisfaction, fuel pump, engine noise, transmission issues, cracked dashboard, oil consumption, sunroof leaking, give me the run around, run around, conspiracy theories, goodwill, good will, good-will, maintenance letter, smart care, gmpp, olc, motor club, cars, dealership, sales complaint, certified pre owned, certified, certified pre-owned, pre owned, pre-owned, trade-in, trade in, repurchase, buyback, buy back, chevrolet, gmc, buick, cadillac, saturn, hummer, oldsmobile, garbage, junk, ufos, my car is a lemon, lemon, lemon law, bbb, better business bureau, corporate offices, legal department, unicorns are for girls, legal dept, legal, legal action, attorney, lawyer, call center, outsourcing, outsource, out-sourcing, out-source, out source, out sourcing, false expectations, creating false expectations, customer called in, mexican electronics are junk, my dma is a dickhead, etc, ad nauseam","time":1444476208672},"gayorgy":{"definition":"When a group of guys get together and have sex. Refer to [orgy] and see what it means.Then just thing about a GAY one! And their you have it. Your asshole is sore and your walking home with a limp. But hey who cares? MY ASSHOLE IS 2 feet wide! lol jk.","time":1444476480871},"iirc":{"definition":"abbv for If I Recall Correctly","time":1444477451214},"helicopter":{"definition":"When you swing your penis around in a circle and make the noise of a helicopter.","time":1444477754141},"peniscopter":{"definition":"A peniscopter occurs when you spin your penis around in circles fast enough it actually lifts your body off of the ground.","time":1444477901246},"roflcoptor":{"definition":"to laugh really hard for a long time","time":1444477975731},"darkrai":{"definition":"The most annoying but coolest pokemon in the entire world, uses the dark void&#x2f;nightmare&#x2f;dream eater tactic to pwn it&apos;s enemies while they can&apos;t fight back","time":1444478001636},"tyler":{"definition":"Originating from the movie &quot;Fight Club&quot;, Tyler is used to describe one who is extremely sexy and bad ass.   ","time":1444478020003},"earn":{"definition":"To &quot;earn&quot;, is crimnal talk for making money. Mostly career criminals use this term such as italian, irish, or jewish gangsters. They have to &quot;earn&quot; somehow. They find all sorts of ways to earn.","time":1444478033388},"attackontitan":{"definition":"One of the best anime shows of the year 2013 by production I.G. The graphics and atmosphere will blow your minds out but the theme has raised debates. It&apos;s one of those shows where tons of people die in battles, including your favorite ones, so if you really hate that, you might not want to watch it.  I&apos;m not gonna give out any kind of spoilers, not even the summary, because it&apos;s more fun to watch if you don&apos;t have any idea about what you&apos;re going to see. If you&apos;re that eager for a summary, go read the wikipedia page.","time":1444478055796},"anime":{"definition":"noun:  a style of animation that originated and is still heavily centered in Japan.<br /><br />The word &apos;anime&apos; is based on the original japanese pronunciation of the american word &apos;animation.&apos;<br /><br />The stereotype of the anime style are characters with proportionally large eyes and hair styles and colors that are very colorful and exotic.  The plots range from very immature (kiddy stuff), through teenage level, to mature (violence, content, thick plot).  The classification of &apos;hentai&apos; is given to animes of a stong sexual nature.<br /><br />Although over 95% of anime has nothing perverted about it, most closed-minded idiots think anime is always a form of pronography.","time":1444478085193},"pokémonshowdown":{"definition":"An awesome website where you can battle pokemon online. How cool is that?","time":1444478141883},"eos":{"definition":"Eos (Aurora) is the goddess of the dawn.","time":1444478157190},"blaziken":{"definition":"A word used to describe the activity of smoking marijuanna. Blaziken was derived from the term the Pokemon character &quot;Blaziken&quot; and inspired by the popular pot smoking slang &quot;blazing&quot;","time":1444478366366},"mewtwo":{"definition":"Probably the only Pokemon that&apos;s actually cool. The only Pokemon who seeks world domination and plots for him and his clones to inherit the world. He is the most powerful of all Pokemon and can withstand anything that comes his way.","time":1444478400009},"pikachu":{"definition":"fat-assed yellow wombat","time":1444478438048},"inap":{"definition":"What happens when you have been working at your computer for too long, nod off and wake to find yourself nose down on the keyboard.","time":1444478506997},"arceus":{"definition":"The apparent &quot;god&quot; of the Pokemon world, soon to appear in the 12th Pokemon movie to enact [judgement day] upon the universe. Some question, now that you can hack [GOD] IN A [POKE-BALL], what legendaries are left to spew out.","time":1444478571557},"smd":{"definition":"Acronym for &quot;suck my dick&quot;","time":1444478611158},"mlg":{"definition":"An organization in the United States for professional gamers. Is an acronym for &quot;Major League Gaming.&quot; Many great gamers have been professionally signed by MLG. As of now, they mainly focus on Halo 2 tournaments. They also post &apos;official&apos; gametypes for Halo, Halo 2, and other games, so the gametype is fair and perfect. For example, an MLG game for Halo 2 Team Slayer would be battle rifle spawn, human weapons on map (no sword for fairness), etc. Many believe MLG is a lame gametype, though others practice it often in hopes of getting good at it.  By the way, if you&apos;d like to be funny, next time someone wants to play MLG over [Halo 2] over XBL, ask them, &quot;What&apos;s MLG? Does it stand for My Little Gun?&quot;","time":1444478819415},"viagra":{"definition":"The type of spam I get in my e-mail box every day.","time":1444479131361},"horny":{"definition":"i assume that if you&apos;re looking up horny you&apos;re probably horny in some way, hence the first example.<br /><br />what happens to me after reading anything.<br /><br />the state i am in after reading the above definitions.<br /><br />desiring [sex] or a wanting to [masturbate].<br /><br />see [ganting] or [randy]<br />","time":1444479867999},"lier":{"definition":"Retard&apos;s way of spelling [liar] ","time":1444480415471},"fap":{"definition":"The onomatopoeic representation of masturbation.  Often used to suggest that something is attractive.","time":1444481972815},"bonk":{"definition":"The act of sexual intercourse.","time":1444482459138},"tietheknot":{"definition":"Tying the knot of the ropes in the marriage bed.","time":1444483538609},"touch":{"definition":"It&apos;s an abbreviation of &apos;&apos;iPod Touch&apos;&apos; because, iPod touch is a long word of course. &apos;Nd we&apos;re all too lazy to say the whole freaking word.","time":1444484940235},"itouch":{"definition":"What people who can&apos;t read words completely call an iPod Touch. <br /><br />iTouch has been a Logitech keyboard series for about 10 years.","time":1444484955433},"d.a":{"definition":"THE for people who are to stupid to string all three letters togather","time":1444485078527},":o":{"definition":"The act &#x2f; face of being surprised.","time":1444485219423},"nb":{"definition":"abbreviation for nota bene: used to mark something as particularly important.","time":1444485356372},"reqs":{"definition":"An abbreviation of &quot;request&quot; in fandom.","time":1444485536781},"suicidal":{"definition":"adj. intending to kill one&apos;s self<br /><br />not [emo] or [goth]. kill stereotypes!<br /><br />hotlines in us: 1-800-suicide<br />other hotlines can be found online...<br />please get help if you are feeling suicidal.","time":1444485873919},"hooker":{"definition":"prostitute. started in the civil war When Gen.Hooker of the Union Army (the first [pimp]) tried to protect his troops from VD by buying the best chicks and pimping them to his corps of 20,000 men. orginally hooker&apos;s girls.","time":1444485881711},"n_n":{"definition":"See: [^_^]","time":1444485899882},"^_^":{"definition":"The Asian variation of the classic smiley face. This is sometimes used in more cheerful situations. ","time":1444485908699},"swag":{"definition":"The most used word in the whole fucking universe. Douche bags use it, your kids use it, your mail man uses it, and your fucking dog uses it. If you got swag, you generally wear those shitty hats side way, and your ass hanging out like a fucking goof cause your pants are half way down your white ass legs. To break down the word, it means (Secretly We Are Gay). It is also a word that means to represent yourself&#x2f; the way you represent yourself, baggy clothes, shitty hats, small penis and basically a way to say your afraid to come out of the closet.","time":1444486084598},"cancer":{"definition":"A disease lacking a sense of humor.","time":1444486141569},"11yearold":{"definition":"A person filled with [immature] childish-ness. In rare cases however, they CAN be more [mature] than your average [teenager]. However, that maturity may wear off and theyll end up as mature as average teenagers. Often spend alot of their time on Flipnote Hatena creating either total crap or masterpieces, Facebook, trying to keep their parents from reading the section of Help that says anyone under 13 cant have an account, and youtube, watching videos of gameboys exploding. Often their musical tastes can be from the usual [teen] music tastes, to listening to only one song: [Harder Better Faster Stronger] Really, if you think ALL 11 year olds are giant bags of immaturity, you&apos;re horribly mistaken. And you&apos;re horribly mistaken about teens too. They can be mature too.","time":1444486165369},"12yearold":{"definition":"The main point of insult on the Internet. Due to the stereotypical immaturity of a 12-year-old, most trolls and idiots on the internet are commonly attacked and named 12 year olds. Most people judge someone&apos;s 12-ness on the amount of &apos;[ZOMG]&apos;s in a sentence, their amusement at an overused [meme] or a bad word. They are also supposedly supposed to enjoy joining in with the &apos;grown-up&apos; stuff such as [rickrolling], [chatroulette], [omegle], and [vandalising] [wikipedia], as well as more serious things such as boasting their feigned use of [cannabis] or &apos;[weed]&apos; as most call it. Fortunately, this stereotype is not always correct, as some 12-year-olds are actually relatively intelligent. But that&apos;s another story...specifically for the [nerd], [boff], [boffin], [dork] and [geek] definitions.","time":1444486174634},"13yearold":{"definition":"When someone becomes a teen. 13 year olds think they&apos;re amazing, but instead they have raging hormones and their face is covered with zits:<br />1. a young teen<br />2. horny<br />13 year olds like to hump each other and inanimate objects because they think it&apos;s not masturbating, but it really is.<br />","time":1444486199394},"16yearold":{"definition":"16 year olds tend to think they&apos;re older and more experienced than any person younger than them due to the government and society constantly kissing their asses about how they&apos;re able to drive, fuck, or get a job. As well in Europe, most 16 year olds are allowed to drink alcohol and nobody gives a fuck. In reality, this is what will literally bring the downfall of the world.","time":1444486225171},"10yearold":{"definition":"Someone who knows 50 or more terms for the act of mastrubation and intends to publish them all on line. He does this because it makes him giggle uncontrollably, and will elevate his stauts among his fellow 10 year olds.","time":1444486229862},"panders":{"definition":"Noun: One who manages&#x2f;solicits [prostitute]s, a [pimp] or [procurer].  Verb: To [procure] prostitutes for customers.  To [flatter] or [cajole] people, to [cater] or [appeal] to their emotions&#x2f;worries&#x2f;prejudices&#x2f;expectations for one&apos;s own gain; to engage in [demagoguery].","time":1444486242089},"rng":{"definition":"Random number generator.","time":1444486256228},"enzo":{"definition":"Strong leader. He gets all the pussy and everyone looks up to him because he&apos;s so chill.","time":1444486264748},"python":{"definition":"Python is a powerful high-level interpreted language. Python&apos;s design is notably clean, elegant, and well thought through; it tends to attract the sort of programmers who find Perl grubby and exiguous.","time":1444486284642},"cake":{"definition":"This is a lie! Everything you have been told about the cake is a lie, do not listen. ","time":1444486300728},"show":{"definition":"cheap concert","time":1444486314535},"elitist":{"definition":"1. A person who believes that they are superior to others (and thus deserve favored status) because of their intellect, social status, wealth, or other factors.<br /><br />2. Somebody who believes that society should be ruled by an elite class.","time":1444486501406},"max":{"definition":"Short for &quot;Maximilian&quot;, a russian name meaning &quot;Large Penis.&quot; ","time":1444486887787},"asian":{"definition":"the race with the hottest girls. ","time":1444487008263},"niggachu":{"definition":"A lazy black pokemon usually found living in crappy conditions and surviving off of fried chicken. This pokemon can be caught with any kind of ball due to the fact that niggachu is too lazy and stupid to fight back. Also you may lure this pokemon closer to you by using food stamps. some of niggachu&apos;s special abilities include but are not limited to: using rap music to lure enemies to sleep, being able to flee much quicker than other pokemon, and last, using hypnosis to make you think that this pokemon is not lazy and black. When niggachu is given a fried chicken stone it evolves into electronig which can be healed with watermelon and purple drank.","time":1444487105676},"hotbar":{"definition":"1) Term used in music, particularly hip hop. It is a witty line, or slick rhyme.  2) A song by Felt","time":1444487107894},"vvvs":{"definition":"Referring to a comment&#x2f;message under his&#x2f;her comment. Usually used on Myspace. ","time":1444487149542},"wall":{"definition":"A very technical device designed to separate one area from another, and often to provide security to one or more of the said separated areas. It functions by a complex system of interconnected particles forming an impassible barrier that one should not walk into at medium to high speeds, or one risks damage.","time":1444487210721},"ronin":{"definition":"Landless or masterless peasant soldiers or samurai who through dishonor or the loss of their masters were forced to wander Japan until some other lord would accept their services.","time":1444487338087},"aegis":{"definition":"Ægis, Greek mythology.<br />The goatskin breastplate or shield of [Zeus](King of the gods) or [Athena] (goddess of wisdom). The shield, Ægis, when carried by Athena has the head of [Medusa], retaining its powers of [petrification], attached to the center.<br /><br />The shield offered protection and security - to be under the ægis of someone, or something, is to be under its protection.","time":1444487347517},"belgianpancake":{"definition":"A Belgian Pancake is when a man shits upon another person, then proceeds to pat it down flat and ejaculate his semen on top as icing. Then as a couple the pancake is consumed.","time":1444487598648},"kammi":{"definition":"Born to be a Clerk&#x2f;Recorder &amp; Registrar of Voters. Someone who reads government codes and has an addiction to local politics. A person who is extremely hot but makes excel spreadsheets for fun.","time":1444487665003},"llama":{"definition":"This is the sly way to say pussy without being crude or using proper term such vagina. It is taken because the shape of an actual llama&apos;s mouth is similar to one of a female southern lips. In addition, they both spit.  Coming from the song: &quot;Don&apos;t Wanna Trust a Llama&quot; REMIX by Chynaman feat. Savage  www.myspace.com&#x2f;djchynaman","time":1444487670037},"anna":{"definition":"The name for the most awesome person ever, It is impossible to fit so much awesome into any other person.","time":1444487675467},"i":{"definition":"A letter [Apple] really seems to enjoy putting in front of every single product they sell.","time":1444487684507},"suckiest":{"definition":"The highest level of sucking","time":1444487688274},"nasty":{"definition":"1. to describe something that is disgusting<br />2. to act dirty in a sexual way","time":1444487697839},"mac":{"definition":"a pimp or playa or mackin on sumone to put your moves on her","time":1444487725314},"s/a":{"definition":"means &quot;such as&quot;<br />you don&apos;t know the meaning of this?<br />you srsly need to reorient yourself with the world.","time":1444487739536},"chyna":{"definition":"a cool girl that is always head strong and stands up for anything she believes in. She has a bad [temper] but its worth every bit of hell. she is very hot headed. she is cruel and mean at times. but despite all of these things she has a huge heart and will love anyone till the end of her days.","time":1444487760938},"prophecy":{"definition":"A word that, in many stories, seems to be synomymous with &quot;plot&quot;.","time":1444487820261},"og":{"definition":"Original gangster","time":1444487957607},"shenron":{"definition":"is a magical dragon from the manga Dragon Ball, as well as the animes Dragon Ball, Dragon Ball Z, and Dragon Ball GT. In the English dub of Dragon Ball Z, he is mostly called the &quot;eternal dragon&quot; and, in the early Harmony Gold Dragon Ball English dub from the 1980s, he is known as the &quot;Dragon God.&quot;","time":1444487996855},"balls":{"definition":"1. A man&apos;s testicles where [sperm] is produced.<br />2. Courage or bravery.<br />3. Manliness.<br />4. Something yelled to shock people.","time":1444488050020},"lwt":{"definition":"look whos talking","time":1444488102622},"asshole":{"definition":"Your current boss.","time":1444488148798},"hole":{"definition":"derogatory term for a person; short for [arsehole] or [asshole]; also used as a term of [friendship]","time":1444488154704},"leggings":{"definition":"Should be worn as a replacement for pants.","time":1444488179370},"yogapants":{"definition":"Pants that make anyone look like they have an ass.","time":1444488188814},"venusaur":{"definition":"A bigass dinosaur [Pokemon].","time":1444488422046},"blastoise":{"definition":"One of the great water pokémon, fully equipted with a duel hydro pump.  He must have a HUUUGE BLUE COCK!","time":1444488431693},"ash":{"definition":"That gay ass prick from pokemon.","time":1444488450558},"greninja":{"definition":"The swaggiest motherfucking Pokémon ever. Seriously. This thing is a ninja frog. Do you think I&apos;m lying? Just to make it better, this thing makes shurikens out of WATER. If you are gonna play pokemon, consider using Greninja. He shits on every other Pokémon. Oh yeah and also his shiny form is black and should always be nicknamed &apos;Snoop Frogg&apos;.","time":1444488456508},"vgc":{"definition":"Acronym for &quot;Very Good Condition&quot;. Seen primarily on auction sites such as eBay.<br /><br />see also [bnwt] &amp; [bnwot]","time":1444488459948},"gary":{"definition":"A man who is incredibly sexy, but also funny.  He tends to be a girl&apos;s dream guy.  He&apos;s also really good in bed. ","time":1444488499653},"smash":{"definition":"1. The action&#x2f;process of fucking someone good.<br />1a. Hittin&apos; it<br />1b. Tappin that ass.","time":1444488529520},"tyvm":{"definition":"Thank You Very Much","time":1444488641948},"scurbs":{"definition":"Noun: Anyone who is Dirty, Scummy, white trash, raggedy ass bitches.<br />Adj: Scurby: dirty etc...","time":1444488728373},"scrubs":{"definition":"A scrub is a guy that thinks he&apos;s fly<br />And is also known as a buster<br />Always talkin&apos; about what he wants<br />And just sits on his broke ass<br />A scrub is a guy that cant get no love from me<br />Hanging out the passenger side<br />Of his best-friend&apos;s ride<br />Trying to holler at me<br />","time":1444488732478},"talonflame":{"definition":"A pokemon introduced in pokemon x&#x2f;y. Used often in competitive play, it is commonly known for beating almost everything on the field with brave bird.","time":1444488777832},"shofu":{"definition":"A real Nigger","time":1444488796337},"dragonite":{"definition":"In the game: A really good pokemon that can learn a wide variety of attacks with good stats all-around, especially attack.<br /><br />In the anime: A really shitty pokemon that lost to a yellow piece of shit called pikachu.","time":1444488828659},"mew":{"definition":"Cat-Like and sweet Pink Pokemon.<br /><br />Sound that cat Make.<br /><br />Furry happiness Sound.","time":1444488852189},"me":{"definition":"not you.                                                   ","time":1444488869601},"pidgey":{"definition":"A [pokemon] you probably had, or at least had another version of that pokemon.","time":1444488883374},"pidgeotto":{"definition":"The evolved form of &quot;Pidgey&quot;. What pidgey evolves into. If you were to devolve pidgeotto you would remove the card to find a &quot;pidgey&quot; card.","time":1444488903128},"pidgeot":{"definition":"Bird Pokemon capable of flying at Mach 2 and eats Magikarp whole","time":1444488917571},"wyd":{"definition":"&quot;What You Doing?&quot;<br /><br />See &quot;wubu2&quot;... present tense of &quot;what you been doing?&quot; may also been seen as wuu2.","time":1444488919211},"gyarados":{"definition":"The accidental yet embarrassing act of blowing water out of a bong through the slider, soaking the Marijuana. It gets its name because the action closely resembles the Pokemon Gyarados.<br />It often happens with first time bong users who forget they can&apos;t blow out the ash like they can with a bowl or pipe.","time":1444488936825},"joey":{"definition":"The hottest sexiest thing alive. I wanna lick his face off. ","time":1444488972186},"rapidash":{"definition":"A very good substitution to other words when trying to show happiness, or agreeing to something. Usually said by poke-nerds of all sorts. ","time":1444488992063},"9+10":{"definition":"A vine that was made with a little kid.","time":1444489019298},"aang":{"definition":"The protaganist of [Avatar: The Last Airbender]. A 12-year old monk who must master all four elements (air, water, earth, fire) in order to defeat the wicked Fire Nation and ultimately save the world.","time":1444489028792},"lenny":{"definition":"a fine, sexy ass, tall guy.  <br />a well rounded individual.<br />intelligent<br />ladies love him","time":1444489100196},"starmie":{"definition":"The Pokemon of the stars! Usually referred to the shit star as it has no real use in the Pokemon world.","time":1444489114304},"cloyster":{"definition":"Another word for a vagina, owing to the resemblance that the Pokemon Cloyster has to the female genitalia.","time":1444489125566},"onix":{"definition":"A [Pokemon] card&#x2f;creature resembling a snake made out of rocks.  The [phallic] nature of this creature was noted in a sly reference in the [manga] [Aoi House].","time":1444489133302},"diglett":{"definition":"A Pokemon of the ground type.  Arguably the best Pokemon in the entire series.","time":1444489145098},"dugtrio":{"definition":"The act of fingerbanging any dark hole resembling a hole in the earth by placing your ring and index fingers in line, still touching, with your middle finger.","time":1444489153658},"feebas":{"definition":"The most epic pokemon next to magikarp if it uses splash or tackle the universe will explode thats why it is rare in the pokemon games","time":1444489204551},"cynthia":{"definition":"Cynthia&apos;s are often shy people, but once your get to know a Cynthia they are one of the most loyal and friendly type of people you would ever be lucky enough to meet. Cynthia&apos;s love to talk but are often quiet to listen to their friend&apos;s problems. Cynthia&apos;s do not like sports, and are often too worried about life once but once you get to know a Cynthia you will see little by little that they let loose and have fun. Cynthia&apos; s are often known by there sad looking eyes and that gloomy look on there face, often they have dark hair and a pale dead like face because they are after all named after the goddess of the moon, and like the moon you will soon see their pale beauty and mysterious personalty, know as the invisible girl, a Cynthia can be a great leader,but is always ready to be a team player.<br /><br />By Kevin  ","time":1444489214223},"chris":{"definition":"A kid who is always up to party and have a good time","time":1444489234622},"pez":{"definition":"A spice boy with an exceedingly large head.<br />Known to frustrate people with pictures of his gay, pretty boy face.<br />Also known to come off with extremely cheesy sayings.<br />","time":1444489245421},"mango":{"definition":"Character on Saturday Night Live played by Chris Kattan.  Mango is an exotic male stripper who seems to attract every man&apos;s attention when he walks in the room.  Not to mention the fact he wears tight gold shorts.","time":1444489259216},"raichu":{"definition":"Pokémon #26. The evolved form of Pikachu.","time":1444489310486},"metapod":{"definition":"Metapod, a dud pokemon. This pokemon just sits there and all he can do is harden. This pokemon defies the laws of physics to stand up considering its crescent shape.","time":1444489318395},"beedrill":{"definition":"Beedrill, known as the Poison Bee Pokémon, are fully-developed, hornet-like Pokémon that have hatched from their pupal Kakuna forms. Although they are hornet-like, they only have four legs. The first two are tipped with long stingers. It has veined wings, and another stinger on its abdomen in which it holds its most powerful poison. Beedrill are extremely territorial, and will be set off by anything that approaches a Beedrill nest. When angered, Beedrill attack in a furious swarm, and the sharp ends of their stingers and the poison stored in their abdomens will definitely be put to use.","time":1444489333906},"the":{"definition":"a common mispelling of [teh].","time":1444489356474},"teh":{"definition":"Orginally started off as a typo for &quot;the&quot;, but recently has changed a bit in meaning.  &quot;Teh&quot; still means &quot;the&quot;, however, it is mostly used in the same manner that spanish speaking people use the word &quot;El&quot;.","time":1444489366165},"caterpie":{"definition":"a fucking penus that evolves into metapod and now you know.","time":1444489391866},"bulbasaur":{"definition":"A grass type pokemon. Evolves into Ivysaur, and then Venusaur. Attacks include Leech Seed, Vine Whip, Razor Leaf, and Solar Beam. Walks on all fours, and has a blub on its back. Weak against fire and flying pokemon.","time":1444489408885},"ivysaur":{"definition":"Pokemon #002<br /><br />Type: Seed<br /><br />Elements: Grass, Poison<br /><br />Height: 3&apos;03<br /><br />Weight: 28.7 lbs.<br /><br />When the bud on it&apos;s back starts swelling,<br />a sweet aroma wafts to indicate the flower&apos;s coming bloom!","time":1444489418768},"squirtle":{"definition":"This pokemon will rape you with bubbles.<br />With a smile on its face.","time":1444489439439},"charmander":{"definition":"Even the newborns have flaming tails. Unfamiliar with fire, babies are said to accidentally burn themselves.  The flame on its tail show the strength of its life force. If it is weak, the flame also burns weakly.   If it is healthy, the flame burns brightly.  Obviously prefers hot places. When it rains, steam is said to spout from the tip of its tail.","time":1444489459140},"charmeleon":{"definition":"The most disgraceful mid-evolved starter pokemon.Crappy moves.Also is the name for hatians with funny head shapes.","time":1444489482127},"mudkip":{"definition":"Mudkips were coolly brought to the 4chan table of love when this story with Copypasta-ed onto the site.<br /><br />Today being Halloween, I decided to fuck with the major retard at school when I came out of science for break. He was dressed as Ash. Knowing this was going to happen, I brough a Mudkips doll. Thus I started the conversation, making sure no one saw me.<br /><br />&quot;So I heard you like Mudkips...&quot; &quot;Mudkips? I LUUUUUUUUUUUUVE MUDKIPS.&quot; &quot;O RLY? So, would you ever fuck a Mudkips, that is..&quot; (he cuts me off before I could said &apos;if you were a mudkips&apos;) &quot;OF COURSE.&quot; &quot;Well I just happen to have a Mudkips here, and.&quot;<br /><br />Before I finished the sentence, which would have resulted in me hitting him across the face with the doll, he grabbed it. In one swift motion his pants were down and he was violenly humping it. Not to get between a man and his Mudkips I started to walk away, because there is no way I&apos;d be caught wrestling a half-naked crazy guy humping a Mudkips.<br /><br />Needles to say, within 5 to 10 seconds, some girls saw him and started screaming. I cooly walked into a restroom, pretending nothing had ever happened; not that I had intended that outcome, but now that it was in play I didn&apos;t want to be involved.<br /><br />I came back two minutes later, and like any wanton act on school grounds there was now a huge crowd round him. He was still fucking it and baying this real fucked up &apos;EEEEEEEEEEINNNNF EEEEEEEEEEINNNF&apos; sound. Suddenly a scuffle broke out in the middle, meaning he probably did something stupid.<br /><br />I asked someone what had happened. A girlfriend of one of the football players tried to get him to stop, but he bit her for trying to take it away. Someone called in a few football players (all dressed up like Road Warrior) who proceeded to pummel the shit out of the guy. Meanwhile the school police were freaking out and having trouble getting in to the situation.<br /><br />A few minutes later the intruder alarm went off and we were shuffled into classrooms. Over the intercom the principal announced that someone had thrown a flaming plush toy into the library. Uh.. what the hell.<br /><br />So we were kept there and about 30 minutes later the principal came on again. This time he was saying that whoever was behind the beating should turn themselves in. All of a sudden this woman began yelling &quot;I WILL SUE YOU FOR DAMAGES. YOU LITTLE PUNKS, I&apos;M GONNA SUE...&quot; and it was cut off.<br /><br />I asked an office later what had happened. Apparently his mother had come to pick him up and threatened to sue for the beating and &apos;whatever else happened.&apos; The school threatened to counter-sue because of lewd conduct, inciting a riot, and starting a fight.<br /><br />So I ask you: do you like Mudkips? ","time":1444489495534},"splatoon":{"definition":"The latest Nintendo IP, &quot;De Blob&quot; meets &quot;Team Fortress 2&quot;. A currently unreleased multiplayer shooter where players control squid-children called Inklings, spraying colorful ink all over a battlefield to control as much territory as possible. Currently has a metric ton of fan art, most of it pornographic in nature. Single-handedly convinced a large number of people to consider buying a Wii U. Also, its art style is so, so 90s.","time":1444489656611},"bro":{"definition":"Obnoxious partying males who are often seen at college parties. When they aren’t making an ass of themselves they usually just stand around holding a red plastic cup waiting for something exciting to happen so they can scream something that demonstrates how much they enjoy partying. Nearly everyone in a fraternity is a bro but there are also many bros who are not in a fraternity. They often wear a rugby shirt and a baseball cap. It is not uncommon for them to have spiked hair with frosted tips.<br /><br />Bros actually chose this name for themselves as they often refer to each other as &quot;bro&quot; even though they are not related.","time":1444489759778},"tongue":{"definition":"n. The amazingly talented mass of muscle laying in the floor of the mouth.","time":1444489897161},"doe":{"definition":"A deer, a female deer.","time":1444490193677},"she'llberight":{"definition":"[australian] for &quot;it will be ok&quot;, reflective of their supposed generally relaxed attitude to life.","time":1444490221129},"life":{"definition":"A sexually-transmitted, terminal disease.","time":1444490352293},"death":{"definition":"the cure for life","time":1444490356227},"doom":{"definition":"A classic first-person shooter ([FPS]) made by ID Software, the same folks who made quality games like [Wolfenstein] and [Quake].","time":1444490363562},"doomed":{"definition":"To condemn to ruination or death. when you are destined to an unhappy end. <br /><br />To be condemned.","time":1444490367340},"jebus":{"definition":"Homer Simpson&apos;s version of God.","time":1444490375364},"duffman":{"definition":"FOR SURE the greatest mascot ever made in history. Period.","time":1444490380748},"launderette":{"definition":"Where you go when you gotta get some clothes washed&#x2f;dried and you don&apos;t want anyone to know.<br /><br />They got a bunch of coin-operating machines. These places aren&apos;t as common, but you can still find &apos;em if you search. Some of them let you dry your clothes for only 25¢ - at least the grimy looking launderette in my town does that.","time":1444490395314},"iroam":{"definition":"iroam means maori backwards","time":1444490870549},"maori":{"definition":"Indigneous people of New Zealand, originating in South Pacific. Signatories to the Treaty of Waitangi, 1840. One of the national languages of NZ (The others being English and Sign). ","time":1444490878154},"stevejob":{"definition":"Some prick who immediately thinks that he&apos;s God due to his oh-so-revolutionary iPod, and of which so much dumbasses follow and sneer at Gates, because your &quot;mac&quot; is better.","time":1444490878817},"iroams":{"definition":"iroam means maori backwards","time":1444490882582},"roam":{"definition":"1|Wandering&#x2f;travveling around, Might be for long periods of time.<br /><br />2|[Exploring]&#x2f;touring.<br /><br />3|[Wander]&#x2f;walking around. People who have little to do and &quot;roams&quot; around the house.<br /><br />   *The meanings are of equal importance.","time":1444490886229},"japan":{"definition":"The country with the world&apos;s best toilets.","time":1444490910608},"llamas":{"definition":"This is the sly way to say pussy without being crude or using proper term such vagina. It is taken because the shape of an actual llama&apos;s mouth is similar to one of a female southern lips. In addition, they both spit.  Coming from the song: &quot;Don&apos;t Wanna Trust a Llama&quot; REMIX by Chynaman feat. Savage  www.myspace.com&#x2f;djchynaman","time":1444490919721},"bbl":{"definition":"be back later<br />used in internet chatting.","time":1444491044931},"anus":{"definition":"A hole used primarily for the dispensing of fecal matter.  Sometimes the insertion of oblongated objects such as various fruits, vegetables, broomsticks, fingers, penises, etc. are allowed entrance into this sacred area.  The size of the anus can vary depending on the size of fecal matter dispersement, as well as what types of objects are inserted into this area.<br /><br />The anus is also known as the asshole, butthole, chocolate starfish, brown eyed willy and has many other slang terms for it.","time":1444491379326},"caucasian":{"definition":"1- The incorrect term used to label a &quot;white&quot; man or woman. The word Caucasian refers to a person who is from the region of Caucasus, which is in Europe bordering Turkey and Iran. Therefore, I am not a Cauasian being that I am not from Caucasus. I am, in general, European. Also I am not &quot;white&quot; being that I do not blend in with white paint, or white paper. I prefer to think that I have some amount pigmentation in my skin, thank you very much. ","time":1444491682713},"pro":{"definition":"1. a professional<br /><br /> 2. professional<br /><br /> 3. a prostitute","time":1444492424854},"4chan":{"definition":"you have just entered the very heart, soul, and life force of the [internet]. this is a place beyond sanity, wild and untamed. there is nothing new here. &quot;new&quot; content on 4chan is not found; it is created from old material. every interesting, offensive, shocking, or debate inspiring topic youve seen elsewhere has been posted here ad infinitum. we are the reason for &quot;[not safe for work]&quot;. we are the [anonymous] army. cross us and you will fail. anonymous is everywhere. you depend on us every day. we bag your groceries, we fix your computers. anonymous sees you before you see him. sitting at desks around the world right now is a nameless, faceless, unforgiving mafia composed of the best of the best.<br /><br />we are 4channers. the people devoid of any type of [soul] or [conscience]. products of [cynicism] and [apathy], spreading those very sentiments daily. anonymous is the hardened [war veteran] of the internet. he does not forgive or forget. we have seen things that defy explantions. heard stories that would make any god-fearing, law abiding citzen empty their stomach where they stand. we have experienced them multiple times and eagerly await their return.<br /><br />4chan is a place of sheer [genius] and utter [stupidity], and there is often a thin line dividing the two. here you will see a state of mind that exists in most human beings, but is rarely if ever shown. this is a place where taboos do not exist. 4chan cannot simply be regarded as a simple website or imageboard. it is so much more than code. 4chan is alive and constantly changing. this is a subculture, a self-governing sect of the world. rich in history and foundation. to become a 4chan user is to speak a different language. to leave behind any methods of conventional thinking you once knew.<br /><br />there are things here that you will not understand and things you never will understand. if you cannot accept this then [GTFO] now. because there is no turning back.","time":1444493439717},"venus":{"definition":"1. A super sexy Roman goddess who became just a little bit slutty and a little bit arrogant.  She was gorgeous and eternally youthful, with beautiful reddish-blonde hair and perfect complexion.  She is the goddess of love,  beauty and everything sexual.  In other words, she was perfect.  100% utterly perfect. She was married to graceless dumbass Vulcan, the god of fire.  Her true love was actually Mars, the god of war.  Their child was gorgeous goddess Harmonia.  Male counterpart is Cupid.  In Greek mythology, known as [Aphrodite].<br /><br />2. Second planet from the sun, very hot.  Usually known to people as red, but sometimes it is beige.<br /><br />3.  Professional African-American female tennis player.  Has a sister, who also plays professional tennis, named Serena.  Last name is Williams.  Often known as the best female tennis players in the world.","time":1444493811600},"penis":{"definition":"The tool used to wean and convert lesbians and virgins into useful, productive members of society.","time":1444493816677},"wean":{"definition":"Scottish (mainly West of Scotland) term for a child. Derived from wee-ane (wee-one or little-one) Similar to Bairn","time":1444493837385},"vulcan":{"definition":"A tiny in town in Alberta, Canada. After &apos;Star Trek&apos; became popular the town capitalized on the name coincidence. There&apos;s a ton of Star Trek stuff in this town - murals, a huge starship, a space station that doubles as the town visitor center.","time":1444493918113},"korra":{"definition":"Super sexy ass new mini series show following Avatar The Last Airbender, the creators of the show wanted to please the fans with this new show after that shitty ass movie by m night shyamalan.  sadly it had to have the name &apos;The Last Airbender : Legend Of Korra because that fuck face james cameron took the name Avatar.","time":1444494008125},"ampy":{"definition":"To raise the intesity or to step it up","time":1444494092380},"jl":{"definition":"Just Lying","time":1444494225877},"fnaf":{"definition":"fnaf is short for &quot; [Five night&apos;s at Freddys]&quot;, a horror game by Scott Cawthon","time":1444494257794},"alliance":{"definition":"Faction in World of Warcraft played by two kinds of people: Pre-teens and teens that aren&apos;t angsty and gothy enough to play Horde.","time":1444494366148},"intesity":{"definition":"Tested intensity","time":1444494713131},"eliminator":{"definition":"The signature cocktail of the infamous Kelsey&apos;s bar, Leamington Spa. It&apos;s full name is &apos;the redbull eliminator&apos; although due to cutbacks, it no longer contains the well known (expensive?) energy drink redbull.  It is currently only available in 4 pint pitchers at about £9.50, and easily recognisable by it&apos;s eerie, unnatural green colour. It might be translucent or opaque depending on the skill of the bar staff on duty and availability of the ingredients at the ungodly hour you decide to order one.  Ingredients:<br />4-6 shots (straight from the top shelf, mainly shitty cheap-yet-strong vodka)<br />2-3 cans of &apos;kick&apos; (or whatever cheap energy drink happens to be available)<br />A pint of wine (actually it was lambrini, until an even cheaper alternative called lambrusco or something was found... guess the recession&apos;s Kelsey&apos;s pretty hard)<br />Topped up to the 4pint mark with fruit juice (mainly nasty orange juice straight from the costcutters round the corner)  Basically the ideal drink if you&apos;re stuck in Kelsey&apos;s during the early hours, wondering where the night&#x2f;your life went wrong, when suddenly the idea hits you: &apos;I wonder if I can get absolutely fucked off my face for around a tenner?&apos;  That said, it does actually taste pretty good.<br />Bon appetit!","time":1444494735211},"2cents":{"definition":"A humble opinion. Just being humble and saying its worth only two cents.","time":1444494845524},"ronjeremy":{"definition":"a man who gets more ass then a toilet seat","time":1444495769488},"skill":{"definition":"(noun)<br /><br />what is needed to snag a woman.","time":1444495926590},"itachi":{"definition":"The sexiest anime villain ever.","time":1444496110937},"swim":{"definition":"swim:<br />S-someone<br />W-who<br />I-isnt<br />M-me","time":1444496142461},"swiming":{"definition":"Swiming, &#x2f;schwī&apos;mɪ̈ng&#x2f;,(goblin): a ritual water sport engaged in by the goblin race approximately 30,000 years ago during the Mattonian age. Every winter, participants were pitted against one another in a contest of bravery. archaeologists can only speculate from ancient translations of stone tablets that the maturity rite began with an affirmation of fertility, known as the &quot;clasping of hands&quot;. after the clasping of hands the goblins seek out a wet dark environment, like an aquatic cave, under a bridge or waterfall. the rest of the ritual is shrouded in esoteric knowledge and secrecy. it appears a main element of the mythology centered around grunt beetle larvae. grunt beetles lie hibernating in logs during the winter, and so their aphrodisiac secretions remain acutely potent in their glands. unfortunately not much is known about the actual competition except that it appears the grunt beetle larvae were massaged into the gonads of one&apos;s rival. it&apos;s unclear how victory was declared and defeat was recognized, but everyone leaves the cave a winner","time":1444496145555},"swimming":{"definition":"a way to stop from drowning","time":1444496178667},"phantom":{"definition":"When a man has anal&#x2f;doggystyle sex with a chick facing a window then trades places with his buddy who is hiding in the room without the chick realizing. The guy then proceeds to go outside and wave at the chick who is looking out the window. She then asks herself &quot;If he&apos;s out there, who is fucking me?&quot;","time":1444496398462},"zapdos":{"definition":"The most badass pokemon that ever lived. Is very hard to amuse.","time":1444497009035},"moltres":{"definition":"Moltres takes the form of a large bird with flame-colored plumage, resembling a phoenix. Its dazzling wings and elaborate head crest appear to be covered with flames. It has a straight, pointed brown break, which is the same color as its feet. Compared to the other legendary birds ([Zapdos] and [Articuno], it has the smallest feet and legs. However, it is the largest of the legendary birds, but its feathers make up a good portion of its bulk. When Moltres flaps its wings, it creates a brilliant flash of flames. It is also one of the few Pokémon known to naturally wield the very powerful Flying-type move Sky Attack.  Moltres is one of the legendary birds of Kanto, and is a poorly understood species, believed by many to be pure myth. Its behavior is largely clandestine, but it appears to migrate to the south during the springtime. There are many folktales surrounding this species, but perhaps the most popular is that its appearance will bring about an early spring. When Moltres flaps its wings, it sheds hundreds of tiny embers. It is believed that these embers have healing properties. If injured, it will immerse itself in lava to heal. Moltres appear to live in hot regions, particularly active volcanoes. They are spectacularly rare. Moltres have been sighted on Victory Road and near the Sevii Islands. One has been recently sighted, roaming Sinnoh.","time":1444497016907},"articuno":{"definition":"Ice Birdie Queen Pimpstress the Pokémon. <br /><br />The coolest. The hottest. The iciest.","time":1444497028923},"mom":{"definition":"The woman who loves you unconditionally from birth, the one who puts her kids before herself and the one who you can always count on above everyone else. <br /><br />Just telling her your problems makes you feel better because mom&apos;s always know how to make it all go away. <br /><br />Even if you fight, know that she&apos;s just looking out for your best interests.","time":1444497049801},"suck":{"definition":"Not good.  Bad.  <br /><br />The early Jazz musicians would say that a guy could really &quot;Blow&quot; if he had a good sound when playing the horn.  If he couldn&apos;t play very well then they would say that he was &quot;Sucking&quot; on that horn.  That&apos;s where the term &quot;Suck&quot; as being something bad came from.","time":1444497057387},"trains":{"definition":"A group of guys stand in a line outside a room.  One by one, they enter the room to have sex with one girl inside.  The line must have at least 7 guys to be qualified as a train.","time":1444497191806},"gos":{"definition":"Gay or something","time":1444497332826},"lmfao":{"definition":"Laughing my fucking ass off","time":1444497338916},"hating":{"definition":"When one puts down the success or fortune of others due to jealousy. <br /><br />See hater, hatorade","time":1444497371639},"incest":{"definition":"The way the British royal family keeps itself German.","time":1444497398121},"quar":{"definition":"Old English for queer","time":1444497735812},"yaoi":{"definition":"Yaoi is a slang meaning &apos;boys love&apos; or [homosexuality] that is used in the japanese language. Popular with fangirls who like their favorite anime guys to kiss.","time":1444497835332},"bbm":{"definition":"Black berry messenger (noun)<br />To black berry message (verb) can be used &quot;to bbm&quot;<br />An instant messaging application on blackberries where you can see if the message has been delivered, when it was delivered and if the person has read it.","time":1444497873097},"feces":{"definition":"feces means: shit","time":1444497879612},"ping":{"definition":"The time it takes for a network packet to leave your computer, go to another one, and return.  Lower = better.  Can also be a source of gloating in network games.  Typically measured in milliseconds.","time":1444497886888},"flikker":{"definition":"Dutch word for Fagett&#x2f;Homo&#x2f;Queer&#x2f;Gay etc","time":1444497891616},"urmum":{"definition":"The insult of all insults.  When you&apos;re stuck and have nothing to say, just say &apos;ur mum&apos;.","time":1444497895420},"dildo":{"definition":"City in Newfoundland, Canada","time":1444498038953},"apple":{"definition":"The alternative to the orange.","time":1444498114935},"yoloswag":{"definition":"A term used by twelvie morons that wear baseball caps backwards, have their pants sag half way down their arse crack, wear Converse sneakers and generally act like douchebags on public transport by blasting crappy dubstep and pop music through the tinny little speakers on their phones. Yoloswag to them means &apos;oh yeah, fuck i&apos;m good, just ask me&apos; but to the sane population all we see are whiny little douchebags that need a smack in the head with an ASP expanding baton.","time":1444498262344},"dinosex":{"definition":"When two people over the age of 80 have sex they technically become dinosours so its considerded Dino sex. If the man or woman can still have an orgasm its probably in the powder form which may be kinky for many people, but it is rare to see the powder.","time":1444498266908},"rios":{"definition":"When you see someone who is so fucken stunning and just want to get them in your pants.","time":1444498993626},"muk":{"definition":"A Pokemon that is purple and is in the shape of a pile of slimey crap.","time":1444499288920},"woopwoop":{"definition":"An expression designed to express approval, happiness, joy, and&#x2f;or excitement usually accompanied by a knocking together of the fists with a buddy.","time":1444499383138},"geodude":{"definition":"The most gangster pokemon alive. He has no legs, but he doesn&apos;t need them, only arms. One for slappin&apos; bitches, and one for countin&apos; money.","time":1444499517208},"graveler":{"definition":"A person who when having sexual intercourse with his partner on pavement creates potholes and crushes it into gravel as a result.  This is possible because during climax, the intensity of the intercourse is so vigorous and forceful.","time":1444499543606},"golem":{"definition":"A Golem is a sort of creature whose name became popular in several [RPG]s such as Dungeons &amp; Dragons, [Pokémon], and [Chrono Trigger].<br />Traditionally, Golems are rocklike creatures whose structure is covered with a near-impenitrable stone.<br />In the case of D&amp;D, there are several variations of Golem that use elements other than Stone, such as Iron and Flesh (which is a nod to [Frankenstein]).<br /><br />There are mixed views as to exactly what a Golem looks like, but the general view is that a Golem is large, perhaps larger than a human, and is covered in a rocky mass. It is not all that pretty, and sometimes features a rather ugly mouth.<br /><br />Golems seem to be submissive creatures, as they never really act on their own, and are controlled by whoever Summons&#x2f;Finds them. Thus, they are not necessarily good or evil in spite of their evil-ish appearance.","time":1444499561597},"aegislash":{"definition":"Aegislash is the overrated [Bug] [Pokemon]. With insanely high 1 attack, special attack, it can sweep [over 9000] [Magikarp]s. It is highly rated by [knight] [bitches] who know nothing about Pokemon. It is fucking stupid and you are stupid if you use it. Aegislash also means [poopy] [dipshit].","time":1444499734227},"over9000":{"definition":"What the scouter says about Goku&apos;s power level. [Over Nine thousand]","time":1444499908467},"meta":{"definition":"A term, especially in art, used to characterize something that is characteristically self-referential.<br /><br />","time":1444499916299},"stitch":{"definition":"(noun) A cute and cuddily alien fiend who is often seen carrying multiple firearms. He has a friend who has the same name as a Linux bootloader.","time":1444500380951},"berries":{"definition":"A police car. The red lights on old cop cars looked like a berry on top of an ice cream. &quot;Berry flashing those high beams&quot; refers to a cop behind your car signalling for you to pull over.","time":1444501332243},"ohbabyatriple":{"definition":"&quot;Oh baby, a triple!&quot; is a phrased coined by a child playing one of the Call Of Duty games. He happens to be wielding a sniper rifle during a round of [ffa], and while [camping] comes across 3 people standing in a line. He fires, and headshots all 3 players, shortly after saying &quot;Oh baby a triple! Oh yeah!&quot; The term is commonly used among gaming communities, and it may be used as a literal term to describe a triple kill, or it would be used as sarcasm, to show someone their accomplishment wasn&apos;t very important.","time":1444501644268},"makesout":{"definition":"a result of lots of hard work and study. The result of a nite out on the town with your boyfriend. Walking away from your favorite casino in [Las Vegas] during a winning streak.","time":1444501705772},"emotes":{"definition":"A term used in [MMORPG]&apos;s such as [World of Warcraft] which describes an action your character can perform which is usually accompanied by sound and sometimes even an animation. Emotes include: <br /><br />&#x2f;poke <br />&#x2f;cheer <br />&#x2f;chicken <br />&#x2f;moo <br />&#x2f;dance <br />&#x2f;insult<br /><br />Also a useful way to communicate across factions in games like [WoW] where Alliance and Horde players speak different in-game languages such as Orcish, Darnassian, etc.","time":1444501748309},"thirdbase":{"definition":"The third base before home plate in baseball you damn perverts.","time":1444501758841},"secondbase":{"definition":"One step up of First Base, heavy petting and feeling up while making out, up the shirt or shirtless for both partners.","time":1444501767000},"homerun":{"definition":"To accelerate through [first base] ([french kissing]), onto [second base] (&quot;[heavy petting]&quot;) to [third base] ([oral sex]) and finally coming around to [home plate] ([sexual intercourse]).","time":1444501780434},"makeout":{"definition":"the act of swapping spit with your significant other... or perhaps just some hottie you met at a party, but anyway, you just sit there sucking at eachother&apos;s faces for an extended period of time and if you&apos;re lucky there might even be a little romming around of the hands if ya get my drift :p","time":1444501895762},"intercourse":{"definition":"the word sex ed teachers call getting laid","time":1444501914688},"sexualintercourse":{"definition":"to fuck, to screw, to bang, to reproduce, to copulate, to pork your lover, to booger my bed, to hump your honey, to get laid, to lay some pipe, to hide the salami, to slam (or to get slammed), to burry the bone, to stuff the donut, to moisten the carpet, to dine in the Y, to munch on the rug, to slam the hen, to shoot the sherbert, to whack Willy Wonka into Wonderland, to yodel in the mighty fairy-infested, stinky, and yeast-infested canyon of love, etc.  There are undoubtedly many more which I have forgotten at this time.","time":1444501923492},"puzzy":{"definition":"puZZy – An Abstract misrepresentation of the female genitalia most commonly used by males to express excited emotions, sexual frustration, and out right spontaneity. puZZy may at times be used out of context, in fact puZZy may be used in daily conversations. In some cases, puZZy may be used to egg someone on… i.e. “your friend” Also puZZy may not be used as “Pussy” they are both different in a sense… depending which part of the universe you’re from… in other words, puZZy is not “The happiest place on earth”<br /><br />-Doctored By [Sexapunch] On Ragnarok Online <br /><br />Pronunciation: (puuuh-zeee!)","time":1444502240415},"fit":{"definition":"The British version of Hot. ","time":1444502246685},"fitness":{"definition":"general awesomeness","time":1444502254088},"bulky":{"definition":"gun","time":1444502263409},"calory":{"definition":"tiny, microscopic creatures who live in your closet who sew up your close each night to make them smaller. They do this out of jealousy and hatred for the human race for not recognizing them as existent.","time":1444502271488},"hobbit":{"definition":"Small, they would only seem as small children to your eyes. Average height being three foot six or so. Also, they have hairy feet, and a keen intrest in the brewing of Ale and pipeweed, the most famoust being Old Toby (the finest weed in the south farthing). Hobbits can also been known as halflings (because they are half the height of the average human) and Shirefolk (Since thats where alot of them live)","time":1444502294898},"bleed":{"definition":"to do illegal actives in which you profit money off of. mainly selling drugs.","time":1444502349782},"kappa":{"definition":"The main symbol&#x2f;emote of Twitch.tv. It represents sarcasm, irony, puns, jokes, and trolls alike. If you see this term used outside of Twitch.tv, then this is not the correct definition. Usually used at the end of an ironic or sarcastic sentence. Sentences that contain a Kappa should not be taken seriously. If you search &quot;Kappa Twitch.tv&quot; in Google you can see what the emote looks like, and why it is used as it is. Sentences that use Kappa do not always have to make sense.","time":1444502366564},"hm01":{"definition":"A pokemon fan&apos;s way of saying &quot;cut&quot;, as it is the ability &quot;cut&quot; in pokemon games.","time":1444502371639},"riot":{"definition":"The best way to solve problems.","time":1444502388229},"gun":{"definition":"A complex arrangement of metal parts that is capable of discharging a lead peice at very high speeds, high enough to penetrate fleash and thin slabs of wood.  Serves as humankind&apos;s (so far) permanent replacement for spears, staffs, swords, daggars, etc. as most effective weapons.  Most commonly used for self-defense, murder, killing hostiles, recreational shooting, the standard issue weapons for armies, militias, etc.","time":1444502512427},"femboy":{"definition":"A young boy who presents extensive feminine mannerisms and actions often blurring the line between a boy and a girl.  Can be confused with a cross dresser, but it usually refers to boys at very young age or in their teens.  Commonly used to define gay boys who dress like girls, but some can be straight too.","time":1444502676943},"bb":{"definition":"Netspeak for baby, most likely used at the end a phrase as an added emphasis or exaggeration.","time":1444502694003},"bucks":{"definition":"1.v: slang for the act of fighting<br />2.v: slang for disagree&apos;ing and feeling angry towards something<br />3.n: slang for a young black man<br />4.n: a male deer<br />5.n: slang for money","time":1444502738268},"gdi":{"definition":"God Damn Independent, a college student that is not in a fraternity&#x2f;sorority.","time":1444503140800},"wax":{"definition":"A vinyl record; LP.","time":1444503412014},"hitthequan":{"definition":"A dance consisting of a series of actions mimicking the rappers&apos;s words and sounds. The dance can be interpreted multiple ways and you can make your own moves, but it should include some form of stepping, squatting and arm movement. This dance has recovered us from the endless &apos;watch me whip&apos;.","time":1444503417127},"floatie":{"definition":"a turd that keeps a-spinnin and won&apos;t go down, it stays afloat","time":1444503573690},"your":{"definition":"The possessive form of you. Not to be confused with &quot;you&apos;re&quot;, which is a contraction of you and are, meaning &quot;you are.&quot;","time":1444503912922},"you're":{"definition":"How idiots spell the possessive adjective &quot;[your]&quot; when they think they have mastered not to misuse it.","time":1444503915244},"$":{"definition":"Dollar sign.<br /><br />Two or more of these together can either be a short way to talk about money over the internet, and can also be used to describe something that is really cool&#x2f;great&#x2f;elite etc.","time":1444503928126},"mtg":{"definition":"Magic: The Gathering, a collectable trading card game that will consume you, your life and your income!","time":1444504362302},"yugioh":{"definition":"an extremely underrated card game that can be fun, but gets old fast. the show, on the other hand, sucks ass. but that&apos;s the american version. for all those people who say &quot;it&apos;s the crappiest show ever&quot;, watch the japanese anime, the original version, on subtitles. it fallows a completely different storylinbe, and they play different games besides the card game. ","time":1444504377254},"bof":{"definition":"&quot;whatever&quot;, in French","time":1444504386576},"hore":{"definition":"Actually thats the way &quot;whore&quot; is spelled in Norwegian...","time":1444504394957},"esports":{"definition":"E-sports is electrion sports meaning sports played online mostly.  E-sports is getting bigger everyday with online leagues and competitions for money.  One of the largest e-sports league is CAL- (Cyberathlete Amature League) and biggest place to play against the best of the best is at CPL (Cyberathlete Professional League).","time":1444504407019},"skype":{"definition":"Technology that may re-introduce the concept of hands-free conversation to a whole new generation.<br /><br />Like all new technologies, it has the potential for evil as well as for good.","time":1444504434952},"omegle":{"definition":"A website (omegle.com) that is an anonymous one on one chat, pretty much a feeding ground for pedos.","time":1444504454919},"pimp":{"definition":"P-Person<br />I-Into<br />M-Marketing<br />P-Prostitutes","time":1444504512075},"foof":{"definition":"a much less vulgar, more acceptable alternate word for the female genital area.","time":1444504525522},"foox":{"definition":"foox is another word for sexual intercourse.","time":1444504559398},"food":{"definition":"a substance you eat,then poop out.usually followed my a nap.","time":1444504565011},"poop":{"definition":"Bodily waste of varying color, viscosity, shape, odor and texture. Usually exits the body through your pooper, speed, noise and degree of pain may vary depending on what you ate. ","time":1444504574425},"darude":{"definition":"Darude is a techno artist that hails from Europe (like 99% of all other techno artists).  His first release was entitled &quot;Before the Storm&quot; which included into his best hit to date &quot;Sandstorm&quot;.  While popular in the mainstream, many techno fans (like me) hated the song simply because it was entirely overrated and over-played on the radio.  &quot;Out of Control&quot; and &quot;Feel The Beat&quot; singles followed suit, using the same style from &quot;Sandstorm&quot;.  <br /><br />A few years later, Darude released his second album &quot;Rush&quot;.  Although not as popular as the album before it, &quot;Rush&quot; had a much better overall sound.  Two singles were released from the album, &quot;Music&quot; and &quot;Next to You&quot;.  Both singles were trance and weren&apos;t instantly popular like &quot;Sandstorm&quot;.  However, the album is full of great hits like &quot;Passing By&quot; and &quot;Bitter Sweet&quot;.<br /><br />Darude is currently on tour.  If he continues to make albums like &quot;Rush&quot;, he will the respect of the techno community he lost during the &quot;Sandstorm Era&quot;.","time":1444504590699},"spectres":{"definition":"An agent of the Citadel office of Special Tactics and Reconnaissance. Although based on the Salarian Special Tactics Group, Spectres are expected to rely on their own resources, rather than being constantly funded by a governing body. However, they usually operate outside the bounds of galactic law.  Rather than being trained, the Citadel Council selects notable soldiers who have proven themselves capable of the strenuous responsibilities of upholding galactic law. Some agents are sympathetic peacekeepers who resolve issues with minimal bloodshed, while others are cold-blooded killers who eliminate problem individuals.","time":1444504614182},"pewdipie":{"definition":"DUMBASS YOUTUBER WHO IS A GAY AND HORNY D BAG","time":1444504618040},"markiplier":{"definition":"A man from youtube who makes strange gutteral noises and plays horror games.","time":1444504625407},"ion":{"definition":"Ion is used as a replacement for &quot;I don&apos;t&quot;. This can be found especially on twitter.","time":1444504853009},"flux":{"definition":"A state of indecision or uncertainty","time":1444504861304},"meowth":{"definition":"Third member of [Team Rocket]. Meowth is a male Normal-type Pokemon. As a young kitten he fell in love with a female Meowth named Meowsie, who was an absolute biatch. To impress her, Meowth worked his cute little ass off learning how to talk. Unfortunately those dang writers made Meowsie reject him anyway, he got sad and looked for a job.. He joined Team Rocket, an organisation devoted to stealing rare and valuable Pokemon, and was teamed up with rookie members Jessie and James. Since that day forth the infamous trio have been going about their daily lives, through a routine of Thunder-shocking&#x2f;-bolting&#x2f;-shetting and such and providing us (the audience) with much needed entertainment in this dull, lifeless repetition that is Pokemon.<br /><br />Long story short: Meowth is the coolest anime animal villain ever.","time":1444504898302},"yt":{"definition":"white person ie whitey <br />","time":1444504969375},"shark":{"definition":"this is a move when you have your girl get on her knees doggystyle and you stand across the room naked. then you put your hands together above your head and mimic a shark, all the while your humming the JAWS theme song. you make your way across the room and when you get near her you hump her as hard as you can sending her head crashing into the wall.","time":1444505135871},"safety":{"definition":"An extremely stupid game, consisting of one person farting, then quickly saying &apos;Safety&apos; before the other person can say &apos;Doorknob&apos;. If the other person says &apos;Doorknob&apos; within that small window of time,they can punch the aforementioned person in the arm, without any retaliation, until that person touches a doorknob. <br />-See also &apos;Doorknob&apos;","time":1444505141522},"doorknob":{"definition":"This is what you say when someone else farts and you notice it before they say saftey ,you say doorknob. You can punch them until they toucha doorknob.","time":1444505152900},"hiv":{"definition":"Stands for &quot;Human immunodeficiency virus&quot;.  contrary to some idiot&apos;s beliefs, it was not given to us by the homosexual community.  It is believed to originated in Africa from a mutated form of a virus in a diseased monkey.  We dont actually know how it came about.  It is widely accepted that HIV causes [AIDS] (acquired immune deficiency syndrome) but becuase we cannot do experiments to prove this (due to morality issues) the African government can claim that there is no evidence supporting this hypothesis and does not have to supply medicine for its citizens.","time":1444505495956},"10/10":{"definition":"Something you say when girl has super awesome tits","time":1444505528148},"blacklotus":{"definition":"The absolute best card ever printed for Magic: The Gathering.<br /><br />This card is so good that people today buy it for prices of AT LEAST $1000.00<br /><br />This card is so good that cards that were specifically made to do exactly 1&#x2f;3 of what it does (Lotus Petal) and cards that were specifically made to be insanely crappy versions of it (Lion&apos;s Eye Diamond) got banned along with it because they were abused just as much.","time":1444505534005},"12:12":{"definition":"When you start beating off at 12:12 AM.","time":1444505668339},"7/7":{"definition":"The day and the month in the year 2005 when 4 [Muslims] killed 52 innocent Londoners.<br />","time":1444505681430},"botl":{"definition":"Brother of the Leaf. A friendly name for a fellow cigar smoker. Also SOTL, or Sister of the Leaf.","time":1444506255278},"milf":{"definition":"&quot;Mother I&apos;d Like (to) Fuck&quot;","time":1444506458261},"nigga":{"definition":"Nigga is a word which evolved from the derogative term &quot;nigger&quot;. Tupac best defined the distinction between the two.<br /><br />NIGGER- a black man with a slavery chain around his neck. <br /><br />NIGGA- a black man with a gold chain on his neck.","time":1444506586714},"corny":{"definition":"Trying to be cool, but ultimately very uncool indeed, and often even extremely embarrassing","time":1444506605070},"wtf":{"definition":"The World Taekwondo Federation.<br />WTF, holds many competitions throughout the world.","time":1444506680128},"omg":{"definition":"Net-centric abbreviation for the popular exclamation &quot;Oh my God!&quot; (generally used in conversations to exclaim surprise or disgust). Most commonly used by teenage girls who find it depressingly hard to type out an entire word. Reinforces assumptions that humans seem to be getting dumber from generation to generation. See also [u], [like].","time":1444506683646},"combee":{"definition":"A big fat dick, usually inserted into a female&apos;s tight anus.","time":1444506844776},";v":{"definition":"Expression used to signify a wink with the addition of the &apos;knick&apos; sound coming from the mouth. To clarify the sound made, sucking air back into your mouth while pressing your tongue against the roof of you mouth (all on one side of your mouth) enables the sound. The expression can be used to convey the &quot;I know&quot; or the &quot;That&apos;s right&quot; statements&apos; emotions. A person may use this same expression daily in those &quot;I told you so&quot; and &quot;that&apos;s what I thought&quot; moments, as well.","time":1444507351641},":v":{"definition":"Created by Internet pioneer Joe Griffith in August of 1999, the :V is as ambiguous as it is masterful, representing a variety of expressions and emotions.  Occasionally seen on the somethingawful.com forums in one or more forms.","time":1444507358456},"imp":{"definition":"A smaller, more mischevious version of a demon","time":1444507748349},".3.":{"definition":"A [smiley], basically. The two periods are eyes and the three is a pursed mouth, like a kissy face.","time":1444507785927},"scizor":{"definition":"A steel-bug type [Pokemon] whom [Scyther] evolves into when given a &quot;Metal Coat&quot; and traded.","time":1444507924500},"bug":{"definition":"A fault in a computer system or any physical entity including humanoids.","time":1444508042067},"aussi":{"definition":"aussi; an australian legend known to consume copious quantities of alcohol.","time":1444508138608},"quebec":{"definition":"The french part of Canada, makers of the original POUTINE. Legal drinking age : 18, real drinking age : 13.","time":1444508321303},"high":{"definition":"The state I am in now. For the 5 people who have never gotten high, I will try to explain it. at first, before you are really high, you become really giddy and will laugh at the slightest thing. you also may remember random things and pointlessly share them. When you are high, it feels very much like your dreaming. when you are sober, it may be hard to remember wut happened when you were high, much like how its hard to remember a dream after you wake up. when you are high, your vision gets messed up. some people compare it to watching your vision in a movie theater. for example, if you turned on your tv while high, it may seem like you are sitting in a movie theater watching a movie of yourself turning on a tv in the first person. also, you see things in a different perspective. if you are high enough, your own house can seem completely different! music is also heard in a different perspective. it can seem like the music surrounds you. I like to describe it as being &quot;in the music&quot;. Different music can have different effects on you. old school rock can make you trip out or go crazy. rap can make you freestyle better than you ever thought possible. techno can actually sound cool. your balance and coordination are afffected when you are high. you frequently move around and almost fall if you&apos;re high enough. simple tasks (like typing this) can be a lot harder when you&apos;re high. also watching things can be different, particulary animated things. I strongly recomend watchin the animatrix while high to find out what im talkin about. i tried my best to explain being high, but really the only way to understand it is to get high yourself. so, for you five who have never gotten high, go get lots of weed and smoke it now! Note: once you&apos;ve been smoking weed for a while, it can be very hard to achieve the state i described.","time":1444509027192},"guy":{"definition":"used for a normal&#x2f;bloke-ish kind of boy. orringinates from guy fawks","time":1444509050982},"vulgar":{"definition":"A rude term. Crudely indecent. Deficient in taste, delicacy, or refinement. Uncouth. Sometimes offensive, often used with sexual innuendo&apos;s.","time":1444509065145},"infernape":{"definition":"A Fire-Type Pokemon based off of a monkey. Also known as &quot;The Flame Pokemon.&quot; Infernape is the final form Chimchar and evolves from Monferno. Infernape is one of the three final evolutions of the starters of the Sinnoh region. Infernape can know great Pokemon Moves such as Flare Blitz and Close Combat. These moves can deal great damage upon other Pokemon especially Grass and Steel types.","time":1444509135702},"thorn":{"definition":"A curse which makes the bearer invincible, but also forces him&#x2f;her to kill his&#x2f;her immediate family. Every once in a while on Halloween (and only Halloween), the Thorn constellation appears in the sky, signalling the followers of Thorn to curse a new person. When done, prosperity falls on the whole tribe. [Michael Myers] is currently cursed with Thorn, and Terence Wynn (who is currently missing) serves as his watcher. A person with allegiance to Thorn can be identified by a Thorn tattoo on their right wrist.","time":1444509154346},"thorny":{"definition":"A man who LOVES to wear suits and is hopeless with money.<br />He is the kind of guy who walks into an upper market bar and orders cocktails for all of his friends, but then can&apos;t afford the taxi ride home.<br />","time":1444509305065},"squanch":{"definition":"A cluster of food trailers. Similar to a pod of dolphins or flock of birds. Squanch only refers to multiple food trailers in a group.","time":1444509387587},"bush":{"definition":"The only presendent of the United States of America to be all most assassinated by a pretzil.","time":1444509388090},"tush":{"definition":"rear-end, butt, behind","time":1444509391702},"irus":{"definition":"Engrish for &quot;I love you&quot;<br />Usually used by quasi-racist teens on social sites, it is meant as an alternative to ily or ilu.","time":1444509802995},"hand":{"definition":"An alternative to having a girlfriend","time":1444509809515},"engrish":{"definition":"A form of English characterized by bad translation from Japanese by someone who is decent at translating vocabulary but has a poor grasp of English grammar. Tends to be a word-by-word literal translation with humorous results for native English speakers. Engrish is most common in old video games and anime subtitles.<br /><br />The term &quot;Engrish&quot; comes from the fact that the Japanese language does not have distinct L and R sounds. They do have a consonant that is roughly somewhere in between these two sounds, but whether this translates to L or R in English depends on the situation (and therefore can be interpreted wrong.)","time":1444509812929},"twizzler":{"definition":"the act of crossing the index and middle fingers and inserting them into a woman&apos;s vagina with a deep thrust.","time":1444509840990},"autistic":{"definition":"The cause of autism is unknown, but studies show that people with autism have larger brains than normal.","time":1444509977204},"marinaandthediamonds":{"definition":"Marina Lambrini Diamandis, her stage name being &quot;Marina and the Diamonds&quot; is an alternative indie pop musician. Many often make the mistake of thinking Marina is the lead singer, and &quot;the Diamonds&quot; are the band, like Florence and the Machine. Though this is inaccurate information. &quot;The Diamonds&quot; refers to Marina&apos;s fans. We are the Diamonds.  Marina is an amazingly talented musician and lyricist. And she&apos;s gorgeous. I knew I was a lesbian after watching her music video for &quot;Oh No!&quot; She&apos;s so hawt.","time":1444510170579},"v":{"definition":"Voilà! In view, a humble vaudevillian veteran, cast vicariously as both victim and villain by the vicissitudes of fate. This visage, no mere veneer of vanity, is a vestige of the vox populi, now vacant, vanished. However, this valorous visitation of a bygone vexation stands vivified, and has vowed to vanquish these venal and virulent vermin vanguarding vice and vouchsafing the violently vicious and voracious violation of volition! The only verdict is vengeance; a vendetta held as a votive, not in vain, for the value and veracity of such shall one day vindicate the vigilant and the virtuous.","time":1444510182411},"vuk":{"definition":"&quot;Wolf&quot; in Serbian.<br /><br />Eng: Wolf, Germ: der Wolf, Swed, Ulv or Varg, Kurd: Varq or Gorg, Pers: Gorg, Fren: Loup.","time":1444510185169},"kuv":{"definition":"Kuv is a misspelled version of &quot;luv&quot; or &quot;love&quot;. Kuv is usually only said by stupid fifth graders who think that they&apos;re in love, but it can also be very cute if you&apos;re in the eighth grade through the twelfth grade. Kuvs usually lead to multiple breakups with the same person, and when you accidentally break up with them while you are PMSing and your friends think that you should get back with some jerk, and you&apos;re hormonal enough to agree. You will usually ask the person you fell in kuv with to go back out with you, and they will incidentally be waiting for some random girl until they are allowed to date, which is incidentally in college. Kuvs usually end up screwing you over because the person you are in kuv with turns out to be a total butt-head.","time":1444510202913},"weeds":{"definition":"God&apos;s gift to the world.  Brings peace when used wisely.","time":1444510206045},"love":{"definition":"nature&apos;s way of tricking people into reproducing","time":1444510313076},"heart":{"definition":"The final element needed to summon Captain Planet!","time":1444510317130},"captainplanet":{"definition":"It is ironic that the show, which was supposed to be about saving the environment, is actually sponsored by a few corporations which are responsible for some of the world&apos;s pollution.  It kinda negates the whole purpose of the show.","time":1444510324304},"dargon":{"definition":"A mentally challenged dragon.","time":1444510341500},"bruh":{"definition":"Used by african Americans Males in everyday vocabulary or to greet one another","time":1444510347246},"lowkey":{"definition":"to keep something low key: to not announce it; to have a quiet gathering; opposite of a large party or big group of people; not much emphasis, closely aligned with a normal night out doing the usual stuff.","time":1444510616548},":>":{"definition":"an emote used primarily in Yahoo messenger; like a smile, but better","time":1444511017408},"retorical":{"definition":"A word not intended to have a response.","time":1444511341227},"^.^":{"definition":"An ascii face or emotion icon used to describe happiness, or contentness.  The &quot;^&quot;&apos;s are the eyes, and the dot it a nose.  It&apos;s often used by asians or anime fans.","time":1444511418017},"zugu":{"definition":"A thin polyester shirt, often bright colors.","time":1444511422829},"satire":{"definition":"The art of sarcasm typically directed from events that take place in the world.  Much like a [caricature] of the human race.  Usually it is done through comedy, but sometimes it is just as serious as the event itself.  South Park is know for its satirical episodes.  The Terry Schiavo case being one that sticks out.","time":1444511465482},"iulia":{"definition":"the most sweet, kool, beautiful girl the world will ever know ...","time":1444511636942},">:3":{"definition":"It&apos;s a lion. Yeah, a liJESUS CHRIST IT&apos;S A LION GET IN THE CAR!!<br /><br />","time":1444512115444},"gangster":{"definition":"There are two types of &quot;gangster&quot;:<br /><br />1) A wannabe thug, often illiterate and an inhabitant of a downtrodden ghetto that hangs around in &quot;gangs&quot;; largely associated with the African-American subculture. These try-hard wanna be &quot;gangstas&quot; attempt to make themselves appear like real criminals by graffiting buildings, smoking&#x2f;selling drugs and trying to looking all &quot;bad-ass and macho an&apos;-shit, yo&quot;. An utter degradation of what true gangsters represent (see below), and street wannabe &quot;gangsta&quot;-types don&apos;t hold a candle to what real gangsters are.<br /><br />2) The *real* gangsters are those behind organised crime; most notably the Mafia. Responsible for blackmarket trade, epsionage, organised beatings&#x2f;assassinations, etc. &quot;The Godfather&quot; portrays the archtype of true gangsters, showing the brutality of mob beatings, shootings, running rackets and abusing woman, alcohol and everything in between. The real gansters are *not* to be confused with the aforementioned definition, commonly used as it might be.","time":1444512726908},"slit":{"definition":"1- the vagina<br />     see also: gash<br />2- a woman (derrogatory)<br />     <br />see also: gash","time":1444512946525},"gash":{"definition":"A term for the female genitalia, implying that it looks like a hatchet wound.<br /><br />See: [alcove], [bat cave], [bear trap], [bearded clam], [bearded taco], [beaver], [bermuda triangle], [box], [bucket seat], [cake], [chuff box], [cockpit], [cooch], [coochie], [coochie-pop], [coose], [cooter], [cooze], [crack], [crawl space], [cum depository], [cum dumpster], [cuntcake], [cunt], [cunny], [donut], [dripping delta], [felted mound], [fillet-o-fish], [finger hut], [fish], [fish taco], [front bum], [fly catcher], [fuckhole], [garage], [gates of Heaven], [golden doorway], [Grand Canyon], [growler], [hair pie], [hatchet wound], [heaven&apos;s door], [hole], [honey cave], [honey pot], [hot box], [jaws of Hell], [lobster pot], [loins], [loose meat sandwich], [lotus], [love box], [love canal], [lower lips], [meat wallet], [muff], [nooch], [nook], [nookie], [parking spot], [peach], [pearly panty gates], [pocket], [poon], [poontang], [purse], [pussy], [quiff], [quim], [rat trap], [scratch], [sheath], [slash], [slit], [snapper], [snatch], [space], [split], [stench trench], [tampon socket], [temple], [thingy], [tool shed], [tuna], [tunnel], [twat], [undercut], [vagina], [vertical smile], [wishing well], [whisker box], [womb], [x], [yoni]","time":1444512967741},"beartrap":{"definition":"When performing 69 for a girl, the man sneezes thereby startling the girl who bites down on the defenseless wang as a reflex.","time":1444512983282},"bucketseat":{"definition":"Easy and comfortable to slide into.<br /><br /><br />See: [alcove], [bat cave], [bear trap], [bearded clam], [bearded taco], [beaver], [bermuda triangle], [box],  [cake], [chuff box], [cockpit], [cooch], [coochie], [coochie-pop], [coose], [cooter], [cooze], [crack], [crawl space], [cum depository], [cum dumpster], [cuntcake], [cunt], [cunny], [donut], [dripping delta], [felted mound], [fillet-o-fish], [finger hut], [fish], [fish taco], [front bum], [fly catcher], [fuckhole], [garage], [gash], [gates of Heaven], [golden doorway], [Grand Canyon], [growler], [hatchet wound], [heaven&apos;s door], [hole], [honey cave], [honey pot], [hot box], [jaws of Hell], [lobster pot], [loins], [loose meat sandwich], [lotus], [love box], [love canal], [lower lips], [meat wallet], [muff], [nooch], [nook], [nookie], [peach], [pearly panty gates], [pocket], [poon], [poontang], [purse], [pussy], [quiff], [quim], [rat trap], [scratch], [sheath], [slash], [slit], [snapper], [snatch], [space], [split], [stench trench], [tampon socket], [temple], [thingy], [tool shed], [tuna], [tunnel], [twat], [undercut], [vagina], [vertical smile], [wishing well], [whisker box], [womb], [x], [yoni]","time":1444513020616},"crack":{"definition":"As a rule of thumb, it is profoundly unwise to take crack-cocaine. The brain has evolved a truly vicious set of negative feedback mechanisms. Their functional effect is to stop us from being truly happy for long. Nature is cruelly parsimonious with pleasure. The initial short-lived euphoria of a reinforcer as powerful as crack will be followed by a &quot;crash&quot;. This involves anxiety, depression, irritability, extreme fatigue and possibly paranoia. Physical health may deteriorate. An intense craving for more cocaine develops. In heavy users, stereotyped compulsive and repetitive patterns of behaviour may occur. So may tactile hallucinations of insects crawling underneath the skin (&quot;formication&quot;). Severe depressive conditions may follow; agitated delirium; and also a syndrome sometimes known as toxic paranoid psychosis. The neural aftereffects of chronic cocaine use include changes in monoamine metabolites and uptake transporters. There is down-regulation of dopamine D2 receptors to compensate for their drug-induced overstimulation. Thus the brain&apos;s capacity to experience pleasure is diminished.","time":1444513028828},"batcave":{"definition":"A bat cave is a really disgusting vagina. a Vagina thats a bat cave could be considered really hairy,old,dry,wide,or a whores vagina. ","time":1444513054118},"beardedclam":{"definition":"Slang for hairy, and often fishy pussy.<br /><br /><br />See: [alcove], [bat cave], [bear trap], [bearded taco], [beaver], [bermuda triangle], [box], [bucket seat], [cake], [chuff box], [cockpit], [cooch], [coochie], [coochie-pop], [coose], [cooter], [cooze], [crack], [crawl space], [cum depository], [cum dumpster], [cuntcake], [cunt], [cunny], [donut], [dripping delta], [felted mound], [fillet-o-fish], [finger hut], [fish], [fish taco], [front bum], [fly catcher], [fuckhole], [garage], [gash], [gates of Heaven], [golden doorway], [Grand Canyon], [growler], [hatchet wound], [heaven&apos;s door], [hole], [honey cave], [honey pot], [hot box], [jaws of Hell], [lobster pot], [loins], [loose meat sandwich], [lotus], [love box], [love canal], [lower lips], [meat wallet], [muff], [nooch], [nook], [nookie], [peach], [pearly panty gates], [pocket], [poon], [poontang], [purse], [pussy], [quiff], [quim], [rat trap], [scratch], [sheath], [slash], [slit], [snapper], [snatch], [space], [split], [stench trench], [tampon socket], [temple], [thingy], [tool shed], [tuna], [tunnel], [twat], [undercut], [vagina], [vertical smile], [wishing well], [whisker box], [womb], [x], [yoni]","time":1444513092293},"alcove":{"definition":"Group of people from CTY LAN who appeared during 2001, and sat in the alcove of Dining Room 1.  Responsible for the through continuation of most Lancasterian traditions, such as bathrobe wearing on Thursdays.  Exiled from the Alcove in 2002 thanks to the Salad Bar Coup (the protest was broken up by RA&apos;s who insisted that we must sit in chairs in the cafeteria).  Became the Alcove in Exiled Squared in 2004 when the cafeteria shut down due to construction, and dining facilities were moved to the ASFC.  The &quot;status&quot; of this groups as either simply a group of firends, or an organized institution, is a never-ending debate.","time":1444513101105},"chuffbox":{"definition":"Nasty, hairy [pussy] that smells like [ass].  [Janet Reno] has one.  Don&apos;t ask.<br /><br /><br />See: [alcove], [bat cave], [bear trap], [bearded clam], [bearded taco], [beaver], [bermuda triangle], [box], [bucket seat], [cake], [cockpit], [cooch], [coochie], [coochie-pop], [coose], [cooter], [cooze], [crack], [crawl space], [cum depository], [cum dumpster], [cuntcake], [cunt], [cunny], [donut], [dripping delta], [felted mound], [fillet-o-fish], [finger hut], [fish], [fish taco], [front bum], [fly catcher], [fuckhole], [garage], [gash], [gates of Heaven], [golden doorway], [Grand Canyon], [growler], [hatchet wound], [heaven&apos;s door], [hole], [honey cave], [honey pot], [hot box], [jaws of Hell], [lobster pot], [loins], [loose meat sandwich], [lotus], [love box], [love canal], [lower lips], [meat wallet], [muff], [nooch], [nook], [nookie], [peach], [pearly panty gates], [pocket], [poon], [poontang], [purse], [pussy], [quiff], [quim], [rat trap], [scratch], [sheath], [slash], [slit], [snapper], [snatch], [space], [split], [stench trench], [tampon socket], [temple], [thingy], [tool shed], [tuna], [tunnel], [twat], [undercut], [vagina], [vertical smile], [wishing well], [whisker box], [womb], [x], [yoni]","time":1444513124190},"cockpit":{"definition":"Area in an aircraft that holds pilot and co-pilot crew. Driver&apos;s seat in a race car.<br /><br />Slang: Vagina","time":1444513142805},"coose":{"definition":"noun.<br />Of the female gender.  The ultimate insult to that sex.  To be used in rare ocasions, when even the word cunt, bitch, or whore can&apos;t describe her.<br /><br />[cunt] [bitch] [whore]","time":1444513155946},"slut":{"definition":"a woman with the morals of a man","time":1444513178705},"sham":{"definition":"Irish slag<br />A resident of Ballyshannon, County Donegal, Ireland.<br />Also, a word frequently used by residents of above town, usually meaning the same as American term &quot;dude&quot;.","time":1444513229832},"noob":{"definition":"A. INTRO<br />I. What is this?<br />II. Defining &apos;Noob&apos;<br /><br />B. COMMON NOOB CHARACTERISTICS<br />I. Noobish<br />II. Where to find noobs<br />III. Behavior of noobs<br />IV. Noob religion<br />V. More about noob habitats<br /><br />C. AVOIDING NOOBS<br />I. Make sure you aren&apos;t one<br />II. Major noob avoiding strategies<br /><br />------------------------<br /><br />A. INTRO<br /><br />I. What is this?<br />This guide is designed to give you a better understanding of what a noob is, how to recognize them, some details about them, and how to avoid or get rid of them. It mostly applies to online forums, which are the main targets of migrating noobs.<br /><br />II. Defining &apos;Noob&apos;<br />Contrary to the belief of many, a noob&#x2f;n00b and a [newbie]&#x2f;[newb] are not the same thing. [Newbs] are those who are new to some task* and are very beginner at it, possibly a little overconfident about it, but they are willing to learn and fix their errors to move out of that stage. [n00bs], on the other hand, know little and have no will to learn any more. They expect people to do the work for them and then expect to get praised about it, and make up a unique species of their own. It is the latter we will study in this guide so that the reader is prepared to encounter them in the wild if needed.<br /><br />Noobs are often referred to as [n00bs] as a sign of disrespect toward them, and it&apos;s often hella funny, but I will refer to them as noobs during this reading.<br /><br />* Usually the topic at hand on an internet forum.<br /><br />B. COMMON NOOB CHARACTERISTICS<br /><br />I. Noobish<br />Often, but not always, noobs will attempt to communicate in their own primitive language, known as &quot;n00bish.&quot; It is a variant of the hacker language that exposes them as having little intelligence or will to learn. Here is an example of some noobish. Do not attempt to comprehend it: it cannot be discerned without professionals at hand.<br /><br />stFU &#x2f;..&#x2f;..an, i r teh r0xx0rz liek emin3m, u cna go tO EHLL OR ATLE4St help m3 wit hthIS!!111!!!!!!!1~~1!!``!! LOLLOLOLLOLOLlOoLLOlollLLl u n00b<br /><br />Although you may find this unbelievably funny and&#x2f;or annoying, it is best to restrain yourself and keep from talking back to them, as they are very territorial and easily angered. This will result in their attempted verbal abuse of you, possibly backed up by other noobs, because they work in packs when doing offensive tasks. It is not an easy task to learn this language because our intelligent accent will keep it from sounding quite right when spoken. You can write some simple noobish of your own, however, by slamming your face into your keyboard repeatedly.<br /><br />II. Where to find n00bs<br />On the internet, n00bs make their colonies on forums. They migrate in waves, usually on weekends, and proceed to clog up bandwidth with stupid questions and sometimes even stupid answers. If you happen to be unfortunate enough to be on a board large enough to attract migrating noobs, there will hopefully be authority in charge who is smart enough to take extermination measures before they can make nests and larger colonies. [THE BANNER HAMMER] is one form of authority.<br /><br />Larger colonies can result in the mutation of some into spammers. Not commercial spammers, but pointless spammers. A noob can become one of these at any point, but the larger the amount of noobs, the more chance pointless spammers will appear.<br /><br />Off the internet, noobs appear anywhere the focus is on learning or discussing something specific.<br /><br />III. Behavior of noobs<br />Since noobs are basically ignorant bastards, they have a lot in common. The most often seen characteristic is their fluency in noobish, which is why it got its own section. They will also be very self confident as if they were the absolute best at what they are in fact the worst at. Also, they are quite agressive and self-centered, and tend to laugh a lot using many L&apos;s and O&apos;s in rapid sucession (the noobish word for laughing like an ultimate retard).<br /><br />It is their instinct to assemble in packs for defense, and they often attempt to organize packs that they call teams. Unfortunately for them, teams usually result in a total loss of communication and they can often begin to fight amongst each other. These teams are quite unlike those formed by non-noobs.<br /><br />Noobs have difficulty reading English and cannot comprehend the idea of authority.<br /><br />Therefore, they have an all-out disregard for rules, basic or not. A good way to identify a noob (bad) vs. a [newb] (good) is to tell them (or have an authority tell them) which rule they are unknowingly breaking. If they respond with an apology and fix it, they are probably not a noob. If they react by insulting everything around them in rapid noobish and causing general mayhem, it is because they are a noob and have had a small seizure due to their inability to understand what is happening.<br /><br />IV. Noob Religion<br />Noobs follow a variation of the [1337] (sometimes [7331]) religion, in which they worship the number in odd rituals and put altars in their forum avatars and signatures. They often call themselves [1337], which experts say is somewhat like calling themselves godly in a human language. It&apos;s best to not interfere with their religious fantasies and practices because that can lead to a noob uprising, which can turn a forum to mush in less than a week.<br /><br />V. More about noob habitats<br />Noobs often attempt to maintain their own web pages. Some common features of these lairs are a terrible lack of content, background music, lots of pointless animated gifs, and pages that say some variation of &apos;tHEir isnothinG H34r yEtt LOLLOLOL!111!1!!~~~!!`! 13371337&apos;, which means &apos;Nothing here yet&apos; in noobish.<br /><br />They will also have large, seemingly infinite marquees of 88X31 affiliate buttons replaced with red X&apos;s scattered here and there, and possibly a hit counter showing a number less than 100. These habitats are numerous but fairly easy to avoid because only noobs link to them. So if you can identify a noob, don&apos;t go to its homepage. Simple as that.<br /><br />C. AVOIDING NOOBS<br /><br />I. Make sure you aren&apos;t one<br />Note: This section is bilingual so even noobs can make the discovery if they haven&apos;t already.<br /><br />English (T4lk)-<br /><br />Read the above parts of this guide carefully. If you find yourself unable to comprehend any of it but are instead beginning to think about how great you are and how awesome &apos;teh 1337&apos; is, you might want to take one of the many available online quizzes to check your noobancy.<br /><br />Noobish (133713371337)- Liek, u gott4 re3D teh gudieCAREFUl1y and tehn OMG LIEK I AM R0XX0RZ ya anD ify 0u turn into teh reTARDED u gota go 2 MY WEBP4GE LOLLOLOL!!111~11 ad check 4 warez n stfuu. if u r a n00b go2HELL LOLLOLOlROFLMFAO11!!!11!!!! a&#x2f;s&#x2f;l pos gtg n00b suxx0rz ur b0xx0rz OLOOOLOLLLL HELP HELP HELP 1337133713371337<br /><br />II. Major noob avoiding strategies<br />The main factor in attracting migrating herds of noobs is a large, active forum. If you find one of these, look to see if it has the management to avoid noob infestation. If not, look for a small or mid-sized forum that covers the same topic so you can enjoy your time there before the noobs find it.<br /><br />Another way to keep noobs from interfering with your life is to become part of the authority on one of these forums. But that&apos;s often hard to do so you&apos;ll probably be better off avoiding larger forums first off. If you do manage to become part of the authority, however, take full advantage of it and establish extermination policies so that normal people can have a nice time without noob infestations.","time":1444513240178},"trash":{"definition":"a term for a person who is dirty and stupid.  often the same as whitetrash, but any race can be trash","time":1444513253668},"garbage":{"definition":"Something that is weak, useless, not good quality. Similar to wack.","time":1444513261751},"wack":{"definition":"1) Lame, sorry ass, aint even legit<br /><br />2) To Jerk off","time":1444513266371},"erica":{"definition":"The most [beautiful] queens to ever walk the face of this earth...women named erica are [fierce] by nature and generally quite [sassy]. ","time":1444513312799},"bit":{"definition":"baby tits","time":1444513321322},"crazyclown":{"definition":"A crazy clown is when you are either boning a girl doggystyle or analy (or a male analy...ew)and then you ejaculate on their back....and when they turn around, you make a warm, tasty, sweaty fart right on their nose","time":1444513329240},"sakis":{"definition":"White trash, ignorant translation of sake, a Japanese acholic beverage made from fermented rice.","time":1444513392930},"elite":{"definition":"High quality, upper class, superior, fine, above average, great, wonderful, sinfully good, not an [asshat], skillful, wonderful, wizzunderful","time":1444513396996},"titania":{"definition":"A person who always has ops in the channel you are in and will always ban you for unjust reasons because he is &quot;cooler&quot; than you. He sucks at NS too.","time":1444513403088},"myass":{"definition":"Product of an owl and a bungee cord.  (See Kung Pow for reference)","time":1444513418319},"kissmyass":{"definition":"1) the act of putting ones orifice (specifically the mouth) up against the crack of the person you love. This is usually referred to german bondage porn.<br />2) An alternate explanation is usually a sarcastic put down to anyone hoping for something.","time":1444513458741},"richass":{"definition":"A person who is rich in money, is selfish with their money, and is conceded with their money. ","time":1444513487962},"lickass":{"definition":"1. When you want to get the last word in a conversation, you say &quot;LICKASS!!,&quot; and proceed to run (or logoff IM), so you cannot hear them talk again (or so they cant type anything back).  2. The phrase Loc Dogg says, when he becomes a comedian, at the end of [Don&apos;t Be Menace to South Central While Drinking Your Juice In the Hood].","time":1444513490050},"lickmyass":{"definition":"A song made by the rapper Papa Smurf.  The flash cartoon The Smurfs: The Lost Episode (with the Lick My Ass music) is also popular on the albinoblacksheep website.","time":1444513495308},"dafuq":{"definition":"[what the fuck] , but in a more confused manner","time":1444513497910},"anaconda":{"definition":"A large black penis, named after the anaconda, a large black snake from the Amazon.","time":1444513693406},"prise":{"definition":"Pries; look into","time":1444513895374},"pen15":{"definition":"An old grade school prank. You&apos;d write Pen 14 on your hand and walk up to an unsuspecting schoolmate and ask him if he wanted to join telling him he could be Pen 15. You&apos;d then write Pen 15 on his hand, and everyone would laugh at him.","time":1444513921899},"fasfa":{"definition":"Better then awesome.","time":1444513986807},"fafsa":{"definition":"the paper equivalent of a Rubik&apos;s Cube","time":1444514022675},"gg":{"definition":"&quot;Good Game&quot;<br /><br />1. A polite remark uttered after the end of a round, game, or other measured interval to indicate that a match was fair and enjoyable. Usually uttered collectively by the occupants of a game server. The opposite of [word]BG[&#x2f;word]<br /><br />2. A condescending remark, often uttered by somebody who does not know meaning 1, and is simply repeating what others have told them.","time":1444514187638},"bg":{"definition":"Bad Game. Typed in after someone plays a poor game, most commonly used in online multiplayer First Person shooters.<br />see also: [gg], [fg]","time":1444514216745},"fg":{"definition":"Fucking Genius. A title awarded to those whom are intelligent and wish to place emphasis on their natural aptitude in matters of the mind.","time":1444514222947},"e.e":{"definition":"A chat face used for feelings like disgusted, wincing, and even sometimes a happy grin. Meant to look like a face with squinted eyes, so however and whenever you would do that. An apostrophe is sometimes used for apprehension&#x2f;nervousness. (e.e&apos;)","time":1444515258060},"superporn":{"definition":"A normally unreachable level of porn, often accessed by drinking gratuitous amounts of mountain dew. <br /><br />","time":1444515916452},"willis":{"definition":"A well respected person or family (if last name) that is rather intelligent and kind. A person who is not prejudice, &apos;ghetto&apos; or untrustworthy. They show examples of leadership integrity responsibility and dedication. They are simply a true Willis.","time":1444516022458},"wdym":{"definition":"Whatever do you mean?","time":1444516492374},"dwai":{"definition":"Abbreviation for Dont Worry About It. It is actually pronounced D-waI or D.Y this is because of the i at the end. Anyone who pronounces it Dway is a troll. This short form version is also good for confusing this crap outta people.","time":1444516776291},"fapattack":{"definition":"The sudden, uncontrollable, and spontaneous urge to fap (masturbate) - usually furiously because time is of the essence (a quickie).","time":1444516957829},"carry":{"definition":"to insult, begin to insult","time":1444517145181},"karry":{"definition":"the best person anyone could possibly in their entire life. Everyone loves Karry, She is nice and kind. Bitches, you all know you love her.","time":1444517153018},"wym":{"definition":"(Phrase) Meaning &quot;I&apos;m too lazy to type out &apos;what you mean?&apos;&quot;","time":1444517263573},"conservatory":{"definition":"Where musicians attend college if they are unable to be accepted at a university. Rejection of musicians by universities is most often based on low test scores and grades, poor English skills and most commonly, general lack of intelligence. Prominent examples include the Juilliard School in New York City, the New England Conservatory in Boston, the Curtis Institute in Philadelphia, and the Peabody Conservatory in Baltimore.","time":1444517812305},"bae":{"definition":"Bæ&#x2f;bae is a Danish word for poop. Also used by people on the internet who think it means baby, sweetie etc.","time":1444517919846},"dick":{"definition":"1.The male genitals<br />2.An abrasive man<br />3.Short-form for &quot;Richard&quot;<br />","time":1444517999358},"fat":{"definition":"According to Hollywood, What you are if you are a female weighing over 100 lbs.","time":1444518012462},"pineapple":{"definition":"what the fuck are you looking at the definition of pineapples for you stupid fuck?","time":1444518031176},"banana":{"definition":"Its a fucking fruit for god sake. Who the fuck DOESN&apos;T know what a banana is?! FUCK! A STARVING KID IN AFRICA KNOWS WHAT A BANANA IS! HE FUCKING FANTASIZES ABOUT ONE EVERY DAY!","time":1444518048246},"apples":{"definition":"The alternative to the orange.","time":1444518055636},"orange":{"definition":"The colour which vain assholes turn after a session in the tanning salon; Often confused with Hepatitis.","time":1444518063805},"dapper":{"definition":"A compliment made to someone who looks incredibly smart, sexy and stylish","time":1444518066241},"kiwi":{"definition":"A game played in an enclosed court by two players who strike a ball with raquets. aka the greatest sport ever.","time":1444518079161},"red":{"definition":"Flavor of kool-aid to a black person.","time":1444518242316},"yellow":{"definition":"[Yellow] is the colour that divides edible [snow] from non-edible snow","time":1444518269326},"green":{"definition":"yes... it is most definitely referring to the marijuana... and also, upon occassion, any substance with similar uses.  too, properly, of course, it is a golfing term, but that;s really not very much fun, now is it?","time":1444518280003},"blue":{"definition":"The hue of the portion of the visible spectrum lying between green and indigo, evoked in a human observer by radiant energy with wavelengths of approximately 420 to 490 nanometers.","time":1444518290956},"purple":{"definition":"Extremely potent marijuana, specifically marijuana buds that have a purple hue to them.  Also accompanied by a fragant, usually fruity smell and mad perma-grin.","time":1444518319783},"vegetable":{"definition":"1. A plant that you eat, usually green<br />2. A person who is brain-dead.","time":1444518576434},"bobobo":{"definition":"The coolest animehero ever!","time":1444518585035},"psh":{"definition":"An expression used when something is highly unlikely or that the speaker disagrees with.","time":1444518586339},"bobo":{"definition":"A Korean dude who muds like a maniac and farts uncontrollably.","time":1444518588558},"wynaut":{"definition":"1. a species of Pokémon that evolves into wobbuffet.<br />2. A slang term use to say why not.","time":1444518687294},"slang":{"definition":"the only reason Urbandictionary.com exists","time":1444518707258},"yawn":{"definition":"The single most contagious thing in the known universe. Can be passed from person to person by the mystery of F-Gas.","time":1444519523165},"wut":{"definition":"1. An expression similar in meaning to the word &quot;What&quot;<br /><br />2. A &quot;leet&quot; word for what<br /><br />3. A remark most commonly used after a party has told a ridiculous&#x2f;unbelievable story. after a pause the listener responds &quot;wut&quot; or &quot;lol wut&quot; ","time":1444520579629},"ague":{"definition":"For those of us who like to dwell in the 17th century, a nice theatrical way to describe your condition when you have the flu","time":1444521172495},"mystle":{"definition":"Noun.  A unique female name.  A petite woman, short and having a small, trim figure; diminutive.  <br /><br />Mystle is a loyal friend to those she finds deserving.  She is also faithful and honest to those she loves.<br />","time":1444521198070},"mute":{"definition":"To quickly hit the button which mutes the ring and&#x2f;or vibration on your cell.  Used when your phone goes off when it should not.  Also, a term used when a person you do not wish to speak to calls and you quickly make the phone stop ringing.","time":1444522667606},"irony":{"definition":"One of the most misused words in the entire English language.<br /><br />There are several types of irony.<br /><br />Socratic irony - When someone pretends to be naive about a certain subject, and uses his questions about it to point out a flaw in the established belief.  This is often used on the TV show South Park, where the children often ask questions about a situation until the folly in a parent&apos;s decision becomes clear.<br /><br />Sarcasm - Understatement, mocking overstatement, or heavy-handed irony (stating the flat opposite of the truth) where both parties are aware of the difference between what&apos;s said and what&apos;s actually happening.<br /><br />Situational Irony - The irony that most people think of.  A difference between what you expect to happen (in a story, for example) and what actually happens.  Rain on your wedding day would be a sort-of example, because a wedding day is generally expected to be a perfect, happy day.  The good advice you didn&apos;t take, however, would NOT be irony, because that has nothing to do with what is expected and what isn&apos;t expected.  A traffic jam when you&apos;re already late wouldn&apos;t be irony either; there&apos;s no automatic expectation that traffic will be fine, just because you happen to be late.<br /><br />Irony of Fate - The concept that the Gods, Fates, etc. are toying with humans for amusement by using irony.  Beethoven&apos;s loss of hearing is a famous example; one would expect a composer to be able to hear his compositions, but fate denied him that ability.<br /><br />Tragic (Dramatic) Irony - When the audience knows something that some of the characters don&apos;t know in a play&#x2f;movie&#x2f;novel&#x2f;whatever. For example, when the horror flick psycho is in the house and the homeowner just goes in without suspecting anything.","time":1444522770517},"pede":{"definition":"French slang for homosexual. Comes from the word Pederaste (a man who has sexual relations with a boy), and is considered derogatory.","time":1444522982730},"dell":{"definition":"A term to describe being ripped off.","time":1444523351700},"internet":{"definition":"A vast array of [word]pornography[&#x2f;word] and advertisements.","time":1444523429509},"ditto":{"definition":"The same","time":1444523469194},"fleek":{"definition":"on point","time":1444523476686},"onpoint":{"definition":"to be perfect; to satisfy; whatever it was, it met the person&apos;s standards","time":1444523482328},"squabble":{"definition":"To duke it out","time":1444523534776},"latter":{"definition":"The latter commonly used in English Literature , when used in a sentence means, the 2nd of the two words.                ","time":1444523564572},"nw":{"definition":"Abbreviation for No Worries.","time":1444523658825},"pk":{"definition":"Means &quot;Player Kill&quot; Which is used most often for online games such as MMORPG&apos;s.","time":1444523841818},"confront":{"definition":"Another more polite way of saying to fuking bring it","time":1444523918895},"chiraq":{"definition":"word to describe chicago because of its violent history and crime rates one of americas mos dangerous cities","time":1444524147803},"dip":{"definition":"to leave abruptly. To get the hell out of somewhere.","time":1444524324601},"poor":{"definition":"One who has no money.<br /><br />Charles Baker.","time":1444524437895},"pokerus":{"definition":"A horrible disease in the Pokemon games, probably the only cool sickness ever. Pokerus spreads incredibly easy and fast and it can go from one Pokemon to all Pokemon in your party. Also makes them twice as strong.","time":1444524491598},"implemented":{"definition":"When something is &apos;put into action&apos; or &apos;working&apos;. Usually used for machines.","time":1444524528396},"ez":{"definition":"another way of spelling Easy.<br />meaning take it easy, usually used for a farewell","time":1444524542112},"aids":{"definition":"A very dangerous disease that currently can&apos;t be cured. It will destroy your immune system until even a cold can kill you. <br /><br />Contrary to what most of these homophobic twelve-year-olds added as the definition, AIDS can be aquired through any form of sex with a carrier. In fact, you don&apos;t even have to have sex. Just sharing blood or drinking breastmilk (This applies to everyone, not just babies) can give you AIDS.","time":1444524550077},"std":{"definition":"STD - stands for Sexualy Transmited Disease. The most commonly known is HIV&#x2f;AIDS. To say the least you don&apos;t want an STD.","time":1444524589019},"heatstroke":{"definition":"a state when a person is experiencing high temperature around him and he feels very very hot","time":1444524602336},"mega":{"definition":"v. very, really, extremely.  Sometimes used for more emphasis.","time":1444524773537},"colossal":{"definition":"1. Very large: Unusually or impressively large or huge.<br /><br />2. Very great or impressive.","time":1444524776783},"cameltoe":{"definition":"When her pants are so tight you can read her lips!","time":1444524892954},"no":{"definition":"The word that makes sex rape.","time":1444524904055},"malt":{"definition":"A word for girl or woman, usually fit in the eyes of chavs.","time":1444524934138},"maltliquor":{"definition":"Cheap, overly strong beer, often found in poor neighborhoods in 40 oz bottles. Can occasionally be good; usually isn&apos;t.","time":1444524945250},"savage":{"definition":"Bad ass.  Cool. Violent.","time":1444524966545},"starbucks":{"definition":"Where you&apos;re going to end up if you get a master&apos;s degree in the following:<br /><br />1) Art History<br />2) Fine Arts<br />3) Philosophy<br />4) Literature","time":1444525012019},"ebay":{"definition":"a place where you can buy a 30 dollar toaster for a dollar and pay 29$ shipping","time":1444525037617},"banhammer":{"definition":"1 - A symbol of violence and imaginary power over others, used by peniley-challenged jerks, at websites, to make themselves feel better about being so inadequate, and unliked by anybody  2 - a symbol used by bossy creeps at websites, to try and make you &quot;fear their power&quot; you&apos;re supposed to imagine they have...but really they have no power..or friends..because they are just assholes.  3 - a picture that should be thrust as far up the offending admin or mods nazi ass as possible, except they&apos;d probably like it","time":1444525060763},"24/7":{"definition":"1) Refering to 24 hours, 7 days<br />2) Often used as a short form to explain that a store, or shop is open all the time<br />3) Used as slang for something that happens often, or constantly","time":1444525072231},"toe":{"definition":"vagina (short for camel toe)","time":1444525935702},"cancerous":{"definition":"A term used for something that is so [fucked up], that it is figurably able of giving you cancer.  Can be used as both an adverb and adjective.","time":1444526263520},"xzibit":{"definition":"Feels the need to cover the world in flat-screen HDTV panels.","time":1444526283116},"autocorrect":{"definition":"A feature built into many modern phones, which automatically changes unrecognized words to their closest matches, if any exist. Of course, on occasion it will select the wrong word, usually changing the original meaning of the sentence completely.","time":1444526646358},"pdf":{"definition":"Portable Document Format.<br />Makes documents portable as long as you install the necessary software. In other words, it is exactly the same as any other document format. Except it is more likely to bring your system to a grinding halt.","time":1444526662421},"twain":{"definition":"Technical term realting to devices such as scanners attached to computers.<br />TWAIN stands for <br />Technology Without An Interesting Name.<br />No shit.","time":1444526895091},"nutd":{"definition":"To smash a donut in someone&apos;s face. A major burn, especially if caught on film.","time":1444527219652},"nuts":{"definition":"v. The act of ejaculation.<br /><br />n. Semen.","time":1444527229668},"jug":{"definition":"A woman&apos;s breasts. Especially when large and shapely.","time":1444527305741},"milk":{"definition":"The most tasty shit EVER.","time":1444527315580},"water":{"definition":"The 4th element required to summon Captain Planet","time":1444527323554},"nootnoot":{"definition":"[Pingu]&apos;s main method of communication.","time":1444527337690},"charen":{"definition":"1) A Goddess of one&apos;s school.<br />2) Some one with exreme looks.","time":1444527356757},"dog":{"definition":"Not a [cat].<br /><br />Gotta love Blackadder.<br />","time":1444527372227},"dickbutt":{"definition":"think of the weirdest thing you can think of... dickbutt. there is nothing dirtier than a dickbutt except a dusty butthole.","time":1444527506273},"rickroll":{"definition":"To post a misleading link with a subject that promises to be exciting or interesting, e.g. &quot;World of Starcraft in-game footage!&quot; or &quot;Paris Hilton blows Busta Rhymes&apos; dick&quot; but actually turns out to be the video for Rick Astley&apos;s debut single, &quot;Never Gonna Give You Up&quot;.  A variant on the [duckroll].  Allegedly hilarious.","time":1444527523352},"commission":{"definition":"<br />1) A fee paid to an agent for providing a service, especially a percentage of the total amount of business transacted.<br /><br />2) A job or task given to a person or a group, especially an order to produce a particular product or piece of work.<br /><br />3) A group of people authorized to carry out a duty.<br /><br />4) The committing of something, especially a crime or other offense.<br />","time":1444528162450},"gawd":{"definition":"Like swearing God! But with More Drastic Emphasis","time":1444528343411},",":{"definition":"The comma is a useful device for breaking up sentences into smaller parts sadly lacking from lots of the stuff you see on the internet due to the shocking standards of education in the modern world kids eh?","time":1444528391068},"!":{"definition":"In the mathematical sense, it means factorial.  The definition of factorial is as follows:  n*(n-1)*(n-2)*(n-3)*(n-...), (n-1) &gt; 0.","time":1444528420481},";":{"definition":"Idiots who don&apos;t know how to use the semi-colon. A semi-colon, &quot; ; &quot;, is used to connect two main clauses.","time":1444528428033},":":{"definition":"A colon mark<br />(1) A colon is used when telling time.<br />(2) Use a colon when there are two sentences and the second sentence explains the first. (Replaces the word &quot;because&quot;)<br />(3) Colons can be used to list objects.<br />(4) Use colons when introducing a quote or formal statement.<br />","time":1444528430467},"-":{"definition":"Used in IM conversations to indicate the presence of a letter in a typed word that does not belong and should be omitted. This is a quick alternative to using the full correction, which is preceded by a [*].<br /><br />Often, the word that the erroneous letter appeared in is not indicated by the typer, leaving a bit of guesswork for the reader. However &apos;-&apos; should generally be limited for use only where minor typographical errors have occured to avoid this potential confusion.","time":1444528439942},"/":{"definition":"character appended to the beginning of a word to denote that anything preceeding this word is now complete or terminated. Taken from hypertext language tag conventions. <br /><br />No known pronounciation when used in this context.","time":1444528442289},"fuckyou":{"definition":"An expression of contempt.<br /><br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1444528700324},"howareyou":{"definition":"The lamest rhetorical question in the English language. Requires the answer of &apos;Fine&apos; no matter how you feel or why you are going to have a conversation.  An exercise for the  lips and tongue. ","time":1444528758764},"ot":{"definition":"Short for &quot;alright&quot;. Used in place of &quot;alright&quot; or to quickly end a conversation. Invented by the Derkas of the 918 (Tulsa, OK area).  When used in place for &quot;alright&quot; after a command, it is the speaker&apos;s choice to fullfill the command.","time":1444528812553},"sorry":{"definition":"A word commonly used to make a yelling person shut the fuck up.","time":1444528833697},"alice":{"definition":"Alice is the definition to &quot;Little Miss Sunshine&quot; because that&apos;s the type of person she is! She is a truly lovely girl who everyone would be truly blessed to have in their lives because she is definitely that beautiful rainbow on a cloudy day. Alice is the type of person who can ALWAYS put a smile on your face :D","time":1444528859045},"fuckthat":{"definition":"A definite and unmistakeable &apos;No&apos;","time":1444528917559},"paradox":{"definition":"a statement that appears to be self-contradictory but may actually be true","time":1444528933681},"funny":{"definition":"When someone else gets hurt.","time":1444528937204},"fuckoff":{"definition":"1. A message used by the hand that is a direct insult to another person.<br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1444528944565},"jelly":{"definition":"Being jealous, or hating","time":1444528950807},"noonecares":{"definition":"Talking about something in which the intended audience does not give a flying fuck about.","time":1444529005895},"puns":{"definition":"A play on words, usually for a comic reception.","time":1444529013167},"play":{"definition":"Anything to do with sexual relations: fooling around, making out, oral sex or having intercourse.","time":1444529025509},"rip":{"definition":"rest in peace","time":1444529040974},"narcissist":{"definition":"1.Excessive love or admiration of oneself.<br />2.A psychological condition characterized by self-preoccupation, lack of empathy, and unconscious deficits in self-esteem. <br />3.Erotic pleasure derived from contemplation or admiration of one&apos;s own body or self, especially as a fixation on or a regression to an infantile stage of development.","time":1444529080946},"warlock":{"definition":"A powerful summoner who used to be a mage, then decided not to suck.","time":1444529082940},"you":{"definition":"Not me","time":1444529107327},"maddie":{"definition":"A really funny girl who is very sexy and smart, she is always flirtatious and brilliant at sex!","time":1444529117005},"gryphon":{"definition":"a mythical creature that has the fore of an avian, the hind of a mammal, four legs, a beak, usually is winged, and may have a the tail of a serpant and&#x2f;or the ears of a wild donkey. <br /><br />most commonly, it is half bird of prey and half lion, altho such variations as half raven half wolf gryphons have been seen as well as gryphons with the hindquarters of a horse (also called hippogryphs&#x2f;hippogriffs).<br /><br />the senmurv is a being that combines mamalian and avian that is similar to a gryphon, but unlike a gryphon the forehalf is canine, the hind end is avian, and it only has two legs.","time":1444529134832},"gryph":{"definition":"A person who commits a random act of stupidity and hope.","time":1444529138268},"josh":{"definition":"He is a fun loving guy really funny and can make anyone laugh.He is very quiet at first and seems shy but when you get to know him you will fall in love.He has very good style and always looks handsome.He also always smells really good :) ","time":1444529138387},"carnie":{"definition":"Carnival workers.  Good, hardworking, trustworthy, honest, good-for-nothing, unreliable, foul-smelling vagrants who work at our nation&apos;s (USA) carnivals.<br /><br />Do not let these people into your homes.","time":1444529201135},"discord":{"definition":"A lack of harmony among ponies.","time":1444529226347},"stopit":{"definition":"a phrase used to alert someone to keep the compliments coming.","time":1444529234445},"bacon":{"definition":"n. Delicious strips of juicy, pork heaven. Served often at breakfast with eggs, but perfectly good served alone and at any time of day.","time":1444529237138},"princess":{"definition":"A girl that has been pampered, sheltered and spoiled her whole life to the extent that she has no friggin idea about the real world.","time":1444529258816},"glaceon":{"definition":"Glaceon is the best out of all the eeveelutions with its ice powers. U can be walking on the beach and with one look it can freeze u","time":1444529272198},"power":{"definition":"Power is most simply defined in Physics as the rate at which work is done.  More specifically, it&apos;s the ratio of work to time.  See below for an interesting usage of &quot;power.&quot;","time":1444529288680},"andrew":{"definition":"Ultra cool, Usually hot or at least sort of cute. Awesome sense of style, music, and humor. Sexy, awesome kisser","time":1444529310197},"king":{"definition":"Someone who doesn&apos;t have shit all over them.","time":1444529314374},"shuckle":{"definition":"The Mold Pokemon. Shuckle has the <br />highest defense and special defense stat of any Pokemon(but the lowest attack and speed stats of any pokemon).","time":1444529327637},"amy":{"definition":"to take, hold, or steal your heart. a person who is a soulmate. a good lover.","time":1444529339111},"leater":{"definition":"A person who lies and cheats excessively","time":1444529345882},"infection":{"definition":"There are various cheats that will &quot;infect&quot; your system for a time as long as you don&apos;t go back to the dashboard or shut off the system. They can do things like aim-bots or super speed running. These are activated when you are killed by someone else who is already infected. Some can be fun, but like all cheats, some make the game unbearable and almost impossible to play like all shots are head-shots or Invincibility. These &quot;infections&quot; are most prominent in all the CoD&apos;s but have become less popular due to Activision actually doing something about it.","time":1444529364102},"ou":{"definition":"The University of Oklahoma, located in Norman, OK.  While most people think that all OU has going for it is its football team, it&apos;s actually a very reputable school.  Has the best meteorology program in the country (and quite possibly the world) as well as a very well respected engineering program.  Also, OU is the only college in the country to have an online information network containing old tests, job opportunities, and many other features.  Finally, it is one of the nicest looking campuses you&apos;ll ever see.  While OU and UT have a very large rivalry, I see no point to it.","time":1444529390265},"playa":{"definition":"A person who is [competitive] and [gregarious] by nature. <br /><br />The skill of a playa is measured by the extent of his or her &quot;[game].&quot; The more &quot;[game]&quot; a playa has, the more [respect] they command in their [community]. <br /><br />A person who has enough [game] (and hence, enough [respect]) can do whatever they want, dress however awful (or tacky) they want, say whatever crazy things they want to say, and still win the adoration of others. Often these skills are used to earn sexual or material favors, although not by necessity.<br /><br />Playas are mostly motivated by the ego drive that comes with [self expression] and [self manifestation] for its own ends. In many ways, playas are [trend-setters] rather than trend-followers. <br /><br />[Game recognizes game], and a true playa will always give respect to a fellow playa when it is due. People who ignore (read: fail to notice), criticize, or alienate themselves from a playa without just cause is referred to as a &quot;[playa hater].&quot; <br />","time":1444529397168},"dw":{"definition":"don&apos;t worry","time":1444529440900},"smoothie":{"definition":"A smoothie, a common American beverage in which the preparer integrates various fruit and dairy products, has become the de facto staple of cuisine in various Disney Channel and Nickelodeon television series.  What ambrosia comprised to the residents of mythical Olympus, or manna constituted for the Hebrews in the ancient text of Exodus, the smoothie has become to the modern Disney Channel Original Star.<br /><br />As a general rule, any character in a Disney Channel or Nickelodeon series must engage in one of the following activities: (a) partake of smoothies on a regular basis; (b) patronize smoothie establishments repeatedly, whether or not actually partaking thereof; (c) either serve as the founder of a smoothie establishment or possess a parent who owns or operates a smoothie establishment; or (d) profess love of the smoothie on a regular basis, whether or not actually consuming such during filming.  Though no character has actually evinced the mettle required to do so, expressing distaste or even indifference towards the smoothie would comprise the utmost blasphemy against all that these two esteemed television stations hold dear.","time":1444529533834},"die":{"definition":"the process of no longer being alive.","time":1444529539271},"ffs":{"definition":"Acronym for, for fuck&apos;s sake.","time":1444529585165},"immortal":{"definition":"A very great Black Metal band. Formed in 1990 in Norway by Abbath (Olve Eikemo). Lyrical themes include: Winter, Grimness, Darkness, Blashyrkh. Recently Disbanded. Long live the kings.<br /><br />Last cd: Sons of Northern Darkness","time":1444529623137},"heartless":{"definition":"A person that doesn&apos;t care what they do to hurt someone.","time":1444529658455},"league":{"definition":"Used when gamers are too fatigued from playing League of Legends to type &quot;league of legends&quot; so they abbreviate it to just league.","time":1444529663437},"leagueoflegends":{"definition":"A gaming site where trolls get trolled.","time":1444529679933},"kongregate":{"definition":"an awesome flash game website where you can level up, chat with freinds, collect badges and more. They are working on thier own online card game collected from weekly game events.","time":1444529686346},"friv":{"definition":"A gaming site dedicated to a page of mini games ranging in type, style and content. Generally go on when someone is very bored and has nothing else to do.","time":1444529720716},"callofduty":{"definition":"An amazing way to keep your virginity","time":1444529740980},"agar.io":{"definition":"The new game that all the kids play on the school laptops when they are supposed to be taking notes or finishing a test. Like it&apos;s predecessors Minecraft and Powdergame, it is the new most popular game played as a pass time in public schools. The game just came out this year, and didn&apos;t gain much popularity until many famous youtubers such as PewDiePie took notice to it and recorded let&apos;s play&apos;s. Since then, it exploded and is currently one of the most active MMOs as of right now.","time":1444529763254},"tongan":{"definition":"The people who originate from the Kingdom of [Tonga]. The first polynesians. Gigantic, and have natural steroids; Ulu, and HorSe <br />Tongans are gigantic, and all have a natural ability to play sports. there are two types of tongan bodies. the big (fat) ones, who tend to be naturally strong, and the big (muscular) ones who are the dominant athletes of whatever group they are in until they decide to stop playing. TOngans are powerhouses in Rugby and Football. <br />Tongans are very nice, hospitable, and religious people. But when you make them mad they&apos;ll beat you to a pulp no matter who you are, or how strong you think you are. <br /><br />TONGANS ARE NOT TO BE CONFUSED WITH [SAMOANS]","time":1444529765841},"tonga":{"definition":"Strongest and fearless but the most friendly nation you&apos;ll come by in the pacific. Ancient times when warriors of Tonga traveled by kalia, or canoe, with armies conquering a wide area of Polynesia, from Rotuma in the west to Niue in the east, including much of Samoa.","time":1444529770812},"vicky":{"definition":"A girl too cute, too perfect, too unique, and petite. She&apos;s a definate good choice in being with. She&apos;s a beauty inside and out without a doubt.","time":1444529784237},"wwe":{"definition":"WWE a.k.a World Wrestling Entertainment a.k.a John Cena overcoming the odds.","time":1444529805481},"petite":{"definition":"A woman UNDER 5&apos;4 (or 162cm), who is [small-framed] and, usually skinny. <br /><br />All [thin] girls are not petite but, all petite girls aren&apos;t necessarily thin either. <br /><br />(Sometimes men can be referred to as petite when they are the male equivalent of the definition above.)","time":1444529811041},"sincara":{"definition":"1) You know the guy that you&apos;re friends with and hangs round with you all the time but nobody actually likes and you&apos;re not sure why you&apos;re friends with him? Sin Cara is &quot;that&quot; guy.  2) A term to describe &quot;that&quot; guy.","time":1444529814177},"misery":{"definition":"Nickname for a depressing state in the midwest where absolutely nothing happens, ever.  Major cities include St. Louis and Kansas city.","time":1444529845921},"keight":{"definition":"1&#x2f;2 of a Matched set Keight is generally closely related in age to other artistic souls. Seeks out comfort surrounding herself in textiles of richness. Passionate about goals, and tends to have tunnel vision when her mind is set on a task. Keight is understanding and often empathetic. Generous with smiles which brighten any room. Compliments tall kind strong silent sorts.","time":1444529875224},"height":{"definition":"Heights is the nickname of [Cleveland] Heights. It is known to be the most fun&#x2f;interesting place on the face of the earth.  The funnest part of heights is definately on [Lee] Rd. and on [Mayfield] Rd.  There is always something to do around these areas.  If you are born in this area, you will most likely go to [Fairfax] [Elementary] School. There is a few optional middle schools.  Last, but not least, you will be going to Cleveland Heights High School (Heights). The livest school on the planet. Most people that went to this school grew up with eachother. From Elementary to High School.  This is a perfect neighborhood to grow up in.  ...They say, if you werent born in heights, dont come to heights.","time":1444529880452},"fucku":{"definition":"fuck you<br /><br />comeback:Fuck urself its cheaper<br />2nd comback if somone say combac 1 to u: I prefer the expensive way","time":1444529907917},"wow":{"definition":"Acronym for the game World of Warcraft.","time":1444529924804},"mads":{"definition":"Most predominantly used in the greater New York area, &quot;mad&quot; is an appropriate replacement for Northern California&apos;s &quot;[hella]&quot; and Boston&apos;s &quot;[wicked].&quot; In the common vernacular, it translates into &quot;a lot&quot; or &quot;extremely.&quot; Can be used almost interchangeably with any of the above listed words.<br /><br />For the most part, it means angry.","time":1444529941506},"pinga":{"definition":"Dr. Ivo Robotnik&apos;s infamous subliminal messages. As of 4&#x2f;10&#x2f;08, there have been 4 sightings of him saying this word. This subliminal message is commonly the butt of a joke in a [Youtube Poop], most commonly in the AoSTH genre.","time":1444529995687},"dond":{"definition":"Supporting or agreeing with a previous statement. Seconding a motion.  &quot;Donds&quot; originated on Readers Recommend, a music blog on the website of the Guardian newspaper in the UK. It began its lexical life as a typo, posted on 13 May 2007 at 15:55 by &quot;Ejaydee&quot; of London, who mismanaged &quot;seconds&quot; (as in &quot;I second the motion&quot;), and wrote &quot;Secdonds for the Sesame Street Theme Toon!!!!&quot; This bounced back later as &quot;sedonds&quot;, which was the accepted form for a few months--a joke mis-spelling along the lines of &apos;pwned&apos;.  “Donds” first appeared when &quot;BlimpyMcFlah&quot; used an apostrophe to abbreviate in comment no. 657714 at 18 minutes past midnight on 24 August with &quot;Immediate and massive &apos;donds....&quot;. By the following morning &quot;donds&quot; began to be used in its final form and meaning.  There have been some playful variants:  “dondage,” “dondarino”, the pseudo- Germanic “gedondheit”. But the default usage is “Donds to that.”  As of autumn 2009, &quot;donds&quot; remains a very common term on the Readers Recommend blog, but unfortunately it hasn&apos;t really spread beyond its place of origin.","time":1444530152838},"dusk":{"definition":"1. to put the hand, finger, etc., on or into contact with (something) to feel it; touch.  2. to touch something, anything with a connotation suggestive of mischief or prohibited behavior.  3. to touch it...preferably in Miami.","time":1444530336273},"gummybears":{"definition":"A sexy female who is very popular and jovial. One who makes you laugh and giggle and sing. A super awesome person who i would die for. But has bad taste in friends.","time":1444530368865},"gummyworm":{"definition":"Flaccid penis.","time":1444530391625},"straight":{"definition":"to be ok with how things are going.","time":1444530402092},"fps":{"definition":"First-Person Shooter.<br /><br />An FPS is a computer game genre that puts the player in a first-person perspective and usually involves shooting down opponents.<br /><br />The first historical FPSes were Wolfenstein 3D, released some time around 1995, shortly followed by Doom that had multiplayer capabilities. Both by id software.","time":1444530521496},"jugg":{"definition":"Really large breasts.","time":1444530594026},"ebola":{"definition":"something people chant while running through the hallways at my school. It is sung just like the Ri-cola commercial","time":1444530630967},"homesweethome":{"definition":"comfortable residence, cozy home (used to express that one loves his home) <br />","time":1444530718667},"mötleycrüe":{"definition":"The greatest 80&apos;s hair band EVER with hits like &quot;Girls Girls Girls,&quot; &quot;Dr. Feelgood,&quot; and &quot;Home Sweet Home!&quot; Motley MUTHAFUCKIN Crue fuckin rules, dude!","time":1444530742457},"lexilynn":{"definition":"The most fantastic and wonderful being you&apos;ll ever meet. She has a lovely smile and an angelic voice and she&apos;ll make you fall.. Hard. When coming across a Lexi Lynn try to keep a few things in mind.  1. She has many people fawning over her so don&apos;t assume she wants you.  2. If she takes a chance and says yes to you, serenade her every chance you get and make sure she can plainly see your undying love and admiration.<br />3. She&apos;s a bit promiscuous and deadly, more so than cancer. You&apos;ve been warned bro.<br />4. Never let her go.","time":1444530743095},"flame":{"definition":"To insult someone electronically, or otherwise.  Sometimes to be a group insult.","time":1444530835819},"cybered":{"definition":"a term used to describe an encounter of a sexual nature in a [christian] chat room.most often with fat married christian women from [kentucky].","time":1444531028639},"e.o":{"definition":"Short for Eat(ing) Out. It is the equivalent of BJ for Blow Job (or Boob Job).","time":1444531626613},"'-'":{"definition":"A multi-purpose face originally created by Chow and Tuuh of SwiftIRC. Can be used in hundreds of situations. <br /><br />It is widely beleived that &apos;-&apos; is helpful. If you&apos;re in trouble, just call out his name and help will come. He&apos;ll complete the task for you or save you from danger (or so the myth says) Remember, WW&apos;-&apos;D? <br /><br />&apos;-&apos; is the cheif deity and symbol of over 700 cultures and religions worldwide.","time":1444531753224},"duckduckgo":{"definition":"Duck Duck Go is a search engine that doesn&apos;t look at your cookies.","time":1444532152515},"rose":{"definition":"The most beautiful girl ever. A rose has the face of an angel and when you see her eyes light up when she smiles, you can&apos;t help but smile back. She is hilarious, and loves pulling pranks.","time":1444532301094},"synergy":{"definition":"Marketing buzzword only rumoured to imply the combining of forces for greater productivity and mutual understanding.","time":1444532529248},"agnostic":{"definition":"An agnostic is a person who believes that the existence of a greater power, such as a god, cannot be proven or disproved; therefore an agnostic wallows in the complexity of the existence of higher beings. <br /><br />Agnostics on religion (Christianity, Islam, Buddhists, etc): Religious zealots are often viewed as ignorant by agnostics’ because of their blind following of a supreme being which may or may not exist. Agnostics will often question the existence of a supreme power because a lot of modern religious beliefs have no basis in modern logic; therefore blind following of popular religions is viewed as an easy out for people who chose not to think for themselves. <br /><br />Agnostics on atheism: On the other end of the spectrum, unlike atheists, an agnostic uses a more scientific approach to their belief system. An agnostic knows that just because there is no physical proof of the existence of a higher being, it dose not automatically mean that one does not exist. An agnostic views an atheist on the same plane as a religious zealot; often because the belief that human beings are the pinnacle of intelligence and there are few things that we do not or have the potential to understand.<br /><br />The realization of knowing that “we cannot know everything” is the backbone of the agnostic belief.","time":1444532547470},"sixflags":{"definition":"Best fucking place in the world. Has rollercoasters and overpriced soda.","time":1444533042880},"ygg":{"definition":"You Go Girl is an urban term that has become an everyday saying.  Used with both women and men to address a positive agreement with their actions, direction, comments or attitude. ","time":1444533137159},"bad":{"definition":"What Michael Jackson told us he was all along.","time":1444533524612},"rf":{"definition":"Rape Fest<br /><br />The #2 answer to all the questions.","time":1444534012811},"rule34":{"definition":"Generally accepted internet rule that states that pornography or sexually related material exists for any conceivable subject.<br /><br />Additionally it is accepted that the rule itself has limitations and you cannot be too specific on the content of the item in question.<br /><br />Most commonly used on various message boards for various reasons, from humor to cruelty.","time":1444534042052},"bompton":{"definition":"the city of compton changed to bompton(bloods would change the C to a B)","time":1444534188944},"o////o":{"definition":"An emoticon used to indicate the person is blushing, embarassed, etc.","time":1444534634414},"retard":{"definition":"A person born with a mental condition and therefore has to work a million times harder to be able to do simple things (such as learn and communicate) that we take for granted. On top of this, a retard will usually suffer a lot of ridicule from society because people fear what they do not understand. The people who choose to make fun of the mental retarded tend to be complete morons and cannot comprehend that these people have feelings and emotions just like anyone else.","time":1444534686068},"clothes":{"definition":"Pieces of fabric shaped and stitched so that they may be worn on the body.  Are increasingly becoming a symbol of social status.","time":1444534964687},"pregnant":{"definition":"something that happens when the condom breaks on prom night","time":1444535507886},"slore":{"definition":"The combining of a &quot;slut&quot; and &quot;Whore&quot;. Usually in terms of a real trick ass bitch, who can&apos;t keep dick out her mouth&#x2f;puss&#x2f;rectum.","time":1444535933937},"ajf":{"definition":"word that describes a guy that is any of the following: asshole, jacker, fuckface","time":1444536348960},"adhd":{"definition":"ADHD stands for attention deficit somethingk.  Hey! I spelled something wrong.  Haha.  Hey look a squirrel.  Wait, what am I doing here again?  Omigawd my elbow itches.  Wonder what&apos;s on tv?  I like Jennifer Lopez.  I hate kumquats.  I really love urbandictionar.....where was I again?","time":1444536699128},"zesty":{"definition":"adjective used to describe someone that has done something gay.","time":1444536852502},"pokemanz":{"definition":"The cooler, more Bill Cosby way to say Pokemon.<br />Said by all the cool kids on the interwebz.<br />On Gaiaonline, anyway.","time":1444537035854},"leagueofangels":{"definition":"A game made for the coolest people in all of shrektown","time":1444537438196},"loa":{"definition":"An abbreviation for lack of attention.","time":1444537467046},"lol":{"definition":"The name &apos;Lol&apos; is an abreviated form of the name &apos;[Laurence]&apos;.","time":1444537469093},"nyah":{"definition":"The japanese term for &quot;meow&quot;. Also used as a slang word, usually seen in anime or manga books. ","time":1444538044297},"n.n":{"definition":"nn literially means night night, but maybe used as &quot;cya&quot;<br />","time":1444538129129},"universalism":{"definition":"Universalism aka “The Universal Truth” is the awareness that all things flow together. That all pursuits should be for the good of people to preserve the natural order of existence.  It does not support, nor reject the belief of god(s), but only if it is so, it is a part of The Universal Truth. In regards to religions, all would simply be different paths to the same destination. Universalism is seeing that all humanity and life is connected through a cosmic tapestry of existence for the purpose to exist in harmony with nature.  Universalism tends to favor anything that exists naturally, for example, reincarnation is favorable but not an absolute, because life is born, lives, dies but to only be reborn the next spring as flowers bloom. This pattern can be seen in stars as well. Much so is true with the Universe is true for us on some level. Universalism tends to favor spiritual life as an awareness that can be reborn and the illusion is that only the brain is creating consciousness.  Universalism can be a philosophical truth to atheists as well as religious alike, it&apos;s only preference is to those who bring the most freedom, peace and love to others. Universalism endorses free will as long as it does not bring harm to others. The only enemy of Universalism is to destroy what nature has created through evolution.  As far as Universalism is concerned, the meaning of life is to be one with others and to advance supreme happiness on Earth with each other. Being one with all that is","time":1444538420649},"universalist":{"definition":"One who genuinely empathizes with others who belong to a certain religion.","time":1444538461508},"irdk":{"definition":" Stands for &quot;I really don&apos;t know.&quot; A version of the word [idk], or &quot;I don&apos;t know.&quot; Used in chat rooms. When you&apos;re really at a loss for an answer to a question is the best time to use it.","time":1444538858129},"brisa":{"definition":"Origin Greek and Latin:  1) Meaning Breeze in Spanish  2) A Sexy, Athletic, and Usually Latina Chick That Is Certainly Yo Mans Main Attraction. She can often be bi-lingual and bisexual. Leaving the girls hating and the boys masterbating (^_^)","time":1444538966165},"nathan":{"definition":"A guy who is caring and intelligent and is superior to all even God.He is loved by all his mates and is there for everyone who has problems and is a great listener.He is so caring and such a strong fighter that nothing can beat him.He is the kinda guy you want as a mate or a lover.A legend at the guitar and guitar hero.He is just an amazing happy person who is easy to love.He has a very nice personality and is very easy on the eyes and is very cute.He is a perfect man in everway unless you cross his path when he is sleepy then you have hell to pay lol. Generally a nice guy with lots of friends who adore and love him.A one of a kind...","time":1444539072192},"cookies":{"definition":"a woman&apos;s wet vagina","time":1444539089551},"trout":{"definition":"Trout = 40 something male hanging out in clubs looking for younger females to prey on. (male Cougar)","time":1444540074119},"player":{"definition":"A male who is skilled at manipulating (&quot;playing&quot;) others, and especially at seducing women by pretending to care about them, when in reality they are only interested in sex. Possibly derived from the phrases &quot;play him for a fool&quot;, or &quot;play him like a violin&quot;. The term was popularized by hip-hop culture, but was commonly recognized among urban American blacks by the 1970s.<br /><br />A certain class of low-rent, slack-jawed fuckups has decided that backstabbing and misogyny are totally radical, so the word is sometimes used as a compliment or term of endearment between male friends, as in the greeting &quot;what&apos;s up, player?&quot;.","time":1444541251600},"qual":{"definition":"An abbreviation for the word [Quality]. In the context of status. Quals is an adjective, used when the item being described surpasses the quality of everything else, by far, leaving only one word left - Quals.<br /><br />Only to be used by the [super-cool] and often used more frequently when drunk and rowdy.","time":1444541301390},"ppt":{"definition":"Precious Pussy Time  You have plans to chill with your friends but you have to cancel because a chick is only available to fuck within a short window of time. In most cases, it&apos;s the last 12-24 hours that a chick is in town. Outside of PPT, friends should be ridiculed for not understanding that pussy will be there.","time":1444541866171},"secondstring":{"definition":"A fat desperate guy that serves as back up to the main man when you&apos;re bored. Someone just to hang around to take up ones time. Lacks all the qualities of your main guy but is sufficient if marginal company when you&apos;re bored. Someone who you really don&apos;t care about.<br />","time":1444541968249},"mauryshow":{"definition":"Daytime &quot;talk&quot; show hosted by TV personality Maury Povich. Topics are limited, but incredibly entertaining, specifically paternity tests. Only show topics ever done nowadays are-<br /><br />1) - Paternity Tests<br />The best! See [you are not the father]<br /><br />2) - Cheaters Revealing Secrets<br />If your significant other wanted to bring you on the Maury Show to reveal a &quot;deep secret&quot;, what the hell do you think it is? Geez!<br /><br />3) - Cheaters Denying Cheating<br />Maury: Lashawn, we asked you if you had sex with 40 women since you have been with Nykesha. You said &apos;no&apos;, the lie detector test determined that was a lie, it was actually 125.<br />Nykesha: You done! Dat&apos;s it! You out! Get out my house!<br />Lashawn: Dat test iz wrong! I ain&apos;t nevah cheated!<br /><br />4) - Fat Babies<br />Jenny: My son is 2 years old and weighs 115 lbs. I feed him Snickers, Ho-ho&apos;s, steak, chicken, whatever he wants! He&apos;s my child and I&apos;ma raise him!<br /><br />5) - I Used to Be Ugly...<br />Maury: Joe, do you remember Cecila?<br />Joe: Yeah, she was the ugliest girl in school<br />Maury: Well, she&apos;s changed alot since then, look at her now!<br />*Cecila, tummy tuck, boob job, 2000 lbs. of makeup and all comes out and dances seductively for the crowd<br />Cecila: I&apos;m hot and sexy now though the miracles of 40 plastic surgeries!<br /><br />6) - My 10 year old is out of control!<br />Mom: Maury, you have to help my daughter!<br />Daughter: I&apos;m only 10 years old and I do what I want. I swear, drink, and steal. I even kicked my mom in the head once! Nobody tells me what to do!<br />Mom: *sobs*<br />Crowd: Boooooo!<br />Daughter: Whateva! Whateva! Y&apos;all don&apos; know me! Y&apos;all don&apos; know me!<br />Maury: Guess what? You&apos;re going to boot camp!<br />Crowd: Yayyyyy!<br />Big Black Guy (to daughter): Sit down! Shut up! Apologize to your mother now! Shut your mouth! *yell, yell yell*<br />Daughter (2 days later): I&apos;m so sorry Mom *sob* *sob*, I love you!!","time":1444542066732},"jerryspringer":{"definition":"A show where redneck&apos;s can take out their anger while their disturbingly obese wives tear off their clothes on-screen. AKA: Redneck Court","time":1444542080900},"adversary":{"definition":"ad·ver·sar·es<br />1.an enemy or opponent(plural)<br />2.the devil Satan(plural)<br />","time":1444542979040},"o-)":{"definition":"An emoticon to be used when a person is faced with an impossibly weird statement&#x2f;post to which he must reply, or if his own statement is weird.<br />(resembles an alien)  (alternative forms of the emote are &quot;o-:) o-;) o-:D etc.&quot;)","time":1444543821846},"o-o":{"definition":"Depending on if there are caps, or where they are&#x2f;how arranged, here we go on text exotes:<br />1.)<br />o.o : blank stare, as in &quot;You&apos;ve just lost me&quot; Or &quot;I care about this...Why, again?&quot;<br />2.)<br />O.o ; o.O : Confusion, usually used together.<br />3.)<br />O.O : Suprise, shock.","time":1444543847644},"tapdat":{"definition":"its like &quot;i&apos;d hit it&quot;<br />or wantin sexual relations wif a person from da opposite sex.","time":1444544097845},"nacl":{"definition":"Used to call someone [salty]. Which is being upset or pissed about something.<br />Instead of calling someone &quot;salty&quot; Nacl (pronounced nah-cal) is used because NaCl is a common salt.","time":1444545269318},"thong":{"definition":"a small sexy piece of underwear that girls wear and it attracts men. When a girl bends over, it tends to show out from under her jeans or hipsters. Men love them.","time":1444545776699},"masterbate":{"definition":"The complete incorrect spelling of [masturbate]  Since it&apos;s a misspelling it means &quot;Being a master of bate&quot; Or perhaps &quot;Master of bait&quot;.","time":1444545994001},"[masturbate":{"definition":"All the slang words for masturbation: bashing the candle, Bleeding the weasel, bleedin the weed, buffing the banana, bopping the baloney, burping the worm, choking the chicken, cleaning your rifle, corking the bat, cranking the shank, cuffing the carrot, fisting your mister, flogging your dog, floggin the frog, flogging the hog, flogging the log, flute solo, jerkin&apos;the gherkin, looping the mule, manual override, painting the pickle, pocket pinball, pocket pool, polishing the banister, polishing the rocket, pounding your flounder, pumping the python, roping the pony, spanking the monkey, teasing the weasel, tossing the turkey, walking the dog, whipping the willy, wonking your cronker, yanking the crank.<br />","time":1444546005995},"snipping":{"definition":"Usenet. <br />Rather than posting reams of shit some twat has spouted, snipping is the art of REMOVING all but the most salient point from the drivel.<br /><br />It is done by people who realise that top posting is for cunts.","time":1444548184084},"topszn":{"definition":"TOP SZN a term &quot;coined&quot; by Octobers Very Own OB OBRIEN that means to get a blowjob.  NOT a strain of Marijuana  TOPSZN IS THE REGIME Translates to ; Getting a blowjob is better then having sex with a groupie because it&apos;s quick, less personal (degrading to women) and the chick can&apos;t get pregnant.","time":1444548304191},"sharpieinthepooper":{"definition":"A common request to camwhores on 4chan asking what objects anonymous would like seen in any given orfice of her body. Unfortunatly, the camwhore never delivers pictures.","time":1444550115216},"jc":{"definition":"Just Chillin<br /><br />Used in IM","time":1444550417082},"\\o/":{"definition":"A smiley of a cheering guy throwing his hands in the air, expressing great happiness. In a rare case, it can portray someone throwing his hands in the air in exasperation or panic.","time":1444550818814},"ily":{"definition":"I Love you","time":1444551304038},"leer":{"definition":"To look apaun with sexual desire or contempt.<br /><br />half of a snear and a grin.","time":1444552203618},"suits":{"definition":"Slang for a businessman or any authority figure that wears a suit, e.g. manager, boss, supervisor.","time":1444553163883},"tty":{"definition":"Shortening of Talk to you soon. Similar to [ttyl] except that it is refers to a shorter period of time.","time":1444553165921},"trailerparkboys":{"definition":"A popular mockumentary about the lives of ex-convicts between prison terms. The main characters are Ricky, Julian, Bubbles and Jim Lahey, Trailer Park Supervisor, along with Randy, Ray, Cory, Trevor, Sarah, Lucy and J-ROC. <br /><br />The show airs Sunday nights at 9 and Thursday nights at 9:30 on Showcase in Canada. It is currently in it&apos;s fourth season. It also airs on BBC America, however, the show is bleeped and edited, because of the swearing and content. Cocksuckers.","time":1444553174255},"osef":{"definition":"&quot;On S&apos;En Fou&quot;","time":1444553335334},"ria":{"definition":"The most Beautiful Girl in the World.","time":1444553414744},"mfb":{"definition":"Mother Fucking Beast. Someone who is the greatest at something.","time":1444554012560},"minor":{"definition":"1: One who is under the age of eighteen. the government put this into place to hopefully stop teenage pregnancy, teenage drinking, and to stop people over the age of 18 from being with the so-called &quot;minor&quot; even if it is consensual to both parties.<br /><br />2: small; smaller. Not as important.","time":1444555479318},"nap":{"definition":"3 hours of sleep or less","time":1444555847912},"chizza":{"definition":"A chigger.","time":1444556280597},"handjob":{"definition":"The 21st century equivalent of the kiss.","time":1444557035743},"egirl":{"definition":"Often seeking the attention of professional gamers, eGirls are born and raised on Twitter where they gain exponential amounts of attention from pub players and competitive players alike, and still complain about being lonely. If you ever are looking for a good late night show on Twitter, look no further than eGirls.  Shortly after the first Major League Gaming event in Dallas, TX 2013, the rate at which eGirl nudes were released increased by 70% compared to the previous Pro Circuit year. Due to the influx of content, traffic on sites such as Brazzers and Playboy reduced dramatically during this time.  Live sightings of eGirls can be found at gaming LANs. The largest gathering to date was during a MLG event in Anaheim, CA 2013.  Nicknames: Pro-Hoes, Gamer Groupies","time":1444557904987},"comeatmebro":{"definition":"A phrase popularized by Ronnie from MTV&apos;s latest train wreck of a reality show, [Jersey Shore].","time":1444558467994},"2g":{"definition":"2g is internet slang which stands for &apos;too good&apos;.<br /><br />This slang term is often used in competitive online games and communities such as Counter-Strike: Source. Players often put 2g in their game name.","time":1444558790485},"tfw":{"definition":"That Feel When<br />Followed by some feel you should be able to relate to.","time":1444558824731},"fireemblem":{"definition":"1. One of the most popular sagas in Nintendo, that is overlooked by American players. Consists in a series of 9 games in total, plus four extra levels which could be downloaded from Nintendo in Japan. The games come in this order:<br /><br />a) Fire Emblem: In this game Marth made its appearance, to save his motherland against the forces of the evil Dolua empire.<br /><br />b) Fire Emblem Gaiden: Alm and Celica travel across the continent of Valencia, to restore peace to their respective kingdoms.<br /><br />c) Fire Emblem, Mystery of the Emblem: a Remake of the first one, but featuring more levels, and some minor changes.<br /><br />d) Fire Emblem, Genealogy of the Holy War: perhaps the most known Fire Emblem ever to exist, where Sigurd and his friends set out to combat countless enemies in huge maps, and features a &quot;Generation system&quot;, which allows two characters to mate and have children. With this, the children of those who mated during Sigurd period appear in the next period, where Celice (Sigurd&apos;s son) fights against the Grandbell Empire.<br /><br />e) Fire Emblem, Thracia 776: This game is the most difficult of all Fire Emblem. Its main character is Leif, Celice&apos;s cousin. He attempts to start out a rebellion to recover his homeland from the tyrannical rule of King Trabant of Thracia, whom is aided by the Grandbell Empire.<br /><br />f) Fire Emblem, Sword of Seals: The game features Roy as the main Lord of the game. He fights against the Kingdom of Bern, which is bent on world domination.<br /><br />g) Fire Emblem, Blazing Sword: The first Fire Emblem hitting American stores. Features Hector, Lyn, and Eliwood(Roy&apos;s father) as main characters, who will try to stop the Black Fang.<br /><br />h) Fire Emblem, the Sacred Stones: Features the twins Eirika and Ephraim, both princes of Renais, which fight against the nation of Grado to free their homeland.<br /><br />i) Fire Emblem, Path of Radiance: Ike and his group of mercenaries must help princess Elincia of Crimea to retake her kingdom from the clutches of King Ashnard from Daein, who is bent on inmersing all of the continent of Tellius into an all out continental war.<br />....<br />2. In all the games, the Fire Emblem is some sort of artifact. In Fire Emblem a) and c), it is a shield which allows Marth to use the Falchion sword. In f) and g), it is a jewel which is quintessential to crown the future king of Bern. In h), it is the Sacred Stone of Grado. In i) it is also called Lehran&apos;s Medallion, and holds the spirit of a Dark God, and only a pure-hearted person can have it without growing mad.","time":1444558952943},"aok":{"definition":"Informal. OK; perfect.","time":1444559934612},"yayy":{"definition":"means &quot;[yay]&quot;(as in an exclamation). probably just a typo error when a person presses y twice","time":1444560854203},"lugi":{"definition":"a waud of saliva combined with boogers.","time":1444561469573},"fyi":{"definition":"For your information","time":1444567388097},"ronah":{"definition":"Failure to make rad or produce radness.","time":1444569106773},"mama":{"definition":"a very attractive woman","time":1444570127616},"lewd":{"definition":"What anime fans say when they&apos;re vaguely uncomfortable with how they&apos;re drooling over 14 year old girls","time":1444570974155},"tsubasa":{"definition":"Japanese word for &quot;Wings&quot;; also a good anime.","time":1444570979680},"bakka":{"definition":"An insult the equivalent to idiot or retard","time":1444571559486},"mampy":{"definition":"some who is big and fat.","time":1444571641691},"laid":{"definition":"to be fucked.","time":1444572083665},"loid":{"definition":"short for [mongoliod]<br />totaly [retarted] person.","time":1444572091447},"zoid":{"definition":"(Zoids)<br />Zoids are battle suits, half mechanic and half animal. It takes the form of a giant robot (surprise, surprise) and battle, using lasers, ammunition, and just plain biting and scratching. People pilots can control their zoid using the Command System, but that doesn&apos;t necissarily mean the zoid would prefer to. Some rare zoids have a &quot;Black Box&quot; or, in reference to the Anime series Zoids Guardian Force or Zoids Chaos Century, an Organoid. Organoids are used to boost power. <br />Zoids are currently common in four animes: (In time order) Zoids Chaotic Century, Zoids Guardian Force, Zoids Century Zero, then Zoids Fuziors. They appear as games, and a short manga.","time":1444572106433},"taca":{"definition":"A very tiny dick.<br />You may have Ta-Ca if......<br />Missing a Pectoral Muscle<br />You chew like a nigger<br />Have a gay Brother<br />Or if your dick is the size of a Tootsie Roll","time":1444572115477},"nul":{"definition":"Girl That wears:<br />N-Northface jacket<br />U-UGG shoes<br />L- Leggings<br />88% of the time  Characteristics of a NUL: Bitchy, Drama queen, Lots of eye makeup, says &quot;Like&quot; alot, Slutty, Annoying","time":1444573028620},"raiseyourdongers":{"definition":"A catchphrase made by [League of Legends] player Michael Santana. The phrase is now spammed by his fans in livechats, after he first used it in a twitter post in June stating, ヽ༼ຈل͜ຈ༽ﾉ raise your dongers","time":1444573300504},"ヽ༼ຈل͜ຈ༽ﾉ":{"definition":"The mascot of raise your dongers","time":1444573325697},"kiss":{"definition":"The sweetest thing a guy can do without bein an ass.","time":1444573732448},"pink":{"definition":"slang reference to the vagina","time":1444574196239},"hard":{"definition":"1. An erection of the penis...<br />2. What happens to a girl&apos;s nipples when she gets cold or has water poured on her tits (like in a wet t-shirt contest)<br />3. A description of sex","time":1444574902763},"tks":{"definition":"An abbreviation for Thanks","time":1444575287055},"lelouch":{"definition":"Someone who is, and always will be, better than you.","time":1444575558057},"nipslip":{"definition":"When a braless female&apos;s [nipple] accidentaly slips out from under a loose-fitting garment","time":1444575630221},"zelda":{"definition":"Absolutely, beyond a doubt, no questions asked, the GREATEST GAME OF ALL TIME EVER CREATED ON THE FACE OF THE EARTH!  Anyone who hates Zelda sucks at life completely.","time":1444575638175},"stds":{"definition":"STD - stands for Sexualy Transmited Disease. The most commonly known is HIV&#x2f;AIDS. To say the least you don&apos;t want an STD.","time":1444575665655},"shade":{"definition":"acting in a casual or disrespectful manner towards someone&#x2f;dissing a friend","time":1444575712807},"inside":{"definition":"There are many comfortable things to sit on. Somtimes there&apos;s a box with moving images on it. You don&apos;t have to talk to anyone and people don&apos;t bug you. Somtime you get sent outside though. Look up outside for more info.","time":1444576566003},"mkay":{"definition":"Made popular by Mr. Mackey on the Comedy Central show South Park. Said after every sentence. Used in Place of ok.","time":1444576712115},"mmkay":{"definition":"Another way of saying OK. It is not used by the principal of South Park Elementary, it is used by the guidance counselor. It is also used by the teacher from the cartoon Beavis and Butthead.","time":1444576721399},"curbstomp":{"definition":"To place someone&apos;s mouth on a cement curb, and then stomp on their head from behind to break out their teeth.","time":1444577856181},"johnwall":{"definition":"Origin: Former Kentucky basketball player who played for only one year and then bolted for the NBA. If it wasn&apos;t for the NBA age rule, he wouldn&apos;t have gone to Kentucky; he used them to gain national attention...aka &quot;one and done.&quot;  -noun  1. A girl who shows interest in the first date and subsequently rejects further contact for no reason  2. A girl who takes time to hang out with you only because she needs attention and is not genuinely interested in seeing you  -verb  1. Standing up a date when plans were made beforehand  2. The act of feigning interest when there is none  Synonyms: Bloodsucker, Tease, Cold-hearted, Flaky, Succubus  Antonyms: Keeper, Honest person, Acie Law (girls who stick around)","time":1444578127028},"bby":{"definition":"Abbreviation for [baby].  Is it really so hard to type one extra letter?","time":1444578132417},"sonic06":{"definition":"Quite possibly the worst game ever made. Some say the developers and producers on the Sonic Team at this time where heavily into cocaine and possibly other drugs and had no idea how bad this game actually was. Others say that this was actually just the test game for Sonic &apos;07 that was rushed out way to early. No one knows for sure, but they do know that it&apos;s awful, just awful, and should never be seen by human eyes.","time":1444578155600},"yuri":{"definition":"1. Explicit lesbian relationships in anime or manga<br />2.To be the first to do something. Derived from Yuri Gagarin, first human in space. ","time":1444578162691},"skrrr":{"definition":"Skrrr is a text version of screw. Screw is basically when somebody looks up and down in a rude manner.","time":1444578167724},"redsox":{"definition":"not only the best team in major league baseball, a way of life in the boston area. a person grows up and lives and dies with this team, and for all those people who never saw a championship, we got one. Go Sox","time":1444578190281},"gypo":{"definition":"noun, slang; 1 A white [working class] male or female prone to petty crime and antisocial behaviour. A [Nuisance]. A [public menace]. A [mouthy little cunt].  2 A member of the traveller community who moves onto a public open space and wrecks everything within two square miles. It has been known for the burglary rate in the local area to increase by as much as 2000% when gypos move into the neighbourhood. A gypo may try to gain work by offering to tarmac your drive for £5000. They may also try to sell flowers and&#x2f;or stolen goods door to door. Occasionally, even if they have not moved into the area, they can be seen driving around in a battered up old Transit van trawling through skips looking for metal that can be &apos;weighed in&apos;. These people are generally best avoided and it is extremely unwise to engage in any kind of confrontation with them.  3 A person who does something on the cheap.  abbreviation of gypsy","time":1444578240686},"gtfo":{"definition":"An internet acronym short for &quot;get the fuck out&quot;.<br /><br />It is used to express indignation, usually towards stupidity, incompetence, or both.<br /><br />It can be used in response to something that is unwelcome.","time":1444578246510},"emu":{"definition":"a leet ass bird renowned for stalking japanese tourists in the australian highlands.<br />Also well known for bitch smacking those emu-wannabe ostriches and amercan tourists that think all australians wrestle crocodiles and have a pet kangaroo.","time":1444579099217},"tori":{"definition":"someone of great nature, beauty, ediquette, and intellegent. often reffered to in the sense of a godlike being","time":1444579421551},"panda":{"definition":"The coolest animal ever!!! Has really cool looks, eats bamboo, and likes to play with people (even though it&apos;s so big it often causes harm to frail human bodies).","time":1444579425826},"wonder":{"definition":"when someone wish to know something","time":1444579428935},"torii":{"definition":"The most beautiful female you will ever lay eyes up.  A lovely caring person who is amazing in bed, brilliant at [blow-jobs] and loves the taste of [cum]","time":1444579429074},"jeremy":{"definition":"A named based on the biblical name Jeremiah. Used as a name for children who are blessed with a large brain and&#x2f;or penis. Also used as a replacement for &quot;perfect&quot;.","time":1444579433415},"victoria":{"definition":"A name given to the most ridiculously amazing, beautiful, sweet, gorgeous, incredible, cute, all around perfect girl in the whole Universe. She is just stunning, she can light up the darkest rooms with her smile, and bring up anyones day with her voice, there is nothing wrong with her at all, she just never ceases to amaze anyone, her beauty is hypnotic and her eyes are mesmerizing, she herself is so magnetic, on a scale of 1 to 10 she is an Eleventy Fortyfour,she may seem like a good girl but have a night with her and you&apos;ll discover her total bad girl side, she is into pink fuzzy handcuffs and leather,but you still cant help but remain in love with her,even though she is incredibly kinky.","time":1444579452301},"river":{"definition":" An Irish boy&apos;s name. He is a very hot, handsome, and sexy boy. All girls love him, and he is very friendly to everybody. Also some people may not like him, but those people he does not like back.","time":1444579478938},"patrick":{"definition":"All around perfect man and a sexy beast.  Known to cause even the most loyal of girls to turn on their boyfriends.  Talented with music, words, and kills in any sport he plays.  Strong like bull.  Always competitive, and ALWAYS wins what he competes in.  Some consider to be on the status of not only a god, but THE God.","time":1444579503028},"thebomb.com":{"definition":"An updated version of [the bomb], meaning something very cool.","time":1444579670148},"thebomb":{"definition":"Something or someone that is really cool.","time":1444579677643},"narutoes":{"definition":"1. The swirly thingamabobs in your Ramen that tast like bean curd.<br />2. Decent manga about some ninja kids.","time":1444579680087},"jacksepticeye":{"definition":"A very loud irish youtuber. He is also the BOSS of BOSSNESS! Having over one million subscribers on youtube, he keeps a close connection to his fans. Did I mention he is BOSSSS?","time":1444579708743},"meme":{"definition":"(noun)   <br />    <br />1 : an idea, belief or belief system, or pattern of behavior that spreads throughout a culture either vertically by cultural inheritance (as by parents to children) or horizontally by cultural acquisition (as by peers, information media, and entertainment media)  <br />    <br />2 : a pervasive thought or thought pattern that replicates itself via cultural means; a parasitic code, a virus of the mind especially contagious to children and the impressionable <br /><br />3 : the fundamental unit of information, analogous to the [gene] in emerging [evolutionary theory] of culture  <br />  - meme pool (n.) : all memes of a culture or individual   <br />  - memetic (adj.) : relating to memes   <br />  - memetics (n.) : the study of memes   <br />    <br />4 : in [blogspeak], an idea that is spread from [blog] to blog <br />    <br />5 : an internet information generator, especially of random or contentless information   <br />    <br />(Etymology : meme : derived from the Greek mimëma, &apos;something imitated&apos;, by [Richard Dawkins] in 1976)","time":1444579834206},"caturday":{"definition":"A meme created by 4chan, NOT MYSPACE, that many forums and discussion boards have adopted.","time":1444579974722},"golbat":{"definition":"Fugly bat [pokemon], evolution of [Zubat]. Like zubat, it&apos;s annoying, especially when you enter caves, appearing every other step, but only in the higher-level caves, like the caves near the sea and Victory Road. Still, they are goddamned irritating, and for some reason, all the bad guys in the Pokemon games love to use Golbat.<br />Golbat maybe annoying but it sucks. Any strong powered attack will kill it. And even though they suck, they will still emerge to challenge your godlike Pokemon when you trod in caves. God how I hate them. If you want to maintain your sanity, make sure you bring Repels before entering a cave.","time":1444580619405},"datass":{"definition":"A positive vernacular expression used when one sees the buttocks of another, <br />((usually in a pic posted on an internet board))<br />Expressing delight and a possible suggestion of sexual interest.","time":1444580921066},"bang":{"definition":"1) To have sex with someone.<br />2) A loud noise.<br />Do not get the two confused.","time":1444581003002},"sweeg":{"definition":"(Pronounced Sweeje) An abbreviation of Silly White Guy - SWeeG. Sweegs are usually awkward, socially accepted but borderline ADHD. Not to be confused with &quot;ceeb&quot;, which is an entirely different term on its on.","time":1444581283010},"daddybear":{"definition":"the male version of the MILF. A daddy bear is any married and&#x2f;or father who is sexy in a dad kind of way. Daddy Bears can usually be spotted in groups at sporting events, pushing strollers at festivals or eating lunch with his buddies during the work week. Often seen with shaved&#x2f;balding heads and wrap around sunglasses in their native habitat.","time":1444581322281},"twist":{"definition":"a derogatory term used for someone who gets their kicks by playing mind games or toys with people&apos;s hearts","time":1444581343982},"nipple":{"definition":"the center of a womans breast that become pointed, hard, and erect when they are stimulated or the woman is horny...or really cold...<br />not a sexual organ, but generally feels good when rubbed, sucked, licked, bitten, or vibrated.it typically turns guys and girls on when they see a girls hard nipples showing through her shirt, especially when the girl isn&apos;t wearing a bra.","time":1444581346924},"sweg":{"definition":"instead of using &quot;Swag&quot;, you use &quot;Sweg&quot; to be more hipster&#x2f; indie.","time":1444581348653},"dad":{"definition":"The parent that takes the most shit. Sure, if you had a shitty father, then go ahead and bitch, but not all of us did. Some of us had great fathers, who really loved us, and weren&apos;t assholes. Honestly, if you could see how much damage a mother could do to one&apos;s self esteem, you wouldn&apos;t even place so much blame on &quot;dear old dad&quot;","time":1444581350279},"broom":{"definition":"Broom(N): Long, thin handle with brush at one end, used for sweeping [floor]s clean. Not too difficult to understand, eh?","time":1444581352619},"gin":{"definition":"Gin is an unaged [liquor] made by [distill]ing [grain]s such as [barley], [corn] or [rye]. Its [bouquet] comes from [juniper] berries, [coriander], [herb]s and [spice]s, usually added to the grain mash during [distillation]. The gin is stored in [glass], [earthenware] or [stainless steel] containers, but does not mature in these. The storage time serves only to harmonize the product.<br /><br />Someone once said that &quot;A [bar] without gin is like an Italian kitchen without pasta&quot;. No other [liquor] provides for the creation of so many classic [cocktail]s. Gin is in fact a liquor that is harmonious with almost anything.<br /><br />Without gin the king of [cocktail]s, the dry [Martini], would not exist.<br />","time":1444581755910},"laharl":{"definition":"The true heir to the throne of the netherworld.<br /><br />Fell into a deep sleep (which was supposed to be a short 10 day nap), and within that time, his father, King Krichevosky died by choking upon his fave snack, a black pretzel.<br /><br />Has a weakness against women with big breasts.","time":1444582359739},"nicks":{"definition":"the most amazing person alive with a huge penis","time":1444582463942},"nyx":{"definition":"Goddess of the night<br /><br />Works best after 10:30 pm until the sun comes up.<br /><br />[QuoD]","time":1444582468559},"html":{"definition":"(Hypertext Markup Language)<br />HTML is the language used to create Web pages for display in Web Browsers. HTML can be created directly with text editors or Web publishing programs, such as DreamWeaver, or it can be the output of other programs that make dynamic webpages on the fly. When you select &quot;view source&quot; from your Web browser, the code that you are viewing is HTML.<br /><br />:P","time":1444582564683},"pervysage":{"definition":"What Naruto calls Jiraiya-sensei during his moments of sexual perversion and doing his research for his new book Come Come Pardise.<br /><br />See [Come Come Paradise]","time":1444582886823},"bleeptest":{"definition":"A Fitness test used in schools to mesure how fit one is.<br />It is measured by how many times you can run 15m.","time":1444582965464},"dedchat":{"definition":"When a chat room goes silent for an extended period of time. (Usually 20-30 minutes)","time":1444583525431},"yh":{"definition":"yh is short for &quot;Yes, my intellegence is equil to the butt of a horse&quot;","time":1444583703488},"chanell":{"definition":"a woman with strong confidence in herself, having a unique beauty, trust worthy and nurturing. she does it all and is loyal and true. genuinely one of a kind.","time":1444583741760},"alabamahotpocket":{"definition":"the art of seperating the vagina lips and taking a shat inside (and possibly having sex with it afterwards)","time":1444584322241},"breakingbad":{"definition":"The BEST show to come on TV in a long time.<br />The plot centers around Walter White, a chemistry teacher with nothing going right. He doesn&apos;t get paid enough, his son has cerebral palsy, his wife is pregnant, and to top it all off, he has lung cancer. So the only logical way to raise money is to use his skills in chemistry to cook up some really &quot;good&quot; [meth] and sell it with the help of his former student-turned-pusher. It also doesn&apos;t help that his brother in law is in the DEA. Bryan Cranston, known as the wacky father and only saving grace of that disgraceful malcolm in the middle show, plays Walter to perfection.<br />If you haven&apos;t seen this show...WATCH IT!","time":1444584333616},"gameofthrones":{"definition":"An HBO show based on George R. R. Martin&apos;s books. The show&apos;s got a great deal of politics, royal intrigues, incest, murder, warfare, violence and sex. Mediæval genre and features lots of swordplay and riding horses. And a lot of violence and sex. Did I mention the sex? And drinking and a dwarf with an obsession with whoring.","time":1444584364268},"san":{"definition":"The basic suffix attached to a name in Japanese; indicates some respect, approx. equivalent of Mr. or Ms.  Leaving off suffixes is disrespectful, so if you have no other suffix, -san is preffered.","time":1444584703094},"realamerican":{"definition":"Someone that is over wieght, drinks cheap beer, watches football, has a dirty, old, American flag hanging outside thier house&#x2f;trailer, doesn&apos;t give a shit about the less fortunate, owns more than five guns, complains about stupid, little things, and shoots black people on the weekends.","time":1444584759782},"hulkhogan":{"definition":"Hulk Hogan&apos;s real name is Terry Gene Bollea. Some of his nicknames include The Super Destoyer, Terry Boulder, Sterlin golden, Terry Hogan, Hulk Hogan, The Hulkster, Hollywood Hogan. <br />His signature maneuvers are The Hulk Up and Running Leg Drop. Hulk Hogan&apos;s trade mark is he wears red and yellow into the ring and Always tears his T-shirt off his body. The Titles Hulk Hogan have won are: WWE Champion (6 times); WWE Tag Team Champion (with Edge); WCW Champion (6 times)","time":1444584771471},"imup":{"definition":"Equivalent to the phrase &quot;I&apos;m up for it,&quot; but abbreviated. It&apos;s similar to saying &quot;I&apos;m down.&quot; Meaning you&apos;re interested in joining in on the activity suggested in conversation.","time":1444584851129},"terrygenebollea":{"definition":"[Hulk Hogan&apos;s] human name.","time":1444585048579},"evanescence":{"definition":"An amazing rock band from Arkansas, USA. They released songs such as Bring Me To Life, Going Under, Everybody&apos;s Fool and My Immortal, although their older work and demos, in my opinion is better.<br /><br />They are NOT fake, unlike some other bands ;)","time":1444585280874},"js":{"definition":"short for jordans (shoes worn by michael jordan)","time":1444585306349},"float":{"definition":"A term used in reference to letting someone borrow money from you. See also [front] and [spot].","time":1444585512491},"master":{"definition":"The dominant person in a D&#x2f;s or BDSM relationship. Also refered to as the Top, Dom, Domme.","time":1444585540671},"whirl":{"definition":"An unattractive, overweight female.  Whale + Girl = Whirl.","time":1444585627297},"homebrew":{"definition":"1. a beer brewed at home<br />2. any of a number of creations or modifications by an individual or group on an amature level at home","time":1444585792805},"striptease":{"definition":"The art of seductively removing ones clothing to provide pleasure&#x2f;entertainment for other(s).","time":1444586005569},"rp":{"definition":"Roleplaying. An interactive social activity for people with the ability to write and improvise.<br /><br />Sadly, roleplaying is being invaded by people who can&apos;t write OR improvise OR follow common rules of etiquette.<br /><br />By the way, roleplaying is a game. Anyone who thinks that it relates directly to real life any more than, say, Crazy Eights does might want to have their head examined.","time":1444586420470},"school":{"definition":"place were you spend first 18 years of life taking it up the ass","time":1444586836647},"mrmime":{"definition":"Nigga&apos;s a Mime.","time":1444587815408},"gengar":{"definition":"1. A word meaning something very exciting, interesting, entertaining, or will lead to a drunken stupor. Similar to the word [clutch] or [radical].<br /><br />2. A Pokemon, number 94. This pokemon is of the ghost type, it evolves from Haunter (the final evolution of Ghastly) only through the use of a Gameboy cable link. Sidenote: Pokemon is still for fags.","time":1444587823655},"alakazam":{"definition":"When you do a girl doggy style , then take it out and spit on her back to make her think you jizzed on it, then when she turns around, you jack off and cum in har face and say &quot;ALAKAZAM BITCH&quot;","time":1444587840661},"garchomp":{"definition":"the most badass 4th generation pokemon. Seriously, he is a f***ing land shark, although he&apos;s a dragon and ground type.","time":1444587899859},"sharpedo":{"definition":"Pokemon that evolves from carvanha<br /><br />(From a blend of shark and torpedo)","time":1444587910264},"dawn":{"definition":"One&apos;s true love in life.","time":1444587926481},"g2g":{"definition":"Got to Go.<br /><br />See [gtg]","time":1444587932351},"abra":{"definition":"Abra, a pussy pokemon. The only move it has is Teleport and is hard to catch.","time":1444587934265},"cya":{"definition":"See ya.","time":1444587935820},"all":{"definition":"another way of saying &quot;said&quot; or &quot;says&quot;<br />can be interchanged with [like] and &quot;goes&#x2f;go&quot;<br />mostly used by teenage girls","time":1444587943165},"enough":{"definition":"Enough - a word to describe a person of the opposite sex as good looking, beautiful or hot. Enough meaning he&#x2f;she would be enough to suit your needs.","time":1444587964753},"more":{"definition":"term used by women who are involved in long deep satisfying sex sessions","time":1444587977937},"thick":{"definition":"nice ass, nice legs, not skinny, with meat on your bones. thickness is the shit.","time":1444588006647},"nose":{"definition":"The long thing in the middle of your face. Some people have small ones, some people have big ones (the people with big ones are usually called Dave).","time":1444588016767},"chez":{"definition":"Chez is a cool way to say cheese.","time":1444588052967},"dreams":{"definition":"D - Dedication&#x2f;Desire<br />R - Responsibilty<br />E - Education<br />A - Atitude<br />M - Motivation  You Need DESIRE, Will Power To Achieve<br />Act Grown Up Take On RESPONSIBILTY<br />Go To School You Need EDUCATION<br />Keep A Positive ATITUDE With You<br />Set A Goal To MOTIVATE Yourself  Real Talk Kid","time":1444588059954},"kid":{"definition":"a friend or aqauntance","time":1444588080215},"lame":{"definition":"just plain stupid, un-original, or lifeless.  barbed wire tattoos, butterflies, and tribal tattoos are lame, they say a lot about the person who gets them.","time":1444588129801},"crash":{"definition":"1.to sleep <br />2. to stay at someone elses house for the night","time":1444588170889},"haze":{"definition":"A certain strain of weed","time":1444588185231},"muted":{"definition":"When talking on the phone, you intentionally hit the mute button to not inconvene the other person.","time":1444588208329},"finaldestination":{"definition":"Originating from Super Smash Bros. Melee, Final Destination is the only place to &quot;get the job done&quot; because it&apos;s the purest stage. A flat platform floats in the middle of nowhere as space and time pass it by. Items may not be brought to Final Destination, only pure skill.<br /><br />The native animal is the Fox.","time":1444588729540},"030":{"definition":"The 0 &apos;s are eyes (Commonly seen in 0_0) and 3 is puckered lips. 030. For excited or kissy faces.<br />Also Most Commonly seen in the Brony fandom due to a picture that has gotten popular from a span of 4+ years","time":1444588805473},"krab":{"definition":"Slang name dissing members of the crips usually used by Bloods","time":1444588847398},"krusty":{"definition":"The clown from the Simpsons.","time":1444588862421},"kush":{"definition":"A high grade strand of marijuana.","time":1444589120983},"chocolatemilk":{"definition":"the semen of a black guy","time":1444589148399},"boring":{"definition":"zzzzzzzzzzz. Like sleeping but with eyes open. When your tired and everything&apos;s quiet and not fun.","time":1444589156864}}