{"0":{"definition":"Where [Captain Planet] is taking [pollution].<br /><br />","time":1444017663081},"10":{"definition":"Top grade woman (= 10 out of 10). From the movie &apos;10&apos;, featuring Dudley Moore and Bo Derek.","time":1444090688796},"18":{"definition":"The age where an American can:<br />1. Legally buy pornography<br />2. Legally buy cigarettes<br />3. Legally gamble in Indian Casinos<br />4. Legally be concidered an adult<br />5. Be tried as an adult in a court of law<br />6. Be drafted for a war they don&apos;t believe in<br />... but still cannot buy alcohol.","time":1444182382878},"50":{"definition":"Slang for police officers and&#x2f;or a warning that police are approaching. Derived from the television show Hawaii 5-0. Also see [pig], and [piglet].","time":1444152965604},"333":{"definition":"Half evil.<br /><br />666 = evil, hence 333 = half evil.","time":1444085957905},"369":{"definition":"The illest writing crew alive or dead:<br /><br />Ty Bluesmith, xTx, ~otto~","time":1444085889063},"400":{"definition":"HTTP status code for &apos;bad request&apos;, usually due to an error in syntax.","time":1444182268111},"404":{"definition":"Error returned when a server cannot find the requested page.","time":1444182286412},"666":{"definition":"The Mark of the beast, and the men who follow the beast of the earth will bear this mark to display their allegiance to the beast. It has been disputed by some scholars that certain numeric ciphers would translate it over to certain words, names, etc... For example, one of the more popular translations was Nero Caesar, and before that, Lateinos, etc...<br /><br />&quot;...And that number is 666.&quot;<br /><br />Widely implied that it was 666 because it was an imperfect number to represent the impurities of man and their evildoings and sinful ways.<br /><br />Read the book of revelations, at the end of the New Testament; it tells all about that, the seven seals, the apocalypse, Armageddon, Megiddo, etc...","time":1444085962407},"777":{"definition":"The Number of God. Its counterpart is the Number 666, also known as the Mark of the BEast.","time":1444085983607},"1738":{"definition":"A term used by rapper [Fetty Wap] in his song &quot;[Trap Queen]&quot; to represent his squad in New Jersey: the Remy Boyz 1738. The [Remy Boyz] named themselves after a cognac liquor which they claim to be the finest: the Rémy Martin 1738.","time":1444086048016},"2012":{"definition":"i mean come on if you wrote calenders from the beginning of time dont you think you would have to stop at one point? shit would you like to sit around all day and write a fucking calender untill the end of time.. some dude must of just got tired and went and did somthing else with his life. <br /><br />","time":1444007471297},"2468":{"definition":"A diet where you eat 200 calories the first day, 400 calories the second day, 600 calories the third day, and 800 calories the last day. There are some variations  like 24680, where you eat nothing on the last day.","time":1444086943992},"13579":{"definition":"The odd numbers on a computer&apos;s keyboard; a definition only someone with no life would submit to Urban Dictionary","time":1444086933589},"123456789":{"definition":"1:the first 10 standard numbers<br />2:the numbers used on number pads and keyboards<br />3:the numbers on cell phones<br />4:can be combined to make any individual number<br />5:the numbers only dumb people can count up to<br />6:uno dos tres quatro sinco ses sieta ocho nueva in spanish minus the accents","time":1444086907391},"queening":{"definition":"British Term :-<br />The act of a woman sitting on her subserviants face for the majority of the day.<br />Also known as throning","time":1444007375141},"throning":{"definition":"to send a text, update your facebook, twitter, myspace or any other internet social network status while sitting upon the toilet.","time":1444007385592},"catherine":{"definition":"An amazing individual who beasts at everything. She takes crap from no one and makes people laugh like there&apos;s no fucking tomorrow. Sweet most of the time but will shut a bitch up quick. Shes athletic and loves music.. and shes a sexy piece of ass as well. ","time":1444007400567},"gift":{"definition":"The period or better the curse. You cannot see, but for sure you can feel the inverted commas on it.<br />Most appropriately, a &quot;gift&quot; from [Mother Nature]: for girls, a confirmation of her sick sense of humour.","time":1444007418546},"ssj":{"definition":"super saiya-jin, an advanced level of power reachable only by members of the saiya-jin race or saiya-jin&#x2f;human hybrids.  it causes the person&apos;s hair to turn gold and stick up, the person&apos;s eyes to turn turquoise, and increases the person&apos;s fighting strength several times.  it is usually the result of extreme anger.  from dbz.","time":1444007456816},"poo":{"definition":"Poo well, they&apos;re are many types of poo in this universe<br /><br />There is<br /><br />THE SWEETCORN - Poo that has leftover sweetcorn from last night&apos;s dinner<br /><br />THE PELLETS - Little pellets of poo that comes out of your ass like a machine gun<br /><br />THE FIREBALL - A big poo that really hurts and leaving your ass hot, usually happens after a curry<br /><br />THE SLIPPY - A poo that swiftly moves out of your bottom that requires no wiping<br /><br />THE WATERHOSE - When a massive monsoon of shit comes out of your bottom and requires hours of wiping<br /><br />THE NEVERENDING STORY - An amazing acheivment is when a poo goes on and on and on.......<br /><br />THE STEAMY HEAPY - Boy, That is basically ONE MASSIVE SHIT!!!!!!!<br /><br />THE STICKY - When you have a poo stuck onto the hairs of your crack and requires hours of wiping (maybe a pair of scissors)","time":1444007463346},"poop":{"definition":"Bodily waste of varying color, viscosity, shape, odor and texture. Usually exits the body through your pooper, speed, noise and degree of pain may vary depending on what you ate. ","time":1444007468259},"poopoo":{"definition":"A substance (usually brown) very much like logs that is the result of digested food. It comes out of your anus as you sit on the can. It can also come out of your anus at any other given time.<br />see [poop] or [shit]","time":1444007472693},"pooppoop":{"definition":"It is mostly used as a greeting or a goodbye.  Poop poop is a noun describing someone in your life. So it takes the place of....buddy, pal, dude, brother, sister, father, mother ...etc. ","time":1444007483908},"wetpoop":{"definition":"poop that isnt solid. wet poop normally occurs after a long night of drinking<br />","time":1444007506736},"rof":{"definition":"Acronym for Roll on the floor starving.","time":1444007548564},"fucku":{"definition":"fuck you<br /><br />comeback:Fuck urself its cheaper<br />2nd comback if somone say combac 1 to u: I prefer the expensive way","time":1444007670912},"fuckyou":{"definition":"An expression of contempt.<br /><br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1444007676217},"no":{"definition":"The word that makes sex rape.","time":1444007681343},"yomomma":{"definition":"The answer to any question, when the correct answer could not be attained at the present time.","time":1444007685189},"yes":{"definition":"1) An affirmative answer to a question, the opposite of no.<br />2) An expletive shouted out during an orgasm.<br />3) A British [progressive rock] (or [art rock]) group known for their hits &quot;Roundabout&quot; and &quot;Owner of a Lonely Heart&quot;.<br />4) A brand of laundry detergent in the US.","time":1444007694834},"sperm":{"definition":"white squiggly liquid which causes your life to be ruined when reaches womans egg","time":1444007956277},"eggs":{"definition":"White on the outside, yellow on the inside. A whiter person who wants to be asian.","time":1444007979352},"versus":{"definition":"<br />Abbreviation: [VS].<br /><br />1. Against someone or something, especially in a competition or court case.<br /><br />2. Alternative to something: as opposed to or contrasted with such considerations as money versus job satisfaction.<br />","time":1444008002827},"lennyface":{"definition":"A unicode emoticon used when something might be edgy.<br />( ͡° ͜ʖ ͡°)","time":1444008564740},"hate":{"definition":"a special kind of love given to people who suck","time":1444008951633},"deeznuts":{"definition":"1) A sarcastic expression used to denote annoyance or frustration.<br />2) A term used when you just dont give a fuck<br />3) Look, my dick and balls are bigger than yours.","time":1444008960809},"njk":{"definition":"Not just kidding.","time":1444009097325},"hjk":{"definition":"Hilary J&apos;s Kid<br />A man who owns a girly car and is generally a loser. Might even have these initials in his registration plate.","time":1444009100082},"creatine":{"definition":"A high-energy, naturally occurring compound known as creatine phosphate that is widely used (totally legal) as a supplement to enhance athletic performance and&#x2f;or muscle gain.  It is most popular as a white powder which is mixed with juice or water.  It can also be taken as a serum or in pill form.  Side effects include a weight gain of 5-10 lbs, bloating (if you don&apos;t drink enough water), and increased chest size.  The good effects will only be seen when combined with a serious workout regiment.","time":1444009162375},"whp":{"definition":"Warm Hole Provider.<br /><br />A woman who you really don&apos;t care about at all, besides the fact that she provides you with a warm hole every once in a while.","time":1444009279201},"phone":{"definition":"that annoying thing that wakes u up in the middle of the night just because ur idiot friend  broke up with her loser boyfriend.","time":1444009402604},"bush":{"definition":"The only presendent of the United States of America to be all most assassinated by a pretzil.","time":1444010051395},"owo":{"definition":"Oral WithOut [condom]. The practise of giving oral sex without the use of a condom, usually by a [hooker] and resulting in [cim].","time":1444010325301},"^":{"definition":"Very useful signal that is typed when one pushes Shift and 6. It has many uses, some of which include:<br />1- An eye for the following emoticons: ^_^ and  ^*^<br /><br />2- A caret (symbol denoting that something is to be inserted somewhere)<br /><br />3- Upwards arrow<br /><br />4- Showing exponents (7^.5597)<br /><br />5. Goes over random letters (usually vowels) in the French, German, and Hungarian languages (aka the circumflex)","time":1444010363803},"rumble":{"definition":"A huge brawl involving many people.","time":1444010628844},"bokunopico":{"definition":"During summer vacation, Tamotsu is on break from work happens to visit a particular café. It is at this café that Tamotsu meets Pico, who works there for his grandfather. Tamotsu instantly falls for Pico, believing that Pico is a girl because of his feminine appearance. However, to his disbelief, Pico claims he actually is a guy. Undeterred, Tamotsu pursues a sexual relationship with Pico, to an extent where he even persuades Pico into wearing girl clothes. When Pico asks what is he to Tamotsu, he finds himself unable to answer...","time":1444011103135},"molly":{"definition":"Abr. of &apos;molecular&apos;.<br /><br />Pure form of MDMA (ecstasy), usually a free powder or in capsules. Oftentimes MDA is sold as molly. Should be white in color (when it&apos;s pure) but is more often beige or yellow-brown, and sometimes brown or rarely gray.","time":1444011130164},"penis":{"definition":"The tool used to wean and convert lesbians and virgins into useful, productive members of society.","time":1444011317018},"fuckboi":{"definition":"A guy who tries to get with everyone. A player. A guy who will lie to a girl to make them hook up with them or send pics. They think they are the shit when they aren&apos;t. A guy who will only date a girl for their body. A total ass. A guy that will make a girl cry and laugh, and a guy who lies when they said I love you","time":1444011350194},"chupacabra":{"definition":"A creature also known as a &apos;Goat Sucker&apos; simply because it drains the blood and body fluids out of goats, leaving them dry and lifeless. <br />Some people believe it came from another planet. Some say it looks much like a kangaroo. ","time":1444011365575},"svs":{"definition":"also known as shallow vag syndrome.  Is the condition of having a shallow vagina.","time":1444011370032},"minimod":{"definition":"A normal forum poster that takes it upon themselves to push forum rules and tell everybody how to conduct themselves instead of leaving it up to the mods. Typically reserved for people that don&apos;t know what they&apos;re talking about, act like they have some kind of authority, and&#x2f;or are obviously doing what they&apos;re doing to try to score points with the real mods and become moderators themselves. (especially if it becomes a regular thing for them and&#x2f;or they don&apos;t contribute much good to the community otherwise)","time":1444011597642},"enervate":{"definition":"A object steal B&apos;s energy. B will be no longer acting briskly than A. <br />Now, A is commander of B.","time":1444012277171},"hmu":{"definition":"Hold my unicorn.","time":1444012325430},"lesbo":{"definition":"A women who is homosexual. One that likes to have sexual encounters with other women. Gay women. (See [lesbian])","time":1444012364895},"alive":{"definition":"not dead","time":1444014509024},"died":{"definition":"A term used when a person has laughed so hard that they &quot;almost died&quot;.","time":1444014564638},"die":{"definition":"the process of no longer being alive.","time":1444014571725},"kia":{"definition":"1) Killed in Action<br />2) Sexual activity stopped by the appearance of a parent, cop, or other person","time":1444014575983},"mia":{"definition":"She is a crazy girl. Makes jokes most people do not understand. She is veryyyy pretty and has nice eyes. You will be stunned when you meet a Mia.","time":1444014587995},"cunt":{"definition":"Derogatory term for a woman.  Considered by many to be the most offensive word in the English language.","time":1444014632553},"boy":{"definition":"an animal that can talk","time":1444014769849},"soma":{"definition":"A drug used in Huxley&apos;s futuristic utopian novel &quot;Brave New World.&quot; The substance is supposed to have the affect of modern drugs, yet no side-effects. Could describe bliss, oblivion, pure love, or pure utopia.","time":1444014773440},"girl":{"definition":"A younger form of a woman. If you tried to have sex with a girl, you&apos;d be arrested, you damn pedophile.","time":1444014788722},"sai":{"definition":"An extremely good looking male who bears (what some men consider a gift) the curse of entrancing sexiness. He, without any effort, will make ANY woman fall in love with him. Whether the woman be a straight, lesbian, transgender, a crossdresser, or a man who desperatly longs for womanly parts, she (or he) will fall in love with the suave composure of a Sai. Beware when around this individual. You will lose your girlfriend&#x2f;wife, sister, mother, aunt and even your grandmother. Sex is a Sai&apos;s greatest weapon even though he unknowingly wields it.","time":1444015153203},"ily":{"definition":"I Love you","time":1444015199570},"gitgud":{"definition":"To get better. To &quot;Get Good&quot;.","time":1444015437491},"asshat":{"definition":"One who has their head up their ass. Thus wearing their ass as a hat. Asshat","time":1444015599880},"wood":{"definition":"Something hard that you must rub regularly to keep shiny. Wood can be found in lots of places, like in your son or daughter&apos;s bedroom. You can do many things with wood, like knock it, pound it or sit on it. People often enjoy using their wood, usually for productive activities or fun and entertainment.","time":1444015608386},"yuri":{"definition":"1. Explicit lesbian relationships in anime or manga<br />2.To be the first to do something. Derived from Yuri Gagarin, first human in space. ","time":1444016812866},"swell":{"definition":"adj.  Fantastic, great, wonderful, et.","time":1444017048924},"putytang":{"definition":"looking at a girls but and crotch","time":1444017847752},"tyrone":{"definition":"Proper noun: Tyrone is the general name for a black male whose true name is unknown. Unlike offensive generic names, like Toby or Kunta Kinte, the name Tyrone does not mean to carry an offensive quality.<br /><br />Also, the term can be used as a unit of measurment in reference to black males.","time":1444017851850},"twerks":{"definition":"The rhythmic gyrating of the lower fleshy extremities in a lascivious manner with the intent to elicit sexual arousal or laughter in ones intended audience","time":1444021936921},"yeet":{"definition":"Term used to express excitement; especially used in basketball when someone has shot a three-pointer that they are sure will go in the hoop. <br />Also used as one ejaculates.<br />Can be used as an exclamatory (YEET!), or a verb (to yeet someone) ","time":1444021977235},"dougie":{"definition":"Swag, Swagger<br /><br />originated in Dallas","time":1444024678104},"arana":{"definition":"spider","time":1444024976983},"cana":{"definition":"A type of deep, lesbian love. ","time":1444024983059},"forehead":{"definition":"The proper area on which to apply HeadOn.","time":1444025392570},"forhead":{"definition":"Having four chicks drooling all over your tool.","time":1444025404539},"fourhead":{"definition":"a forehead that is covered with the four digits of one&apos;s own hand. if the fifth digit, the thumb, is also needed to cover the forehead it is called a fivehead.","time":1444025418534},"chav":{"definition":"Picture this a young lad about 12 years of age and 4 ½ feet high baseball cap at ninety degrees in a imitation addidas tracksuit, with trouser legs tucked into his socks (of course, is definitely the height of fashion). This lad is strutting around, fag in one hand jewellery al over the over, outside McDonalds acting as if he is 8 foot tall and built like a rugby player, when some poor unsuspecting adult (about 17&#x2f;18) walks round the corner wanting to go to mcdonalds for his dinner glances at the young lad, the young lad jumps up in complete disgust and says “Whats your problem? Wanna make sommin of it? Bling Bling” when the adult starts to walk towards the young lad, the young lad pisses himself and runs off to either his pregnant 14-year-old girlfriend or his brother in the army crying his eyes out.","time":1444026291951},"pdh":{"definition":"Short for Palm Desert High School. Home of the most beautiful girls in the coachella valley, and the most athletic guys the desert has to offer. The football team isn&apos;t very good, but the school has so much spirit, it makes up for it. This school has been nicknamed &quot;STDPD&quot; because nearly all of the girls there are very easy to hook-up with. This school has more drugs than their rival school LQHS (La Quinta High School) but the only differance is that Palm Desert has so much money, they find a way to hide that. Most of the kids their started using drugs in their middle school years at pdms (now pdcms, palm desert charter middle school) All of the girls at PD dress like sluts to get attention. PD kids are known for their parties though- who would&apos;a guessed? Throughout the whole valley, teens talk about Palm Deserts Parties.. maybe because at these events, drugs and alchohal are always provided. Too many of these gorgeous girls lost their virginity before freshman year aswell, to the many heart breaking guys at Palm Desert. The smart girls will choose to pick someone who doesn&apos;t go to PD. I feel bad for all of these teens&apos; parents, spending so much time and money for each of these children to be screw ups. Palm Desert isn&apos;t a cheap place to live, and all of these kids will soon find this out after they realize that these are their last four years of being a child.","time":1444027002414},"ria":{"definition":"The most Beautiful Girl in the World.","time":1444027059652},"devils":{"definition":"Arch Angel Lucifer<br />As a biproduct of Lucifers jealously of god, he was cast out of heaven and took 1&#x2f;3 of all angels with him.  These 1&#x2f;3 angels were damned willingly and unfaithfully to god.  Lucifer was holy but angels too can go on their own volition, thus becoming fallen angels but unlike humans, cannot be redeemed like human kind.","time":1444027130565},"kat":{"definition":"Term refering to the hottest woman in the room.","time":1444027218918},"foreveralone":{"definition":"The relationship status of most people on Tumblr.","time":1444027235411},"shrimp":{"definition":"A person that is hot from the neck down. So called because, like shrimps, everything is good but the head.<br />","time":1444027260646},"rianna":{"definition":"A girl that laughs alot and can sing with awesomeness. Mostly always talented in different ways. Rebel and can jump really high. Hated and loved by different clicks. Good kid.","time":1444027270969},"johncena":{"definition":"Right as you cum while getting a blowjob, pull out of her mouth and blow your load right into her eyes. <br /><br />Proceed to wave your hand in front of your face and go &quot;YOU CAN&apos;T SEE ME!&quot;","time":1444027295568},"rian":{"definition":"The name of the most incredibly sexy, smart, sweet, hot, irrisistible, passionate, and lovable man in the universe.  He knows how to treat a girl right!  ","time":1444027340138},"inferior":{"definition":"adj. <br />Low or lower in order, degree, or rank<br /><br />n. <br />A person lower in rank, status, or accomplishment than another. ","time":1444028534301},"dafuq":{"definition":"[what the fuck] , but in a more confused manner","time":1444029781598},"ip":{"definition":"1. Internet Protocol, or Internet Protocal Address(IP Address), commonly used for various means of communication.<br />2. In Progress. Often used in old RTS games, such as WarCraft II.","time":1444038122187},"nt":{"definition":"This word is very popular in online gaming nowadays.This abbrieviation simply means:<br /><br />Nice try.","time":1444038614179},"n":{"definition":"Arguably the best free Flash game ever created.  The game is a platformer by genre, with a few puzzle elements that come from the stunts you must pull involving jumps.  N stands for Ninja, as you play a small stick figure ninja who is capable of running at very high speed, wall jumping, and jumping very long distances.  The game has staying power due to the users&apos; ability to make their own maps as well as play the levels other people create, though it could be months before you get through all the normal game&apos;s levels.<br /><br />You must avoid a variety of enemies, all of which kill you brutally and violently (though it couldn&apos;t be called disturbing, he&apos;s only a stick figure) which is made extra entertaining due to the game&apos;s physics engine.","time":1444038744552},"y":{"definition":"Depending on the context it can mean either why or yes.","time":1444038748584},"yus":{"definition":"Synonym of &quot;yes&quot;.","time":1444038757067},"yas":{"definition":"A Glaswegian expression used to make others aware of extreme satisfaction. Would generally be exclaimed if the speaker had achieved something or had been given&#x2f;granted something which gave them pleasure or brought them happiness.","time":1444038762150},"anime":{"definition":"noun:  a style of animation that originated and is still heavily centered in Japan.<br /><br />The word &apos;anime&apos; is based on the original japanese pronunciation of the american word &apos;animation.&apos;<br /><br />The stereotype of the anime style are characters with proportionally large eyes and hair styles and colors that are very colorful and exotic.  The plots range from very immature (kiddy stuff), through teenage level, to mature (violence, content, thick plot).  The classification of &apos;hentai&apos; is given to animes of a stong sexual nature.<br /><br />Although over 95% of anime has nothing perverted about it, most closed-minded idiots think anime is always a form of pronography.","time":1444043121510},"gordo":{"definition":"It&apos;s spanish for &quot;Fat&quot;","time":1444044266492},"mfw":{"definition":"Abbreviation for &quot;my face when","time":1444044539625},"ict":{"definition":"Information Communications Technology<br /> <br />a strange and unclear term for computers, made to sound more interesting by shoving everything with a processor under its label. Looked down on by Computing people as its really a load of theoretical shit","time":1444046882014},"it":{"definition":"The word the Knights of Ni cannot hear or say.","time":1444046897132},"fbgm":{"definition":"Fuck Bitches, Get Money.<br /><br />A way of life.<br /><br />Another way of saying Bros Before Hoes.<br /><br />The word money is simply a metaphor for wealth: Fuck Bitches, Get Metaphor.","time":1444047721422},"zlatan":{"definition":"The nice guy down the street. Acts simple minded, but is actually pretty smart. Party animal at time, and other times quiet and a romantic.","time":1444049406633},"dum":{"definition":"The way morons type the word dumb","time":1444049982707},"mud":{"definition":"Multiple Username Disorder: A condition that compels those inflicted to create a multitude of aliases on websites such as &apos;IMDb&apos;, in order to praise or defend their own message-board posts -- the ultimate goal being to elevate these aliases to becoming the board leaders, and thereby controlling all topics of discussion. Often, the MUD sufferer will create lengthy message-board threads, in which the posts are entirely by his&#x2f;her imaginary correspondents.","time":1444050733781},"rachel":{"definition":"A smart, sassy and sexy young woman who knows things from fashion to film to literature, from Manolo Blahniks to Mahatma Gandhi.","time":1444050735721},"adela":{"definition":"a girl who has a great heart and a wonderful mind and is amazingly hott","time":1444050743167},"sian":{"definition":"Perfection. Total Perfection.","time":1444050751248},"bailey":{"definition":"the most amazing girl you will ever meet. very musical and super sweet... also amazingly beautiful even though she doesnt believe it","time":1444050753333},"marlen":{"definition":"German in origin<br />Pronounced mar-LEEN  Adj:<br />Meaning : One brought forth by the angels. Beauty bestowed upon her by God.<br />A beauty others wish for.","time":1444050806535},"karina":{"definition":"Karina is a girl&apos;s name of Scandinavian origin. It means &quot;pure&quot; of &quot;loved&quot;. Karina is artistic and outgoing, she loves music. She also likes to party and have fun with friends. She likes apples! Karina tends to trust anyone, thereby she gets hurt a lot. Karina takes relationships seriously and she&apos;ll never hurt a guy she loves. For Karina: Opposites do attract!","time":1444050813338},"fa":{"definition":"A Fat Admirer, or a guy with a preference towards big girls [BBW]s. And yes, they do exist, and no, a FA is not the same as a [feeder]. Contrary to popular belief, Fat Admiration is not a fetish, it&apos;s no different to a preference for redheads or short girls.","time":1444052038236},"rookie":{"definition":"A Beginner. A starter. Somebody that just doing or trying something for the first time","time":1444052339577},"scrub":{"definition":"A scrub is a guy that thinks he&apos;s fly<br />And is also known as a buster<br />Always talkin&apos; about what he wants<br />And just sits on his broke ass<br />A scrub is a guy that cant get no love from me<br />Hanging out the passenger side<br />Of his best-friend&apos;s ride<br />Trying to holler at me<br />","time":1444052370814},"stingy":{"definition":"reluctant to part with or share cash, food, drink, or any other items. [tight]or[cheap].","time":1444052855269},"senti":{"definition":"Senti is a slang word in Oriya language largely spoken in the east Indian state of Odisha. Senti means clitoris, the sensitive organ just abve the opening of a woman&apos;s vagina.","time":1444054479522},"hoes":{"definition":"A word Santa Clause says three times when he sees your wife, mother and sister together in the same room.","time":1444054491096},"dh":{"definition":"dear husband","time":1444055558125},"klk":{"definition":"short form for &quot;que lo que&quot; most of the time use in messenger.","time":1444055614659},"slug":{"definition":"Bullets","time":1444055674966},"ho":{"definition":"A word Santa Clause says three times when he sees your wife, mother and sister together in the same room.","time":1444056085933},"queloque":{"definition":"Dominican greeting.<br /><br />1. What&apos;s up","time":1444056514439},"fucker":{"definition":"one who is rude, obnoxious, or mean....synonomous with Asshole, Dickhead,ect.","time":1444056529681},"sonofa...":{"definition":"an exclamation<br />usually when getting hurt or finding out bad news","time":1444056546144},"sonofabitch":{"definition":"The Funniest Thing Your Mom Can Call You.","time":1444056572368},"gimmick":{"definition":"A method of gaining customers or attracting attention by accentuating a certain trait&#x2f;quality.","time":1444057346094},"ld":{"definition":"Long Dick","time":1444057833668},"stahp":{"definition":"In memes simply stop, usually meaning stop doing something horribly wrong.","time":1444058175370},"ffs":{"definition":"Acronym for, for fuck&apos;s sake.","time":1444058395778},"jls":{"definition":"A Boy Band that were runners up in the X factor. They are popular among pre teen girls and like to take their shirts off. Despite their entire fanbase being under the age of 12 they still like to sing about sex and how they all like Penis.  They also have random colour schemes of green, yellow, blue and red so anyone wearing one of their hoodies looks like a [teletubby].  Despite this they have had 3 UK number ones and a rabid fanbase of [tweens] and their mothers who think they are the [Chippendales]","time":1444059528287},";x":{"definition":"A combination of [;)] and [:x], but used mainly by people who are too lazy to hit the shift key.  The lips are sealed, and it&apos;s winking conspicously, as saying that it will not speak.","time":1444059596820},"janky":{"definition":"(adjective) inferior quality; held in low social regard; old and delapidated; refers almost exclusively to inanimate material objects, not to people","time":1444060822295},".~.":{"definition":"cutest face in the world","time":1444061913827},"candi":{"definition":"Sweet sassy and innocent, underneath is a wild little girlie dying to get out, always honest and will tell it you","time":1444062336338},"timhortons":{"definition":"A cult religion based on caffeine and baked goods. I swear they put something in that coffee.","time":1444062354969},"nrv":{"definition":"negro radar vision.  when you can sense a hot, black person has entered the room.","time":1444062565843},"vpn":{"definition":"Virtual Private Network<br /><br />A network using a streaming source (usually the [internet]) to connect a private network of computers spread across a large area.","time":1444063984791},"youjustactivatedmytrapcard":{"definition":"A catch phrase that came from the Yu-Gi-Oh Trading Card game, and is usually said when someone is about to get owned, with complete confidence.","time":1444064166051},"ftw":{"definition":"&quot;For The Win.&quot;<br /><br />An enthusiastic emphasis to the end of a comment, message, or post. Sometimes genuine, but often sarcastic.<br /><br />Originated from the game show Hollywood Squares where the result of the player&apos;s response is expected to win the game.","time":1444066507504},"gravity":{"definition":"Shit that keeps you on the ground","time":1444067356543},"wraith":{"definition":"A once living person, who is made [undead] without passing through [death]. A wraith is the only form of undead not made so through animation (the process of giving lifelike qualities to the recently dead).","time":1444068124189},"ba'al":{"definition":"The final boss on Diablo II, can only be fought if you have the Lord of Destruction expansion pack. Has the coolest, wittiest voice in the whole game, the Druid being a distant second.","time":1444068197830},"yuyuko":{"definition":"1.- A way to say &quot;Ass&quot; in mexican slang  2.- touhou project character  3.- way to annoy yuyuko with ass related jokes","time":1444068299917},"slutty":{"definition":"Adjective used to describe a woman who acts like a whore.","time":1444068351079},"-_-":{"definition":"emoticon symboilizing a sigh, usually a sigh of disgust","time":1444068446279},"thenextlevel":{"definition":"The point at which a new era in hip-hop is defined. These levels are always achieved first by [Dr. Dre].","time":1444068599037},"strawberrymilkshake":{"definition":"After giving a girl (or guy) a nice big facial, the reciever punches the giver in the nose. The mix of semen and blood looks like a strawberry milkshake.","time":1444068674226},"afaik":{"definition":"as far as i know","time":1444068892516},"eat":{"definition":"1)chewing food...than swallowing it is one definition<br />2)or basically lick someone&apos;s vagina<br />...yuck","time":1444068902232},"hw":{"definition":"Short for [homework], which is annoying but will prevent you from working behind the counter at your local McDonald&apos;s or Wal-Mart when done.","time":1444069157327},"svp":{"definition":"SEE-VU-PLAY<br /><br />S&apos;il Vous Plait<br /><br />If you please.<br /><br />Used for sounding elegant.","time":1444069447342},"fr":{"definition":"For Real","time":1444069681935},"nub":{"definition":"one who sucks at a particular video game, they are not new to the game, but possess some determent that prevents them from playing well, no matter how long they practice playing the game.<br />synonyms- a Dan Wood, noob, newbie, newb<br />antonyms- an Alex, elite, 1337, leet","time":1444069869281},"9inch":{"definition":"What a man says when hes to embarrassed to say his real size","time":1444071221936},"nineinch":{"definition":"1) Size of an extraordinarily large penis.<br /><br />2) Less than one percent of all males make up this category.","time":1444071230550},"pavlov'sdog":{"definition":"In 1927, Ivan Pavlov experimented with his dog on the subject of psychological training--specifically conditional stimuli and response. He found that when he rang a bell each time before he fed his dog, the dog no longer salivated in response to the food, but to the bell.","time":1444072218562},"pavlov'scat":{"definition":"A squirter; gusher (a chic who gets very wet before any action starts)","time":1444072222066},"schroedingerscat":{"definition":"A cat which is neither alive nor dead, but rather in a state of stasis, in a box.  There is also in the box a geiger counter and a tiny radioactive particle, the counter wired to a vial of hydrochloric acid (that got your attention).  After a set amount of time, the particle is 50% likely to decay, setting off a mechanism triggered by the geiger counter which smashes the vial and kills the cat.  Supposedly, after that set amount of time, if no one looks in the box, the whole system is in a state of stasis because the cat is 50% likely to be alive and 505 likely to be dead, and is thus neither alive nor dead, but both.  At least, until someone opens rhe box.  There are all sorts of conundrums associated with this thesis, and it is very controversial.","time":1444072265665},"wym":{"definition":"(Phrase) Meaning &quot;I&apos;m too lazy to type out &apos;what you mean?&apos;&quot;","time":1444072495034},"veggietales":{"definition":"The funniest animated movies in the world. They tell various Bible stories through characters that are vegetables as opposed to humans, such as Bob the Tomato and Larry the Cucumber.<br /><br />The funniest however, is the parody they made of Lord of the Rings called &quot;Lord of the Beans&quot;.","time":1444074184033},"rex":{"definition":"See [awsome], [sexy], [super-sexy sex god], or [Dog]. He way too sexy, almost too sexy for his own good. Is the father of several love-children. Mother really liked dog-names.","time":1444074301978},"dog":{"definition":"Not a [cat].<br /><br />Gotta love Blackadder.<br />","time":1444074341522},"zero":{"definition":"1. The number 0, nothing.<br /><br />2. The name of a Japanese Kamikaze Aeroplane. <br /><br />3.One of the cool names people love to use.<br /><br />4.Zackenberg Ecological Research Operations <br /><br />5.Zoning and Emotional Range Omitted (anime) <br /><br />6.Name of an A-class (now S) Maverick Hunter and X&apos;s best friend in the Megaman&#x2f;Rockman X series. He also features in his own series, Megaman Zero. He have several names given by the fans such as the Crimson Devil, Captain Kamikaze and Zero Omega. He is also the last Wilybot (robots constructed by Dr.Wily) and he&apos;s the original carrier of the Maverick Virus.<br />He&apos;s famous for his long, long, loooong blond hair, red armour and his sabre. Earlier on, he&apos;s famous for his devil-may-care attitude and rather reckless style. Now he&apos;s cool and clear-headed, particularly after Iris died.<br />Living up to his name, in the first X game he self-destructed to save X&apos;s life from Vile. He came back in the second game, and sacrificed himself AGAIN in the fifth. But he still came back in the next instalment.<br />In the Zero series which is set after 100 years of the X series, he&apos;s the main hero, helping the rebels to fight against an anarchy rule. Only time will tell to reveal if he&apos;s the true Zero...or not.<br />However, without doubt, Inafune the creator os Zero obviously shows he loves Zero more...*sob*","time":1444074367122},"nothing":{"definition":"Actually means &quot;something,&quot; but is used when you don&apos;t feel like explaining.","time":1444074411181},"treason":{"definition":"Treason against the United States, shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort. No Person shall be convicted of Treason unless on the Testimony of two Witnesses to the same overt Act, or on Confession in open Court.<br />(United States Constitution)","time":1444075542148},"neighborhood":{"definition":"Where Mr. Rogers lives<br /><br />not to be confused with the neighborhood of make believe where Mr. Rogers teaches us lessons with puppets...very creepy, disturbing puppets...<br /><br />[nuff] said<br />","time":1444075652443},"roster":{"definition":"list of people in which a person has had sex with","time":1444075993095},"m9":{"definition":"Commonly thought of as mistakes on messenger services, however the terms are both equivalent to M8 - obviously an abbrieviation of the word &quot;mate&quot;. ","time":1444076137904},"gallo":{"definition":"a type of Guatemalan beer, in the United States it is known as &quot;Famosa&quot;. It is Guatemala&apos;s oldest continually produced beer, dating back to 1896. It is also the most famous beer in the country, and has become part of Guatemalan popular culture. It also has a chicken on the bottle because gallo means chicken in spanish.<br />","time":1444077116892},"gawn":{"definition":"1. [&apos;strain] for gone, usually shouted.<br />2. A description of someone who has way too many drinks.","time":1444077475090},"-3-":{"definition":"a computer *Kissy Face ","time":1444077806761},"freshmen":{"definition":"A first-year student at a high school or university. Tends to travel in large packs for protection.","time":1444078047020},"benis":{"definition":"[Benis] is to refer to ones entire package. Balls &amp; Penis.","time":1444078375124},"mama":{"definition":"a very attractive woman","time":1444078478665},"fullstop":{"definition":"The British term for the punctuation mark most commonly found at the end of a sentence[.]  <br /><br />The moment when the vehicle you are driving is no longer in motion; an instant of equilibrium achieved between [decelerating] before a stop sign and [accelerating] seconds later; the second in which any ornaments or [fuzzy dice] hanging from the [rearview mirror] are perpendicular to the ground.","time":1444078490007},"dad":{"definition":"The parent that takes the most shit. Sure, if you had a shitty father, then go ahead and bitch, but not all of us did. Some of us had great fathers, who really loved us, and weren&apos;t assholes. Honestly, if you could see how much damage a mother could do to one&apos;s self esteem, you wouldn&apos;t even place so much blame on &quot;dear old dad&quot;","time":1444078495817},"coates":{"definition":"The most dominant of all types of people. Well versed and extremely good-looking. Humorous by nature with a desire to party.","time":1444078500651},"wiener":{"definition":"the proper spelling of &quot;weiner&quot;... morons.<br /><br />another name for PENIS, but a more comical way of expressing the term","time":1444078662529},"preference":{"definition":"A private club for all good &quot;Ganter&quot; to happen mostly from &quot;Da Boiyz&quot;...","time":1444078780188},"bt":{"definition":"(n.) acronym for &quot;big tits&quot;; only acceptable for use when interchangable with one&apos;s name, as if a nickname, i.e. used only in the place of a name, specifically that of a female with large breasts (exs.: inappropriate use - That woman has B.T.; appropriate use - I have a date with B.T.)","time":1444079368013},"pussy":{"definition":"The box a dick comes in","time":1444079437718},"ding":{"definition":"Phrase commonly used in online RPGs to signifiy gaining one level of experience.","time":1444079557707},"sanic":{"definition":"Sanic usually refers to ear rape or other forms of extremely loud spam. Derives from the YouTube video &quot;HOW 2 DRAW SANIC HEGEHOG&quot; in which the uploader draws an extremely mediocre Sonic the Hedgehog while a messed up version of music from the Green Hill Zone stage.<br />Spinoffs include &quot;HOW 2 DRAW MAREO BROTER&quot;, &quot;HOW 2 DRAW: HOMRE SIMSON&quot;, and &quot;HOW 2 DRAW LEFEND ZEDLA&quot;","time":1444079643282},"clash":{"definition":"to clash is to have an mc battle<br />To have a insult match with rymes and songs","time":1444080176886},"sex":{"definition":"What kind of moron are you that you look up sex in the urban dictionary?","time":1444080518657},"lick":{"definition":"a noun, slang for robberies","time":1444080949495},"exodus":{"definition":"Popular 80&apos;s [word]thrash[&#x2f;word] metal band with hits like &quot;Toxic Waltz&quot; and &quot;Pirahna.&quot; A lot  more violent than Metallica were in their heyday, but still s second-tier act similar to Testament. ","time":1444081256496},"exodia":{"definition":"A rather uncommon term used to describe someone with unstoppable, or godlike abilities in his particular field, such as Babe Ruth or Donald Trump etc. <br /><br />The term has taken new meaning in the Yu-Gi-Oh! card game and anime as the name of the most powerful of all monsters: Exodia the Forbidden One. Actually the sealed &quot;ka&quot; or soul of the ancient pharoah, once all five of Exodia&apos;s forbidden pieces are assembled in a duel, Exodia is summoned to obliterate the players current opponent and is undefeatable. In the shadow realm, Exodia is the embodiment of Yami Yugi&apos;s soul. ","time":1444081260003},"exist":{"definition":"Something worthy of positive acknowledgement is said to exist.<br />Synonyms: rule, kick ass","time":1444081534981},"nacl":{"definition":"Used to call someone [salty]. Which is being upset or pissed about something.<br />Instead of calling someone &quot;salty&quot; Nacl (pronounced nah-cal) is used because NaCl is a common salt.","time":1444081745969},"suite":{"definition":"A set of orchestral or instrumental pieces combined into one piece.","time":1444082087746},"mixtape":{"definition":"underground cd&apos;s, etc. than usually contain freestyles&#x2f;remixes&#x2f;instrumentals or real songs before they hit mainstream (minus the dj yelling)","time":1444082090227},"ig":{"definition":"Shortened form of &quot;Instagram.&quot;","time":1444082856228},"chips":{"definition":"money (probably from the chips used in casino gambling)","time":1444083724947},"quartz":{"definition":"A mineral SiO2 consisting of a silicon dioxide that occurs in colorless and transparent of colored hexagonal crystals and also in crystalline masses","time":1444083737474},"sodiumchloride":{"definition":"The chemical name for table salt. consists of a Sodium atom and 1 Chlorine atom ionically bonded.","time":1444083748272},"ambitious":{"definition":"Trying hard to take on a goal of some kind<br /><br />** the goal usually is way to hard to accomplish and the ambitious person usually ends up only half-way there**","time":1444085658485},"tryhard":{"definition":"A person who puts a large amount of effort into achieving a certain image, or counter-image, to the point where it is obviously contrived. Rather than achieving an image through genuine personality, the try-hard consciously attempts to fit a certain style through deliberate imitation, forced style, or scripted behavior. That is to say, he&#x2f;she is trying hard to create an image.<br />","time":1444085683045},"dms":{"definition":"Dirty Money Syndicate, Drugs Money Sex, Droppin Many Suckas.<br /><br />Nation wide crew originating in NYC.  <br />Some bands associated include : Madball, Skarhead, Crown of Thornz, Icepick, Agnostic Front, Vietnom...","time":1444086011563},"n.n":{"definition":"nn literially means night night, but maybe used as &quot;cya&quot;<br />","time":1444086034522},"kg":{"definition":"The act of licking the sensitive area between the ball sac and the anus.","time":1444086224580},"gucci":{"definition":"Good, chill, cool, awesome...<br />Comes from Gucci as in the fashion label... because Gucci is rich and ballin&apos; therefore he is good, cool, and just pimpin&apos;","time":1444086492666},"lvl":{"definition":"lvl=level<br /><br />Often uses when talking about computer games, often rpg ([rpg]) games.","time":1444086515960},"arcteryx":{"definition":"A Canadian brand of technical outerwear valued by literally any professional mountain guide, rock climber, or ice climber.  While the North Face has become the Abercrombie and Fitch of Outerwear, Arc&apos;Teryx keeps a low profile and can be seen warming up many of the top outdoor athletes in the world.  If you see someone wearing an Arc&apos;teryx jacket, it has likely actually seen the rugged outdoors since even yuppies are unlikely to pay $500 for a jacket while they would be fine dropping $150 for a North Face fleece despite the fact the Arc&apos;Teryx jacket is literally worth the $500.  Also, anybody with an Arc&apos;Teryx softshell or jacket will brag about temperature ranges in celsius because they&apos;re too cool for fahrenheit.  The brand is named after the oldest bird currently known to man: the Archaeopteryx.","time":1444086669673},"nein":{"definition":"German for &quot;No&quot;","time":1444086807678},"ya":{"definition":"Acceptable:  Replacement for &quot;you&quot;<br />Unacceptable:  Replacement for &quot;yeah&quot; <br /><br />The first definition is correct, because &quot;ya&quot; is actually how a lot of people pronounce &quot;you&quot; in a casual conversation.<br /><br />But using it as &quot;yeah&quot; is incorrect and stupid, because nobody in real life pronounces yeah like &quot;ya&quot;.  The only people who type it that way are people under 25 who are trying to be cool and fit in with the rest of their e-buddies and Myspace losers.<br /><br />A lot of them make the excuse that it&apos;s easier to type &quot;ya&quot; than &quot;yeah&quot;.   Yeah right.   It&apos;s just their way of hiding the fact that they&apos;re trying to be cool and fit in on whatever board&#x2f;forum they&apos;re posting on.<br /><br />At least things like &quot;orly&quot; and &quot;kthx&quot; are funny......&quot;ya&quot; is not.   It&apos;s just dumb.<br /><br />By the way, expect all my votes to be negative, because they&apos;re all mad that I&apos;m right.<br /><br />P.S.  go read a book instead of wasting time surfing the net or playing video games......you might learn something.","time":1444086813227},"niggapunch":{"definition":"To punch a sleeping friend, then to act as if you were sleeping so they didnt know who did it.<br />happens to george.","time":1444086875369},"magic":{"definition":"My other answer to everything.","time":1444086892380},"science":{"definition":"Something that works, bitches.","time":1444086906314},"nigger":{"definition":"A fully grown niglet","time":1444086928562},"chickenburger":{"definition":"To smear the bum - cheeks and anus on to the face of another person.","time":1444087002305},"cheeseburger":{"definition":"An American-style entree consisting of a patty of grilled, fried, or seared ground beef topped by a slice of cheese, wrapped with two halves of a bun.  Common cheeses include American, Cheddar, and Pepper Jack.  Buns are generally of the White, Potatoe, or Sesame variety.","time":1444087014271},"fnaf":{"definition":"fnaf is short for &quot; [Five night&apos;s at Freddys]&quot;, a horror game by Scott Cawthon","time":1444087024971},"filetofish":{"definition":"it&apos;s the Catholic Big Mac.","time":1444087035572},"bigmac":{"definition":"Two all beef patties, special sauce, lettuce, cheese, pickles, onions on a sesame seed bun.","time":1444087047060},"plum":{"definition":"A plum is also a person who is a symbol of peace. There are the Bloods, who are red, and the Crips, who are blue, and then there are the Plums, who are purple (a combination of the two, if you will).<br /><br />Plums are also ultra fly people who spend their time being stared at for their pure beauty and awesomeness. They rarely say stupid things and are farther away from the previous (idiotic) definition of &quot;a short fat kid&quot; than the Earth is from the sun. ","time":1444087080558},"peach":{"definition":"A nicely shaped, and usually freshly shaved vulva, typically characterized by large labia majora (outer lips) and small, if not invisible, labia minora (inner lips).  A peach features absolutely no [roast beef], and is considered by many men to be the ideal vulva for a woman.","time":1444087104551},"quarterpounder":{"definition":"An extremely inexpensive prostitue.  ","time":1444087106728},"mcdonald's":{"definition":"A place where people eat alot, get fat, and then sue to get money.","time":1444087119636},"burgerking":{"definition":"Better than McDonald&apos;s","time":1444087129716},"dairyqueen":{"definition":"one of the best fast-food restaurants in the world.","time":1444087136028},"jackinthebox":{"definition":"Female masturbation.","time":1444087146102},"puto":{"definition":"spanish word for a male prostitute. sometimes it´s offesive for homosexuals. in mexico it is used for cowards and traitors.","time":1444087254115},"puta":{"definition":"means whore or bitch in portuguese, spanish, and Filipino","time":1444087262717},"orgasm":{"definition":"The meaning of life.","time":1444087399740},"vine":{"definition":"Something you do it for.","time":1444087433364},"facebook":{"definition":"a stalkers dream come true","time":1444087628864},"mario":{"definition":"An Italian-American plumber named after the land lord of Shigeru Miyamoto back in the early 80&apos;s.  Mario, originally a carpenter, fights evil creatures such as: Donkey Kong (they later become friends), Koopas (bad turtles ruled by King Koopa [more commonly called Bowser]), goombas (evil mushroomesque fellows), piranha plants, and many more.  <br /><br />Mario&apos;s younger brother, Luigi, and he own a small plumbing business in Brooklyn.  They were once summoned to an emercengy plumbing problem at which they were required to fix a shower.  Upon completion of the task, both of the brothers were sucked into the shower head and transported undergroung.  Thus begun their adventures.  IN the beginning, all they had to do was jump on turtles ad crabs that came out of pipes, but later they were magically transported to another world.  They came to the Mushroom Kingdom.  Here it was that they had to rescue the princess and fight the evil hordes of Bowser&apos;s army.  Mario and Luigi both can use numerous powers such as: a cape, the toonooki, the frog suit, the star, fireballs, metal cap, and many more.  They also have a dinosaur buddy named Yoshi that they ride upon and force to consume enemies and berry-like fruits.<br /><br />Super Mario games have proven to be some of the most entertaining and fun games of all time.  They are without a doubt the best action&#x2f;platformers of all time.","time":1444087650366},"luigi":{"definition":"The better yet always ignored of the Mario brothers. He&apos;s obviously better, I mean, come on, his brother had to be saved by &quot;scaredy-cat&quot; and the supposedly weak Luigi!","time":1444087685002},"princesspeach":{"definition":"Someone who seems to perpetually be in another castle.","time":1444087718263},"bowser":{"definition":"A beast known as Super Mario&apos;s TRUE nemesis. This turtle-like creature first appeared on the very first Super Mario game for the old-school Nintendo and was first known as the demon king turtle but later was changed to king Bowser. in Japan and to some ignorant folks in the USA call him Koopa.<br /><br /> He is often overlooked of his powers since his diabolical appearence sporting long spikes from his shell, horns on his head, and razor sharp teeth on a body known to be only muscle.<br /><br />He is such a powerful creature that it does not fit my mind how can Mario woop his @$$!? <br /><br />Throughout the many games he has been in, he has been known to breath fire in many fashions, levitiate from the ground, become invisible for short periods of time, run extremely fast, and has brute strength to back him up. He has been known to be a wizard for all these things since he is an expert at wand handling and the ablity to control a large mass of individuals to oversee his kingdom. His technical skills are superb since he has created many machines throughout his life trying to kick Mario&apos;s sorry @$$. He has survived many of the things Mario has done to him including surviving many pitfalls,  lava pools, and explosions while using his machines. He is a master theif and is capable of entering worlds through holograpghic paintings to steel golden stars.<br /><br />Bowser will never die and the day he dies is the day Mario dies too.","time":1444087734031},"shyguys":{"definition":"A man who instead of using an open urinal to pee in, goes into the stall. This man would not have to do anything other than #1.","time":1444087777323},"rule10":{"definition":"If anyone on any social site does not have a picture of themselves, its automatically means they are fat and ugly","time":1444088069367},"greatful":{"definition":"Greatful= Full of Great LOVE, THOUGHT, PRAYER","time":1444088529739},"wotm8":{"definition":"“U WOT M8” is a shorthand for “You what, mate?” which is a colloquialism used by English speakers in the United Kingdom, Australia and New Zealand. It is typically used in response to an incoherent proposition put forth by someone else, along the similar lines of “what did you just say?” or wat or what is this. Alternatively, the phrase can be used devoid of any context to confuse anyone that is unfamiliar with the expression.","time":1444088774303},"op":{"definition":"Short for Original Poster.  Used on online message boards and forums.","time":1444088862424},"netflixandchill":{"definition":"It means that you are going to go over to your partners house and fuck with Netflix in the background.","time":1444089128031},"nuzzle":{"definition":"To cuddle against another person or object close with head and or shoulders.","time":1444089290840},"lod":{"definition":"Short for the Legion of Doom, one of the most influential hacker groups of the 1980&apos;s and 1990&apos;s.<br /><br />The Legion Of Doom as it was known may no longer exist -- but the vital knowledge left behind by the pioneers of hacking does!","time":1444089369543},"alo":{"definition":"when you pick up the phone, you say &quot;alo&quot; as the first word, just like &quot;hello&quot;","time":1444089404545},"cute":{"definition":"A girl who is lovely and dreamy and cuddly and shy and beautiful and awwww *druels*","time":1444090167953},"omegle":{"definition":"A website (omegle.com) that is an anonymous one on one chat, pretty much a feeding ground for pedos.","time":1444090178195},"situational":{"definition":"noun.   a degree of attractiveness that is strongly influenced by the relationship of the subject&apos;s looks compared to those in proximity.","time":1444090221728},"harvestmoon":{"definition":"A series of video games about farming (yes farming), raising animals, raising a family, and just...living. It focuses on small-time living, making friends with villagers while making a profit from your farmland. Although sounding boring to most people, this genre has been known to be terribly addictive.","time":1444090305558},"runefactory":{"definition":"rune factory is an RPG farming&#x2f;fighting&#x2f;dating sim. it&apos;s popularity is growing more rapidly, especially sence the release of rune factory frontier. there are 3 games for ds, and one already released wii game, and one game that is not yet released called rune factory oceans. the characters on the rune factory games wears strange, and &quot;complicated&quot; looking clothes, but they are intresting. in all 3 of the ds games the protaginist (rf1: Raguna rf2: Kyle rf3: Mias) starts out with amnesia. your goals are to get stronger, farm, get married, and have kids (its optional in rf1, its not essentual to the plot)  in rune factory2 its essential to get married, in order to move on w&#x2f; the game, you build a school when the child is born, and then when Kyle remembers what he came to do and disapears, and you have to play as the son or daughter, and bring him back. in rf3 you have to marry in order to defeat the dragon that took your memory away","time":1444090333866},"memes":{"definition":"(noun)   <br />    <br />1 : an idea, belief or belief system, or pattern of behavior that spreads throughout a culture either vertically by cultural inheritance (as by parents to children) or horizontally by cultural acquisition (as by peers, information media, and entertainment media)  <br />    <br />2 : a pervasive thought or thought pattern that replicates itself via cultural means; a parasitic code, a virus of the mind especially contagious to children and the impressionable <br /><br />3 : the fundamental unit of information, analogous to the [gene] in emerging [evolutionary theory] of culture  <br />  - meme pool (n.) : all memes of a culture or individual   <br />  - memetic (adj.) : relating to memes   <br />  - memetics (n.) : the study of memes   <br />    <br />4 : in [blogspeak], an idea that is spread from [blog] to blog <br />    <br />5 : an internet information generator, especially of random or contentless information   <br />    <br />(Etymology : meme : derived from the Greek mimëma, &apos;something imitated&apos;, by [Richard Dawkins] in 1976)","time":1444090365113},"meme":{"definition":"(noun)   <br />    <br />1 : an idea, belief or belief system, or pattern of behavior that spreads throughout a culture either vertically by cultural inheritance (as by parents to children) or horizontally by cultural acquisition (as by peers, information media, and entertainment media)  <br />    <br />2 : a pervasive thought or thought pattern that replicates itself via cultural means; a parasitic code, a virus of the mind especially contagious to children and the impressionable <br /><br />3 : the fundamental unit of information, analogous to the [gene] in emerging [evolutionary theory] of culture  <br />  - meme pool (n.) : all memes of a culture or individual   <br />  - memetic (adj.) : relating to memes   <br />  - memetics (n.) : the study of memes   <br />    <br />4 : in [blogspeak], an idea that is spread from [blog] to blog <br />    <br />5 : an internet information generator, especially of random or contentless information   <br />    <br />(Etymology : meme : derived from the Greek mimëma, &apos;something imitated&apos;, by [Richard Dawkins] in 1976)","time":1444090366803},"georgebush":{"definition":"The president who staged the first preemptive strike in the history of the United States of America using the sole justification that Iraq had weapons of mass destruction.  <br /><br />Later, when no [wmd]s were found, he fiddled with terror alerts, implied connections between Iraq and 9&#x2f;11, changed the definition of the word &quot;liberation&quot; to &quot;invasion&quot;, and generally deceived the American people.<br /><br />George Bush constantly encourages misconceptions about the war on Iraq and John Kerry, possibly because he does not understand these things himself.<br /><br />If you disagree, tell me, why DID we go to war with Iraq?  Don&apos;t just say why we should have gone, or what makes sense to you (i.e. Saddam Houssein was a dictator, find out exactly what George Bush told us.","time":1444090870153},"salad":{"definition":"a polite way of saying sex","time":1444090984866},"tossingsalad":{"definition":"the act of placing your tongue in a male or females ass, and probing all around the circumferance of the asshole, while aiding the person in masturbation","time":1444091007959},"lexilynn":{"definition":"The most fantastic and wonderful being you&apos;ll ever meet. She has a lovely smile and an angelic voice and she&apos;ll make you fall.. Hard. When coming across a Lexi Lynn try to keep a few things in mind.  1. She has many people fawning over her so don&apos;t assume she wants you.  2. If she takes a chance and says yes to you, serenade her every chance you get and make sure she can plainly see your undying love and admiration.<br />3. She&apos;s a bit promiscuous and deadly, more so than cancer. You&apos;ve been warned bro.<br />4. Never let her go.","time":1444091355229},"anglican":{"definition":"An adherent to The Church of England, an institution allegedly founded upon the notion that a church ruled by the King would somehow be holier than one ruled by the Pope. In actuality, Anglicanism began because King Henry VIII couldn&apos;t get a hard-on. The Pope (see: [Catholic])refused to grant Henry VIII a divorce so he could re-marry and try to produce an heir, so Henry VIII just decided to start his own religion (see: [penis envy]) and grant himself a fuckin divorce.<br /><br />Following this, a period of several decades passed whereby Anglicans and Catholics preceded to burn each other on stakes, both taking turns at this ritual depending on which religion the ruling monarch of England favoured. However, because of its mind-boggling idiocy, no historian has been able to properly document this era without dying of a brain hemmorage.<br /><br />Even more decades passed, and Catholics lost power permanently in England, and were kept cruelly supressed by the Anglican Church, who would not let them go to university or hold positions in government. This probably explains why Alexander Pope&apos;s poetry sucks. Also, Guy Fawkes, a rightfully disenfranchised Catholic, attempted to blow up the English parliament, but was arrested while attempting to blow up six billion crates of dynamite shoved into a six by eight foot basement. When brought before the (Anglican) King James I to beg forgiveness, he promptly spit on his face. This should not be confused with [V For Vendetta].<br /><br />In a modern context, several characteristics can be ascribed to Anglicans:<br /><br />1) Extreme spoiledness (i.e. I ran away from home because my parents wanted me to pay an eighth of my tuition)<br />2) Contant lauding of their self, righteous &quot;progressive values&quot;<br />3) A false sense of pride because their second cousin-in-law went to Oxford or some fucking thing<br />4) A contrived, socially detached air that lets you know that they&apos;re better than everyone else in the room<br />5) The kind of conversation skills that are put to shame by most mutes and&#x2f;or Uzbekistani hookers<br />6) An elitist disposition because they were forced to read T.S. Eliot in university and think they&apos;re fuckin brilliant because of it.","time":1444091401548},"fellatio":{"definition":"The term use in polite company which refers to the subservient act of orally stimulating the male sex organ with, but not limited to, the lips, mouth and tongue, during which suction pressure is applied to the male organ, usually resulting in the need to shampoo.","time":1444091592297},"vcg":{"definition":"Being a VCG stands for Video Chat Goddess. Its someone who whether they look good or bad in person, always looks incredible on video chat. Its almost as if they have a video chat enhancer.","time":1444091645744},"ignorant":{"definition":"adj. lacking knowledge","time":1444091691387},"worst":{"definition":"The farthest from the best.  The most horrible.  The pits.  To have nothing good.","time":1444092269798},"yawn":{"definition":"The single most contagious thing in the known universe. Can be passed from person to person by the mystery of F-Gas.","time":1444092619317},"nigerianprince":{"definition":"A member of Nigerian royalty who has recently experienced some sort of loss (his son has been killed, estate has been destroyed, etc.) and also has lost his status in South Africa (where he holds his money), and he needs your help getting his 50+ million dollars back into his [escrow] bank account. He writes you e-mails telling you that he&apos;ll let you keep part of it if you&apos;ll front around $5k via wire transfer.","time":1444092802975},"vanoss":{"definition":"A funny Canadian YouTuber who does funny shit in Call of Duty, GTA5, and Garry&apos;s Mod. He also plays hockey his country&apos;s home sport. He really funny and good at editing. He currently has 7 million subscribers.","time":1444092974304},"mvp":{"definition":"Most Valuable Player","time":1444093787043},"grindin":{"definition":"V. (1) to sell illegal contraband for  money, especially drugs. <br />   (2) to make money, either legally or illegally<br />   (3) to work hard<br />   (4) when a women dances with her back to a man and her ass in his crotch, as to simulate doggystyle sex<br />   (5)To wear clothing or jewelery bought with drug money<br />   (6) to slide on a skateboard, usually downwards, on top of a rail or ledge while balancing one&apos;s weight.","time":1444093818648},"hemorrhoid":{"definition":"1) noun: A swollen varicose vein in or around the anus, rectum or sigmoid colon;<br />2) adjective: A person who&apos;s both useless, and a major pain in the ass, in the most obnoxious of ways. They fall beneath the level of &quot;[asshole],&quot; because an asshole has some function, at least. A hemorrhoid just gets in the way of your life and causes pain for no reason.","time":1444093833624},"maggots":{"definition":"1. A Slipknot fan.<br />2. A little person.<br />3. A baby fly.","time":1444093863359},"gesticulations":{"definition":"To make gestures: To move the arms or hands when speaking, or to express something with movements of the arms or hands.","time":1444093890400},"goat":{"definition":"Greatest<br />Of<br />All<br />Time<br /><br />(like tight, the best)","time":1444093918217},"wakeup":{"definition":"Phrase typically used by conspiracy theorists to imply you&apos;re ignorant.","time":1444094097869},"loli":{"definition":"1) short for [lolicon]<br />2) [hentai] that contains underage females in sexual situations.<br />3) an underage child, often depicted in sexual poses in hentai movies&#x2f;images.","time":1444094100843},"crs":{"definition":"&quot;Can&apos;t Remember Shit&quot;. Popularized by the movie Glory Daze.","time":1444094757104},"rubella":{"definition":"When your rubbies get bells on them.","time":1444094808153},"nigganigganigga":{"definition":"An amazing parody song on YouTube describing niggas. In the &quot;This is Gangsta Rap&quot; series.  Look up: This is gangsta rap- nigga nigga nigga","time":1444094821864},"meow":{"definition":"acronym for, Morning Erotically Obsessed Woman (or Women)","time":1444094842025},"o":{"definition":"1. The 15th letter of the English Alphabet.<br /><br />2. Slang for an &quot;ounce&quot;, in reference to drugs.<br /><br />3. Abbreviation for &quot;orgasm&quot;.<br /><br />4. Abbreviation for &quot;oh&quot;. <br /><br />5. Slang for the work of literature, &quot;Othello&quot;, by William Shakespeare, recently cited in the movie &quot;O&quot;, a horrible modernization of the Othello story.","time":1444094848237},"bipolar":{"definition":"Describes one who has bipolar disorder. This disorder causes the person to have mood swings frequently, usually triggered by something small. Mood swings can also occur for no apparent reason, and not to the person&apos;s control.","time":1444095083976},"pikachu":{"definition":"fat-assed yellow wombat","time":1444095089831},":o":{"definition":"The act &#x2f; face of being surprised.","time":1444095095975},"doge":{"definition":"wow<br />so urban<br />very informatiev<br />much confuse  wow","time":1444095110602},"chipotle":{"definition":"A heavenly food experience involving burritos, tacos, quesadillas, burrito bowls, etc... Can ease stress of bad days, and also cause extreme indigestion. But that is alright. Because Chipotle, you are worth it. Student ID = free drink. ","time":1444095282177},":t":{"definition":"a side- smile. can show innocence, or used  to lighten up awkward situations ","time":1444095563715},"pessimistic":{"definition":"Pronounced (peZZimistic). Notice the starting is pronounced like the candy dispensers called &apos;Pez&apos;. Most people pronounce this word wrong.<br /><br />It is the opposite of optimistic. Pessimistic is defined as expecting the worst in this worst of all possible worlds.<br /><br />Another way to spell pessimistic is pezzimistic.","time":1444095594743},"craycray":{"definition":"meaning really crazy","time":1444096047960},"cray":{"definition":"No one knows what it means, but it&apos;s provocative. It gets people going.","time":1444096056269},"idgaf":{"definition":"An acronym for &apos;I don&apos;t give a fuck&apos;.<br /><br />-Indifference<br /><br />Used when you don&apos;t care about something, or have no opinion on a matter.<br /><br />Sometimes used without the &apos;i&apos;, ie &quot;I dgaf about her&quot;.","time":1444096362840},"pepe":{"definition":"The Most Powerfull being in the whloe universe after Chuck Norris, he&apos;s indestructible and invincible, some people think he is only a myth, but he&apos;s 100% Real","time":1444096395710},"juan":{"definition":"The number before two.","time":1444096406424},"kbai":{"definition":"1. An even FURTHER bastardization of [kbye] and [kbi]. An abrupt way to end a conversation. Usually used in online forums and in instant messengers.<br />2. To die. To expire. To cease to exist.  To push up daisies. To buy the farm. To kick the bucket. etc...","time":1444096433677},"jumpkick":{"definition":"the solution to every problem","time":1444096769189},"freaky":{"definition":"Adjective form of the noun freak see [freak]. Kinky, wild in bed, sexually promiscuous, etc.  ","time":1444097232321},"strange":{"definition":"sex outside your current relationship","time":1444097238195},"kiwi":{"definition":"A game played in an enclosed court by two players who strike a ball with raquets. aka the greatest sport ever.","time":1444097326313},"hue":{"definition":"A word (used primarily by Brazilian gamers or those parodying them) similar to &quot;haha&quot; or &quot;lol&quot;.","time":1444097570693},"fuckyea":{"definition":"Used in agreement of something amazing...<br />Can also be used condescendingly or sarcastically; (see &quot;[seems legit]&quot;)","time":1444097604330},"pop":{"definition":"&quot;Pop&quot; is what people from Michigan, Minnesota, and Washington use to denote &quot;soda.&quot;","time":1444097610420},"popping":{"definition":"A Party dance and FUnkstyle created by Sam Solomon aka Boogaloo Sam, out of fresno, California in the mid 70&apos;s with the West Coast Funk movement.<br /><br />The quick tensing and releasing of muscles, often the arms,legs,back,chest and neck which creates a POP effect, designed initially to be done on beat to Funk.","time":1444097617656},"penispop":{"definition":"A ice cream or popsicle in a round container with a plastic bottom you push up to get more in your mouth. Often used as practice for blow-jobs.","time":1444097627097},"jerkit":{"definition":"Male Masturbation See [masturbation]","time":1444097638948},"jerk":{"definition":"The kind of guy most girls ACTUALLY want when they say they want a [Nice Guy].<br /><br />Jerks are selfish, manipulative bastards who see women as little more then sexual conquests to brag about to their buddies or mere objects that are there for their personal pleasure. As to ensure the post-sex breakup will be in their favor, Jerks often play the &quot;sensative guy&quot; early on so the girl will make most of the moves on HIM, and after he&apos;s done with her and dumps her for some other girl just like her, he can make it look like she&apos;s at fault for coming on too strong, and consequently she&apos;ll take him back if he chooses to return for seconds.<br /><br />Typically are&#x2f;were [Frat Boy]s, [Jock]s, and [Prep]s in school.","time":1444097643722},"fap":{"definition":"The onomatopoeic representation of masturbation.  Often used to suggest that something is attractive.","time":1444097662535},"sit":{"definition":"1. A gaming term used to let another player know he has just been owned, or is inferior.<br /><br />2. Take a seat (as in step down)","time":1444097675593},"quan":{"definition":"anyone who is out of control","time":1444097865515},"hitthequan":{"definition":"A dance consisting of a series of actions mimicking the rappers&apos;s words and sounds. The dance can be interpreted multiple ways and you can make your own moves, but it should include some form of stepping, squatting and arm movement. This dance has recovered us from the endless &apos;watch me whip&apos;.","time":1444097881442},"sao":{"definition":"Stands for an anime series known as Sword Art Online which was originally a Light novel written by Reki Kawahara.","time":1444098636676},"swordartonline":{"definition":"A japanese show, defined as Anime. A show where the characters (Some how are ALL from Japan) enter a game, known as Sword Art Online. When entering the game, shortly after, the creator of the game, Heathcliff, or whatever his actual name is, alarms them that if they die in the game, they die in real life.. The Game version of Freddy Krueger.","time":1444098646532},"cumblr":{"definition":"A tumblr that consists of erotic pictures and gifs","time":1444099514756},"worldstar":{"definition":"First thing out someone&apos;s mouth when shit is about to go down. Usually shouted when a fight breaks out. Guaranteed to see at least one titty and a KO. Originates from [worldstarhiphop.com] (a popular website that showcases upcoming rappers, latest cultural&#x2f;world news, butt-nekkid women, many fights, etc.)","time":1444099880160},"nekkid":{"definition":"Nekkid is not simply being without clothing--It means you are gettin&apos; nekkid for mischevious purposes. [Naked] is natural; nekkid is [naughty].","time":1444099914340},"bae":{"definition":"Bæ&#x2f;bae is a Danish word for poop. Also used by people on the internet who think it means baby, sweetie etc.","time":1444099953408},"trump":{"definition":"trump is a stupid-ass-haircut that looks like shit.","time":1444101007163},"fam":{"definition":"a word use to describe your peoples. ones that you can trust dearly. someone you consider family ","time":1444101007180},"tmth":{"definition":"TMTH abbreviated for TO MUCH TO HANDLE, first used exclusively by homosexual males in southern California frequently, now frequently used by many people of many different &quot;categories&quot;.<br /><br />TMTH can be used to describe something or someone negativity OR positively.","time":1444101079977},"tool":{"definition":"One who lacks the mental capacity to know he is being used.  A [fool].  A [cretin].  Characterized by low intelligence and&#x2f;or self-steem.","time":1444102354101},"asian":{"definition":"the race with the hottest girls. ","time":1444102476346},"wiccan":{"definition":"A Wiccan is a member of the Pagan-Revivalist religion known as [Wicca].  Can be a male or female practitioner or lay-follower, either solitarily (on their own) or members of a Coven (group).  See [Wicca] for more details on the religion and its practices.","time":1444102631216},"shrugs":{"definition":"A very bad toupee.  - Short for SHitty RUG.","time":1444102712377},"puertorico":{"definition":"A former colony of Spain, now a moderately self-governing island territory of the United States located just east of the [Dominican Republic].  Puerto Rico used to have a proud and vibrant political culture now mired in corruption and a dead end obsession with the stale-mated status debate.  Puerto Ricans have their own distinct culture, slang and history and are noted for their artistic, dramatic, athletic achievements and for their beauty.  Puerto Rico also has the highest number of institutes of higher learning in the region.  Puerto Rico also has the highest per capita GNP of latin america and a diversified economy with large tourist,  manufacturing, health, education and service centers.","time":1444103673956},"st.thomas":{"definition":"A private college in St. Paul Minnesota where prude, spoon fed cunts prance the campus in their Manhattan inspired attire. These girls may once have been likable in their high school years but this will more than likely change when attending this institution, especially by &quot;infedels&quot; who are not priveledged enough to attend UST.","time":1444103689159},"hai":{"definition":"A salutation, friendly hello","time":1444104510658},"pute":{"definition":"1) french word for: bitch, prostitute.<br />2) &apos;faire un coup de [pute]&apos; : play a mean trick on somebody.","time":1444104591943},"slut":{"definition":"a woman with the morals of a man","time":1444104593114},"hl":{"definition":"hl or Half-Life, a popular single player and multiplayer game produced by Valve.","time":1444105640557},"demisexual":{"definition":"Demisexuals are characterized by a lack of sexual attraction toward any person unless they become deeply emotionally or romantically connected with a specific person or persons. The level of connection it takes for sexual desire to form is dependent on how close the relationship is rather than initial attraction. It is an orientation that is not chosen.  Demisexuality does not refer to the active restraint or repression of sexual desires or actions.  Demi- is a prefix meaning half. This is used to mean halfway between sexual and asexual. The term originated in the asexual community, specifically within the Asexual Visibility and Education Network (AVEN).","time":1444106331162},"tlr":{"definition":"(n.) The definitive pocket soldier of [Comp TF2]&apos;s [6v6] format. TLR is known for his DM-heavy playstyle and in particular his ability to hit unorthodox [airshot]s; as well as an infamous attempt to steal an ESEA Lan Trophy a couple years ago.  (v.) When you try to cum on a guy&#x2f;girl, but they pull out at the last second and start erratically running left and right in an attempt to make you miss your cumshot. But the thing is, you&apos;re actually Peter North. You then jizz a mighty puddle upon his&#x2f;her feet, launching them several feet in the air, and then flickcum a mighty spooge torpedo that subsequently results in their explosion. Anything less, surprisingly, is also called a Platinum.","time":1444106350485},"vibrator":{"definition":"&lt;noun&gt;<br />1) The reason she has a headache.<br />2) Straight men&apos;s worst enemy.<br />3) A phallic object which vibrates, primarily used to hand women an easy [orgasm].","time":1444106510619},"ban":{"definition":"Acronym. Bitch Ass Nigga.","time":1444109915509},"cyber":{"definition":"Online sex that loners engage in if they are too ugly and boring to get a real boyfriend&#x2f;girlfriend.","time":1444111077596},"felcher":{"definition":"During anal sex when cum is released into the ass, the FELCHER is the person who removes the cum, with a straw or not.","time":1444112807454},"interpretation":{"definition":"a way knowing if parts are applicable or not... synonymous to Mick","time":1444126800201},":s":{"definition":"Confusion","time":1444128548659},"wolf":{"definition":"The ancestor of our dog, the carnivorous wolf is also related to animals such as the coyote, fox, and dingo.  Wolves are endangered, but humans are beginning to open their eyes to previous mistakes and helping wolves make a comeback.  Wolves live in packs with a hierarchy, consisting of the only mating pair, the alpha male and female, followed by the beta pair to take over in case something happens to the alpha(s).  The lowest in rankings are the omega.  Omegas eat last and can be treated very poorly.<br />Wolves generally hunts rabbits, deer, elk, and sometimes moose.  There has never been a recorded attack on a human by a healthy wolf in North America.  Myths with wolves may have arisen when humans in witnessed wolves eating the corpses of other humans, who died of other causes.  Upon sight of humans, most wolves will run.<br />There are many types of wolves, including grey wolves (canis lupus) and red&#x2f;Mexican wolves (canis rufus).","time":1444128636183},"nimbus":{"definition":"The imagined physical manifestation of your state of mind. Although not of the physical plane, it can be observed through the actions and interactions of the owner. And sometimes, just sometimes, it shines so bright you can almost see it.<br /><br />A large Nimbus could indicate that a person is [On Fire] or [Glorious].","time":1444129370600},"did":{"definition":"A way to explain your hair once it has been styled.","time":1444130516124},"chillout":{"definition":"Shut up, relax, calm dowm","time":1444131631439},"awks":{"definition":"Adjective used to describe an action or situation deemed as awkward.","time":1444135066416},"lubbock":{"definition":"City in Texas, home of the Texas Tech Red Raiders.  Known for it&apos;s incredible lack of trees, water and hills, as well as it&apos;s insane mass of dust, wind, and trucks.","time":1444135392954},"lilwayne":{"definition":"Accidentally shot himself in the chest once.","time":1444135421838},"iggyazalea":{"definition":"a white pasty female rapper from Australia who puts on a fake urban accent when she raps. She thinks she&apos;s all gangster when in reality she&apos;s a middle class Gussie who sucked dick all the way to the top. Usually Iggy Azalea fans get defensive when logical people criticize her on YouTube. They also claim she&apos;s the best female rapper to ever spit, which is ridiculous since there are much other talented female rappers like MC Lyte , Foxy Brown, etc. some even recognize her as a female Eminem. In reality she has no talent whatsoever.  Iggy Azalea is just an actor. An entertainer. Most of her videos &#x2f; songs rely on sexual appeal, as she&apos;s seen twerking and showing her nipples in some of her music videos. Rapping is just her conduit.  Most of her fans are also 12 year olds who have never heard of great artists like Tupac, Biggie, Nas, Rakim, Big L, etc.  Iggy azalea also cannot drop bars. Her flow is wack and whoever thinks she&apos;s good has a bad taste in music.","time":1444135453778},"sag":{"definition":"To wear one&apos;s trousers lower than the intended waist line, hence the back of the trousers &quot;sag&quot;. Some believe &quot;sagging&quot; origionated in America, particuarly amongst the black comunity. Men that had been arrested and sent to jail would be malnurished and therefore skinier upon leaving thus causing their trousers to hang lower around their waist; &quot;sag&quot;.","time":1444138265872},"nerd":{"definition":"One whose IQ exceeds his weight.","time":1444138394778},"kimjungun":{"definition":"A friend for life.<br />See also North Korea and Dennis Rodman","time":1444139103378},"metaknight":{"definition":"The leader of the meta knights and a master swordsman.<br />He has a giant flying ship called the halberd and has appeared in many kirby games, also in smash bros brawl.<br />He has very fast swipes and his final smash is galaxia darkness.<br />","time":1444139115891},"dedede":{"definition":"GIANT Penguin. From the Kirby games, and appears in Brawl. Known for his Waddle-Dees and &quot;Big-Gay-dance&quot;. (Final Smash)","time":1444139126249},"kirby":{"definition":"A little fat-ass puffball thing that constantly eats food. And floats around like some gay fairy.","time":1444139130508},"sux":{"definition":"The noun form of the verb &quot;sucks&quot;. Used to connote a lack of quality or skill. Can also be used as an interjection.","time":1444139622962},"lelouch":{"definition":"Someone who is, and always will be, better than you.","time":1444141122971},"ass":{"definition":"(_!_) = Normal Ass<br />(__!__) = Big Ass<br />(!) = Tight Ass<br />(_?_) = Dumb Ass<br />(_E=MC2_) = Smart Ass<br />(_$_) = Rich Ass<br />(_x_) = Kiss My Ass<br />(_X_) = Get Off My Ass<br />","time":1444141889065},"yui":{"definition":"19-year-old female singer who is now very famous in Japan. she has a very beautiful voice. Also she is a very pro acoustic guitarist. She is very cute! ","time":1444142018255},"lots":{"definition":"Times of hardship; rough circumstances.","time":1444142536797},"beasto":{"definition":"Someone that has sex with animals in the ass with no lube.","time":1444142955246},"pff":{"definition":"a term used to say i dont care or fuk that shit","time":1444143656265},"w/e":{"definition":"slang or abbrv. for whatever","time":1444144897453},"scientology":{"definition":"See [sham], [fraud], [fake], or any word adjacent to those.<br /><br />Basically its a falsetto &apos;religion&apos; in which eternal happiness is attained by donating all of your money to the leaders.<br /><br />Founded by L. Ron Hubbard as a way to scheme money and make a fast buck off his books. One of the &apos;holiest&apos; days in this religion is Hubbard&apos;s birthday.<br /><br />Because most celebrites such as Tom Cruise and John Travolta are too stupid to realize it, they belong to this group.","time":1444144994998},"kappa":{"definition":"The main symbol&#x2f;emote of Twitch.tv. It represents sarcasm, irony, puns, jokes, and trolls alike. If you see this term used outside of Twitch.tv, then this is not the correct definition. Usually used at the end of an ironic or sarcastic sentence. Sentences that contain a Kappa should not be taken seriously. If you search &quot;Kappa Twitch.tv&quot; in Google you can see what the emote looks like, and why it is used as it is. Sentences that use Kappa do not always have to make sense.","time":1444145502948},"princess":{"definition":"A girl that has been pampered, sheltered and spoiled her whole life to the extent that she has no friggin idea about the real world.","time":1444145820568},"crap":{"definition":"what one says when one is afraid to say [shit]","time":1444145852875},"roughsex":{"definition":"Rough Sex <br /><br />Very vigourous sex for people who like pain, but aren&apos;t into the really kinky shit. May involve hair pulling, ass-slapping, biting etc.","time":1444145855571},"poopsex":{"definition":"The act of either pooping in another persons anus, or pooping in a womans pussy.","time":1444145863855},"twizzy":{"definition":"Twizzy is another name for pussy.","time":1444145872707},"mewtwo":{"definition":"Probably the only Pokemon that&apos;s actually cool. The only Pokemon who seeks world domination and plots for him and his clones to inherit the world. He is the most powerful of all Pokemon and can withstand anything that comes his way.","time":1444145912602},"squirtle":{"definition":"This pokemon will rape you with bubbles.<br />With a smile on its face.","time":1444145934633},"mew":{"definition":"Cat-Like and sweet Pink Pokemon.<br /><br />Sound that cat Make.<br /><br />Furry happiness Sound.","time":1444145936940},"venusaur":{"definition":"A bigass dinosaur [Pokemon].","time":1444145947908},"blastoising":{"definition":"When you jack off two guys over your shoulder, aiming their jizz at your partner. Yelling &quot;You do not have enough badges to train me!&quot;","time":1444145948430},"furrysex":{"definition":"sex among furs. sometimes in groups some times one on one. ;)","time":1444145948542},"june5":{"definition":"The day you finally get released out of your 9 month jail sentence, AKA [school]","time":1444145949551},"charizarding":{"definition":"When you light a girls pubes on fire, put it out with your jizz then flap your arms and say &quot;You don&apos;t have have enough badges to train me&quot;","time":1444145956719},"hand":{"definition":"An alternative to having a girlfriend","time":1444145957096},"venusauring":{"definition":"Verb  The act of covering your penis in whatever your lover is allergic to and fucking her. Afterwards, it is customary to slap her face with your dick and scream &quot;You do not have enough badges to train me.","time":1444145966526},"mudkipping":{"definition":"When you start to poop, but then you halt your shit halfway through so that you have a turd hanging out of your ass.  Then you repeatedly dip your turd into your partners mouth.","time":1444145982107},"dankmeme":{"definition":"A sarcastic term to refer to an old&#x2f;overdone [meme].","time":1444146015149},"noworries":{"definition":"The most common phrase in the Australian vocabulary.  May be used adequately in situations ranging from benign endings to conversations to matters of earth shattering importance.","time":1444146030141},"miam":{"definition":"The French equivalent to &quot;yum,&quot; or &quot;yummy.&quot;<br /><br />Used to designate satisfaction, liking, or pleasure.","time":1444146045425},"jay":{"definition":"Someone who is a beast at everything he&#x2f;she does. Such as running barefoot on a muddy [cross country] course-or being beyond hot. ","time":1444146063830},"jayjay":{"definition":"a person who is loyal, funny, sweet, caring, fricken adorkable, and always there for me.<br />a person you can&apos;t help but fall in love with.  a smexy playa with undeniable charm.<br />a clumsy loser, who can&apos;t shoot a basket.<br />most of all, a corny dork whom i love.","time":1444146064860},"chaud":{"definition":"A Chaud [Ch-aw-d], is Guam&apos;s equivalent to an American Redneck.<br /><br />A type of person or lifestyle <br /><br />(Adj&#x2f;Noun)","time":1444146211772},"junkie":{"definition":"A person who is consumed by an addiction.  Aspects of their life suffer as he&#x2f;she satisifies the addiction. See [addict]","time":1444146221592},"lycan":{"definition":"commonly mistaken as a werewolf, the Lycan is a more advanced species that, unlike the werewolf, can for the most part control their transformations. A werewolf can only change under the full moon, and cannot control that. The same can be said for lycans, however they are also able to transform at any given time, wether under a full moon or not, should the need arise.","time":1444146232971},"arceus":{"definition":"The apparent &quot;god&quot; of the Pokemon world, soon to appear in the 12th Pokemon movie to enact [judgement day] upon the universe. Some question, now that you can hack [GOD] IN A [POKE-BALL], what legendaries are left to spew out.","time":1444146258539},"sakurai":{"definition":"Director of the Smash Bros series, he is a god among men.","time":1444146258581},":d":{"definition":"A very happy smiley face","time":1444146494557},":3":{"definition":"A symbol meant to represent the cat face made by anime characters when they say something clever, or sarcastic, or are commenting on something cute.    ","time":1444146499366},".-.":{"definition":"An emoticon used when feeling gloomy, or just &apos;whatever&apos;. Can also be used as a sigh or as if someone is pouting.","time":1444146499586},"<3":{"definition":"Some people use this as a heart, but those people are wrong. It is clearly a ballsack.","time":1444146514693},";-;":{"definition":"many meanings: sad,tear,confusion, etc.","time":1444146518500},":]":{"definition":"It&apos;s an online symbol that looks like a smiley face","time":1444146542022},"corny":{"definition":"Trying to be cool, but ultimately very uncool indeed, and often even extremely embarrassing","time":1444146568958},":$":{"definition":"emberassed emotion from msn","time":1444146570444},"c=3":{"definition":"male genitalia smiley [penis]","time":1444146575532},"tanned":{"definition":"To tan something is to give it a good welly! Could be vandalism or violence.","time":1444146596425},"love":{"definition":"nature&apos;s way of tricking people into reproducing","time":1444147074825},"ronah":{"definition":"Failure to make rad or produce radness.","time":1444147119822},"cornhub":{"definition":"The worlds best porn&#x2f;corn site for all your corn needs","time":1444149647622},"woes":{"definition":"Basically my squad. Stands for Working On Excellence. the squad you run with everyday should be working on excellence. And that&apos;s why people in Toronto use the word for their team Or set.","time":1444149965461},"cowboybebop":{"definition":"My favorite anime and a huge hit in Japan.  Wonderful emphasis to detail and great story, animation, characters, and etc.","time":1444150648853},"trigun":{"definition":"An Awesome Anime Series about Vash the Stampede, who is an innocent man that has a $$60,000,000,000 bounty on his head.  <br /><br />Vash, the Main character is a goofy protagonist, just trying to figure out who he is, and trying to get by.  He is also being followed by Meryll Stryfe and Milly Thompson, two insurance girls from the Bernadelli Insurance firm, and they are trying to make sure that more Vash the Stampede incidents do not occur.  However, the irony is that Vash does not put himself in danger, nor does he intend to cause such trouble, and he is an extremist pacifist, and refuses to kill ANYONE.<br /><br />A truly interesting and heart-warming series, and is worth looking into, despite all of the fan boys.","time":1444150679677},"grammarnazi":{"definition":"Someone who believes it&apos;s their duty to attempt to correct any grammar and&#x2f;or spelling mistakes they observe. Usually found hanging around Irc chatrooms hounding &quot;n00bs&quot;.","time":1444152013837},"spoopy":{"definition":"Something that is funny and spooky at the same time.","time":1444152654659},"porn":{"definition":"The best thing in the world","time":1444152661854},"50shadesofgray":{"definition":"simply put, it&apos;s paperback porn","time":1444152942688},"idt":{"definition":"i don&apos;t think so. for all u lazy ppl out there that abbreviate.","time":1444153506712},":i":{"definition":"the fat face. mostly used in texting. can describe many things, just use for any &quot;fat&quot; purpose.","time":1444153589220},":/":{"definition":"Hard one to define imo.. I guess it&apos;s<br />1. This sucks.<br />2. Whatever<br />3. Greeeeeeeat (sarcasticly)","time":1444154250114},":?":{"definition":"An emoticon used to denote confusion. It can also mean an unsureness of what facial expression would be appropriate in this situation.","time":1444154270902},"louie":{"definition":"       &apos;One mans craziness, is another mans reality&apos;<br /><br />Louie is a very unique individual. There have been plenty of people who have attempted to imitate the King and failed horribly. Louie&apos;s body is able to intake massive amounts of alcohol with ease. Also, he could possibly be one of the funniest people ever. He is considered a God among men and magnificent man beast for the ladies. ","time":1444154861748},"prada":{"definition":"Expensive fashionware company referenced in many song lyrics, especially in references to purses and bags","time":1444154867974},"ghandi":{"definition":"A lawyer who partially through practices of non-violence and fasting was able to liberate India from British rule.  Promoted religious and ethical tolerance, lived like a commoner, and eventually won the Nobel Peace Prize.  Was mourned by pretty much everyone in the world when he was assassinated.","time":1444154873564},"fgt":{"definition":"Short for faggot, commonly used in [IRC]","time":1444155245406},"mudkip":{"definition":"Mudkips were coolly brought to the 4chan table of love when this story with Copypasta-ed onto the site.<br /><br />Today being Halloween, I decided to fuck with the major retard at school when I came out of science for break. He was dressed as Ash. Knowing this was going to happen, I brough a Mudkips doll. Thus I started the conversation, making sure no one saw me.<br /><br />&quot;So I heard you like Mudkips...&quot; &quot;Mudkips? I LUUUUUUUUUUUUVE MUDKIPS.&quot; &quot;O RLY? So, would you ever fuck a Mudkips, that is..&quot; (he cuts me off before I could said &apos;if you were a mudkips&apos;) &quot;OF COURSE.&quot; &quot;Well I just happen to have a Mudkips here, and.&quot;<br /><br />Before I finished the sentence, which would have resulted in me hitting him across the face with the doll, he grabbed it. In one swift motion his pants were down and he was violenly humping it. Not to get between a man and his Mudkips I started to walk away, because there is no way I&apos;d be caught wrestling a half-naked crazy guy humping a Mudkips.<br /><br />Needles to say, within 5 to 10 seconds, some girls saw him and started screaming. I cooly walked into a restroom, pretending nothing had ever happened; not that I had intended that outcome, but now that it was in play I didn&apos;t want to be involved.<br /><br />I came back two minutes later, and like any wanton act on school grounds there was now a huge crowd round him. He was still fucking it and baying this real fucked up &apos;EEEEEEEEEEINNNNF EEEEEEEEEEINNNF&apos; sound. Suddenly a scuffle broke out in the middle, meaning he probably did something stupid.<br /><br />I asked someone what had happened. A girlfriend of one of the football players tried to get him to stop, but he bit her for trying to take it away. Someone called in a few football players (all dressed up like Road Warrior) who proceeded to pummel the shit out of the guy. Meanwhile the school police were freaking out and having trouble getting in to the situation.<br /><br />A few minutes later the intruder alarm went off and we were shuffled into classrooms. Over the intercom the principal announced that someone had thrown a flaming plush toy into the library. Uh.. what the hell.<br /><br />So we were kept there and about 30 minutes later the principal came on again. This time he was saying that whoever was behind the beating should turn themselves in. All of a sudden this woman began yelling &quot;I WILL SUE YOU FOR DAMAGES. YOU LITTLE PUNKS, I&apos;M GONNA SUE...&quot; and it was cut off.<br /><br />I asked an office later what had happened. Apparently his mother had come to pick him up and threatened to sue for the beating and &apos;whatever else happened.&apos; The school threatened to counter-sue because of lewd conduct, inciting a riot, and starting a fight.<br /><br />So I ask you: do you like Mudkips? ","time":1444155776788},"fren":{"definition":"(n.) friend, esp. a close one.  origin: corruption of &quot;friend.&quot;","time":1444156117671},"sext":{"definition":"To send suggestive text messages back and forth. Like cybersex, but with text.","time":1444156203106},"booty":{"definition":"1. pirate treasure, plunder or other ill-gotten gains<br /><br />2. butt, ass, specifically female posterior<br /><br />3. sex, screwing<br /><br />4. crap","time":1444156250336},"guy":{"definition":"used for a normal&#x2f;bloke-ish kind of boy. orringinates from guy fawks","time":1444156927600},"fawk":{"definition":"fawk (noun); fawked, fawker, fawkin <br /><br />1. used to address someone<br /><br />2. da asian pronunciation to the word [fuck] (how my old man would say it...)","time":1444156932815},"fuck":{"definition":"1. The universally recognized &quot;F word&quot;<br />2. N. Implying complete and utter confusion<br />3. N. a really stupid person<br />4. V. To procreate<br />5. adj. Can be used to modify any word for more passion<br />6. Int. Expresses disgust<br />7. Int. Expresses complete suprise and joy<br />8. adv. Can be used to make a command more urgent","time":1444156962667},"bi":{"definition":"A person with significant attraction and desire for both sexes, both sexually and romantically. (The desire for the two sexes is not necessarily equal.)<br /><br />Being bi does NOT imply confusion, wanting&#x2f;having more than one partner, or participation in wild sex orgies.<br /><br />Short for [bisexual].","time":1444157142727},"nerds":{"definition":"One whose IQ exceeds his weight.","time":1444157292464},"fuckoff":{"definition":"1. A message used by the hand that is a direct insult to another person.<br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1444157591842},"dc":{"definition":"abbreviation for &apos;don&apos;t care&apos;","time":1444157860740},"month":{"definition":"One of 12 periods in a [year]. Has 28, 29, 30, or 31 days. Tends to go by rapidly, especially during the summer.","time":1444158016874},"theace":{"definition":"Acquired immune deficiency syndrome ([AIDS])<br />Derived from the [Cockney rhyming slang] phrase &quot;Ace of Spades&quot; = AIDS.","time":1444158904305},"tysm":{"definition":"abb. &quot;Thank You So Much.&quot;","time":1444160278763},"cancer":{"definition":"A disease lacking a sense of humor.","time":1444160436718},"mlp":{"definition":"[My Little Pony]Collector&apos;s term for small plastic horses with brushable manes and tails.","time":1444160704779},"low-key":{"definition":"to keep something low key: to not announce it; to have a quiet gathering; opposite of a large party or big group of people; not much emphasis, closely aligned with a normal night out doing the usual stuff.","time":1444160956639},"loki":{"definition":"Loki is the Norse God of trickery, mischief, and change; a major character in Norse Mythology. Blood-brother of [Odin] and traveling companion and friend of [Thor]; his wife’s name is [Sigyn], his children’s names are [Hel], [Fenris], [Jormungandr], [Vali], [Narfi] and [Sleipnir]. Loki is pleasing and handsome in appearance according to the Eddas. He is renown for his cleverness and for helping the Gods out after he has gotten them into trouble as well as his great ability to make them laugh and cheer them up. <br /><br />He has domain over fire, and is a master magician, conjurer as well as shape-shifter (In some cases changing gender). Loki is [bisexual], having sexual relations with both male and female in mythology. Bearing in mind Loki’s dark side as well as his good one, he is most valuable as a witty, entertaining friend, and a God to call upon. <br /><br />Loki is not an evil  malevolent being or the Norse version of Satan or some fallen angel. The later influence of Christianity on Norse culture resulted in changing the mythology portraying Loki as evil incarnate. This is not uncommon, Christianity often demonizes other religions gods.<br /><br />Loki represents both our divine intelligence and also free will whereby we can choose for good or ill, and if we make a mistake to correct it. He typifies the human mind: on one hand clever, foolish, immature; on the other hand, he personifies the elevating, aspiring traits in human intelligence. <br /><br />Loki is still worshiped today and one who worships or is dedicated to Loki as their primary God is called a [Lokean]. Compare to [Odinist].<br /><br />In pop culture:<br /><br />Loki is a supervillian in Marvel comics.<br />Loki is a hero in Valhalla comic books.<br />Loki is a character on Mario and Luigi video games.<br />Loki is a character in the movie Domga<br />Loki is the spirit who inhabits the mask in the movie, “The Mask”.<br />Loki is a main character in the novel “American Gods”.<br />In Star Gate SG-1 Loki is a renegade [Asgard] who is responsible of many [alien abductions] in which he genetically experiments with human DNA in order to try and solve his races genetic degradation that is caused by excessive cloning.<br /><br />The dog star, Sirius, is referred to as &quot;Lokabrenna.&quot;<br />","time":1444160961702},"thor":{"definition":"Nordic god of thunder.  He&apos;s always drinking [mead]. Carries a hammer that only he can lift. I mean not even the [Hulk] can lift his hammer.<br /><br />He was one of the main characters in Dougas Adams novel, The Long Dark Tea Time Of The Soul.<br /><br />His one flaw is that he is a bit [homophobic] and always wears an [asgard] when he is around Greeks... especially  [Hercules].","time":1444160977963},"hulk":{"definition":"Any tall, [stocky], broad-shouldered man.","time":1444160992498},"mexicans'":{"definition":"Someone hailing or claiming ancestry from Mexico.","time":1444160997212},"hulkhogan":{"definition":"Hulk Hogan&apos;s real name is Terry Gene Bollea. Some of his nicknames include The Super Destoyer, Terry Boulder, Sterlin golden, Terry Hogan, Hulk Hogan, The Hulkster, Hollywood Hogan. <br />His signature maneuvers are The Hulk Up and Running Leg Drop. Hulk Hogan&apos;s trade mark is he wears red and yellow into the ring and Always tears his T-shirt off his body. The Titles Hulk Hogan have won are: WWE Champion (6 times); WWE Tag Team Champion (with Edge); WCW Champion (6 times)","time":1444160997999},"romanian":{"definition":"A person coming from Romania (a beautiful (but poor) country in Eastern Europe).  Romanians are Orthodox.  Are beautiful people (mostly the women).  Love soccer (who doesn&apos;t???).   Romanians are very smart people--education is a top priority. Beautiful music (unless you dont like it).  Romanians eat bread with everything, and when eating, must NOT leave food on the plate (LOL).   The language is a very nice language, pretty easy to learn, and very similar to Spanish (as it is a Latin-based language). <br /><br />Romanians - - - We are awesome!!","time":1444161004972},"fu":{"definition":"short for f**k you.","time":1444161558850},"elo":{"definition":"Elo is a rating system used in LoL (League of Legends).","time":1444161667303},"raiseyourdongers":{"definition":"A catchphrase made by [League of Legends] player Michael Santana. The phrase is now spammed by his fans in livechats, after he first used it in a twitter post in June stating, ヽ༼ຈل͜ຈ༽ﾉ raise your dongers","time":1444161810596},"ngl":{"definition":"Not Gonna Lie  Used to indicate that you are not deviating from the truth.","time":1444161860625},"gangbang":{"definition":"When multiple partners, usually 3 or more, engage in sexual intercourse with a single willing partner. (If partner is unwilling it is called gang rape).","time":1444161892485},"wip":{"definition":"Work In Progress","time":1444164559480},"ag":{"definition":"AG or &quot;aggressive&quot;... a thug gay girl that looks and dresses like a guy. a tomboy.","time":1444164937502},"arrow":{"definition":"A TV show on CW based on the DC character &quot;Green Arrow&quot;.","time":1444164942291},"spam":{"definition":"spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam ","time":1444165398254},"kik":{"definition":"A smartphone app that allows users to chat with eachother, for free, whether they have an iPhone, iPod Touch, Blackberry, or Android device.  *Can also be used in the form of a verb, meaning to contact someone through Kik.","time":1444165618890},"khs":{"definition":"Kinky Hair Syndrome: Total and complete sex hair. Voluminous, crazy, out of control.","time":1444166252048},"thestreets":{"definition":"The British artist Mike Skinner...his sheer brilliance is displayed in his first album &quot;Original Pirate Material.&quot;  A visionary with a penchant for catchy verse with a deeper meaning.","time":1444166313238},"trinidad":{"definition":"Bigger island of the Republic Trinidad and Tobago. Trinidad is more of the business island. Trinidad is best known for the Carnival and the soccer team known as the &quot;Soca Warriors&quot;. Home and birthplace of the steelpan. The capital is Port of Spain. ","time":1444166319211},"help":{"definition":"what i need","time":1444166326118},"projects":{"definition":"Usually a group of dirty buildings made for really poor&#x2f;homeless people to live in. Projects are dangerous,very dirty,filled with gangsters,drug dealers,pimps,hookers and such. The first set of projects made(Starret City,made in 1963) where made for Blacks to live in,but over the years people of all races started to live in projects.","time":1444166346412},"lool":{"definition":"lol","time":1444167035380},";p;":{"definition":"A common typo of &quot;[lol]&quot;, Mostly happens when you [ain&apos;t] lookin&apos; at the keyboard.","time":1444167044751},"grateful":{"definition":"sitting on a grate, eating too much grate, working with grates too much.","time":1444169293524},"eario":{"definition":"[Mike Tyson]s favorite cereal","time":1444169549352},"illuminate":{"definition":"-brightened with light","time":1444169788977},"supahotfire":{"definition":"the greatest rapper of all time but he&apos;s not a rapper","time":1444170065718},"silk":{"definition":"Some fine (expensive) clothes.  Term was popularized by members of Duke Ellington&apos;s Band -- the Duke being a stickler for well dressed musicians.","time":1444170127704},"jojo":{"definition":"Derived from the disturbingly young American singer, meaning any girl who is clearly looking and acting many years above her age. Her first single Get Out (Leave) is the classic case in point, apparently about a 14 year old conducting a relationship with all the faux emotion and stormy angst of an abused middle aged wife.","time":1444170167789},"bai":{"definition":"short for &apos;bien tai&apos;, which in mandarin means perverted, deviant, abnormal.","time":1444170512270},"shoryuken":{"definition":"A Japanese phrase that literally translates to &quot;rising dragon punch&quot;, used to describe one of the most powerful strikes utilized in the martial art discipline of Shotokan Karate depicted in the popular Capcom video game series, Street Fighter.","time":1444170520641},"toxic":{"definition":"Used to describe a person who is tainted by a subconscious malevolence or psychosis that affects the lifes of those who come into contact with them.","time":1444170914220},"eggcorn":{"definition":"a lexical mistake, usually in the form of a commonly-used term used in place of a more obscure term.  ","time":1444171109442},"k":{"definition":"Online: 1. A term of acknowledgement; esp. without particular interest.","time":1444171149015},"penus":{"definition":"A mispelling of &apos;[penis]&apos;.","time":1444171226162},"peanus":{"definition":"1. N. A penis which is the approximate size of a peanut. Not a mispelling.","time":1444171233063},"peenus":{"definition":"a very small [penis], below average","time":1444171239002},"kgb":{"definition":"Komitet Gosudarstvennoy Bezopasnosti<br />(Committee for State Security)<br /><br />The Russian intelligence agency, similar to America&apos;s CIA.","time":1444171319690},"beast":{"definition":"UK Slang- a person who is very good at something","time":1444171319912},"life":{"definition":"A sexually-transmitted, terminal disease.","time":1444171874248},"grill":{"definition":"1. One&apos;s personal business 2.  One&apos;s teeth&#x2f;smile\t","time":1444172338340},"fiance":{"definition":"Future husband, person to which one is engaged to marry<br /><br />French for &quot;to trust&quot;, comes from the French word to betrothe.","time":1444172854707},"fiancee":{"definition":"Long-term girlfriend. In White Trash culture, fiancée no longer means &quot;the woman I will marry on a specific date&quot; but instead is simply a level of relationship status above that of &quot;girlfriend.&quot;  A couple in a fiance-fiancée relationship may live together for 20 years, have children together, but they will never actually marry.","time":1444172856026},"amp":{"definition":"Asian Massage Parlor","time":1444173322392},"mlg":{"definition":"An organization in the United States for professional gamers. Is an acronym for &quot;Major League Gaming.&quot; Many great gamers have been professionally signed by MLG. As of now, they mainly focus on Halo 2 tournaments. They also post &apos;official&apos; gametypes for Halo, Halo 2, and other games, so the gametype is fair and perfect. For example, an MLG game for Halo 2 Team Slayer would be battle rifle spawn, human weapons on map (no sword for fairness), etc. Many believe MLG is a lame gametype, though others practice it often in hopes of getting good at it.  By the way, if you&apos;d like to be funny, next time someone wants to play MLG over [Halo 2] over XBL, ask them, &quot;What&apos;s MLG? Does it stand for My Little Gun?&quot;","time":1444173566379},"debbiedowner":{"definition":"Etymology: From the Saturday Night Live character Debbie Downer, played by Rachel Dratch<br /><br />Function: Noun<br /><br />1. a: a person who says something terribly depressing (a [downer]), typically only tangentially related to the present circumstance or topic of conversation, and thereby destroys the positive atmosphere. b: a statement that is charactaristic of Debbie Downer<br /><br />Usage note: In the skit, following each downer Debbie voices, a trombone plays a &quot;wah waaah&quot; ([sad trombone]) sound effect and the camera zooms in on Debbie Downer&apos;s face, which is twisted in comic despair.","time":1444173820168},"debbie":{"definition":"A friend till the end, she&apos;s got your back no matter what. A constant source of intense laughter. Speaker of the greatest smart-ass comments ever heard. An extremely beautiful person on the outside. Has an even more impressive inner beauty (if you are open-minded enough to look) Has more strength than all previous heavy-weight champions combined.","time":1444173837796},"imo":{"definition":"&quot;In My Opinion&quot;","time":1444173845065},"hingo":{"definition":"The bane of everything that is good in the universe.  Should be avoided and shunned at all costs.  Widely associated with the fall of civilization into the depths of Hell.  Also, the exact opposite of [blarg].","time":1444174019229},"rng":{"definition":"Random number generator.","time":1444174048174},"blarg":{"definition":"Blarg is a unique word, being the only word that not only means anything you want it to, or is used to show disinterest or boredom, but also is the only word that thousands upon thousands of people have claimed to have made up but has been around since man discovered they could use tools. Hobo Dave and Raymond Donn are amongst those who claim to have created the word, as well as some wierd dude called John who worked in the Games Workshop in Falkirk. I have also been known to use the word frequently in the past. I suppose, the true use of this word is to fill a gap in a sentence where appropriate. If a stoned person says &quot;blarg&quot;, it is usually used to replace a word they cannot think of, or which they have forgotten.","time":1444174149277},"paenis":{"definition":"A different way to spell the word penis","time":1444174337172},"ts":{"definition":"Short for for [Telesync]. Truncated jargon used on file sharing networks to denote a film taped off a cinema screen; as opposed to something ripped off of a retail DVD (DVDrip&#x2f;retail), or even a pre-release DVD screener ([Screener]). Format tends to be in SVCD, but can also be in any other format, divx&#x2f;xvid etc.","time":1444174517798},"primadonna":{"definition":"01: a person that&apos;s considered vain, temperamental and&#x2f;or conceited.<br />02: a distinguished female operatic singer; a leading female operatic star; a diva.","time":1444175486400},"apple":{"definition":"The alternative to the orange.","time":1444176917925},"orange":{"definition":"The colour which vain assholes turn after a session in the tanning salon; Often confused with Hepatitis.","time":1444176926210},"kirito":{"definition":"To be incredibly over powered compared to the average person; to solo 30-man raid bosses using a single skill; a loner that will act independent of others regardless; to not follow the meta game  Reference to a character from Sword Art Online","time":1444177672951},"lpl":{"definition":"Typo on the word lol which occurs infrequently","time":1444177804571},"stunzeed":{"definition":"Deez Nuts spelled backwards. Essentially a way to tell others to suck on or get off your nuts ina manner in which they would be oblivious to. (which is what makes it funny)","time":1444178146216},"lolicon":{"definition":"Japanese term meaning &apos;[lolita] complex,&apos; after the novel (and two movies). The abbreviated &apos;complex&apos; is generally transliterated with an ending -n rather than -m. Oh those crazy japanese.<br />The term typically refers to pornographic art, [anime] or otherwise, of females aged between 12 and 16, and also to those people attracted to such girls. However, real child pornography is sometimes called lolicon.<br />Art of underaged girls is legal in most countries, which explains the popularity of lolicon. Despite the fact that the age bracket is technically outside the realm of [pedophilia], lolicon is frowned apon, especially in the west.<br /><br />Lolicon featuring males is [shotacon].","time":1444178846089},"sashagrey":{"definition":"Hot Pornstar!!! Shes only 18!!!<br />I like Black Boys is my favorite porno featuring her.","time":1444179062643},"sexrape":{"definition":"This is when a man is having sex with his partner, she, all of sudden, resists in the middle of the sex and then the man, unwilling to withdraw from the sex, rapes her.","time":1444179265855},"epipens":{"definition":"Epi-pen is the brand name of the most common type of autoinjector of epinephrine (i.e. adrenaline). Because they can be self-administered and are very fast-acting, Epi-pens are commonly carried by persons with severe allergies and a risk of anaphylactic shock. In the US and the United Kingdom, Epi-pens are regulated medical devices and require a prescription. ","time":1444179411923},"miakhalifa":{"definition":"Pornstar - is middle eastern and becuase of her religion and culture gets negative comments. Regardless, she has amazing tits and a nice ass. Gives good head too and seems like shes going to have a successful porn career.","time":1444179611321},"jfc":{"definition":"&quot;Jesus Fucking Christ&quot;  Used when extremely aggravated, confused, excited, or all of the above.","time":1444179646195},"abysmal":{"definition":"shitty","time":1444179828112},"e-whoring":{"definition":"eWhoring is a black hat technique for making money. Basically what you do it you pretend to be a girl in a chat room. Then you talk to guys and you ask them to sign up to your affiliate program, usually an adult affiliate program, and once they sign up you get paid.","time":1444179938857},"splitsville":{"definition":"originated as a code word for leaving an awkward or unpleasant environment or situation. <br />to exit, to flee or escape.  evacuate the premises<br />the act of removing oneself from a certain situation.","time":1444180009473},"erection":{"definition":"The male penis in full strength flow, especially annoying when in the company of friends or at the swimming pool. It can be delt with by the below example.","time":1444180344627},"kys":{"definition":"quick and easy abbreviation for kill youself","time":1444181613496},"m":{"definition":"Short for MDMA (methylenedioxymethamphetamine)","time":1444182197715},"tenshi":{"definition":"Japanese romanized word tenshi means angel when translated into English. THe original context means the messenger of heaven. This word is not commonly used in the contemporary Enlish language but was understood among anime fans.","time":1444182854156},"vip":{"definition":"(Pronounced as seperate letters)<br /><br />A very important person<br /><br />","time":1444182864873},"down":{"definition":"1. To be &apos;With It or in &apos;the know how&apos;, knowledgeable about something, or to give respect&#x2f;recognition to something.<br />2. To be keen for something.<br />3. To be friends with someone or to spend time with them. &apos;Gettin Down&apos; means to fuck them.<br />4. To have something &apos;Down Pat&apos; or well perfected.<br />5. To be in agreeance with someone or something.","time":1444182896134},"gettingdown":{"definition":"Act of dancing to the Audio Adrenaline song &quot;Get Down&quot;","time":1444182910065},"deeznutz":{"definition":"something to say to annoy or frusterate something. one of the most popular listed below.","time":1444183013135},"3rdbase":{"definition":"3rd Base is getting either a Hand Job, Fingering or Oral Sex. Can also be used as foreplay before sex or just a Sexual activity without having to actually have full Sexual Intercourse","time":1444183332653},"marital":{"definition":"Sexual relations between husband and wife.  Used in mockery of conservatives who think sex should only happen in marriage.","time":1444183441189},"smfh":{"definition":"Shaking My Fucking Head, from original SMH, Shaking My Head, as in disbelief.","time":1444184494789},"fries":{"definition":"Red-headed, low-life individual who felt like his life was coming to an end with his dead-end pizza-delivering job and girl in which broke up with him. Accidently became cryogenically frozen approximately 3 seconds after the start of the year 2000. He tilted his chair and fell into a cryogenically-freezing-pod. He remained frozen for 1000 years and was reborn into the New Year&apos;s Eve of 2999. <br />Likes anchovies, [Leela] and [Slurm].<br /><br />See [Leela], [Bender], [Zoidberg], [Farnsworth], [Amy Wong], [Zap Brannigan], [Kif].","time":1444184942254},"blastoise":{"definition":"One of the great water pokémon, fully equipted with a duel hydro pump.  He must have a HUUUGE BLUE COCK!","time":1444185255994},"theta":{"definition":"the eighth letter of the Greek alphabet that looks like an easter egg","time":1444185264653},"splatoon":{"definition":"The latest Nintendo IP, &quot;De Blob&quot; meets &quot;Team Fortress 2&quot;. A currently unreleased multiplayer shooter where players control squid-children called Inklings, spraying colorful ink all over a battlefield to control as much territory as possible. Currently has a metric ton of fan art, most of it pornographic in nature. Single-handedly convinced a large number of people to consider buying a Wii U. Also, its art style is so, so 90s.","time":1444185329304},"hentai":{"definition":"Hentai is animated pornography showcasing women who have better bodies than any real women (yet have weird hairstyles and hair-colours) and men with enormous penises.<br /><br />Every character in a hentai has body features several times better than any real person. 13 year old boys with 12 inch erections. 8 year old school girls with breasts better than most 16 year olds. The thinner the woman, the bigger the breasts. <br /><br />Female children in hentai don&apos;t always have breasts, but sometimes they do to add sexuality into the hentai. Children do not have spectacularly large breasts, but they can be nice ones. <br /><br />As for women, their is no such thing as a flat-chested no-breasted woman - at least in professional hentai anyway. Their breasts are perfect and natural - not tainted by surgery with scars and abnormalness. They are perfect. Hentai is perfection.<br /><br />As for elderly women, they do not exist. In hentai, they do not get naked. They are characters that are basically asexual to the hentai nature. Thank god. <br /><br />Hentai can involve anything sexual. Lesbians, bisexuals, homosexuals, bondage, underwater, fairies, humans and animals, orgies, oral sex, [aural] sex, anal sex, naisal sex, S&amp;M, slavery, dildos, strap-ons, anal toys and of course heterosexual vaginal sex. Hentai isn&apos;t always sexual penetration with a group or pair of people. It can be a woman&#x2f;man&#x2f;tranny posing or masturbating. It could be a group kissing or undressing or fondling each other. <br /><br />Hentai has no limits. That is why it is so great. I have nothing against real pornography, I enjoy it also. But hentai is perfect. Normal pornography is not. Hentai is beautiful. ","time":1444185452511},"peng":{"definition":"Sexy girl.<br />Adjective","time":1444185549325},"eatmyshorts":{"definition":"As in the movie &apos;The Breakfast Club&apos;, another way to say &quot;Eat my shit!&quot;","time":1444185587966},"meatspin":{"definition":"The newest installation of internet trickery. It is an .gif of  two homosexuals having intercourse while the male on top has his penis spinning in circles. In the deepest parts of hell with the likes of: [goatse] [tubgirl] [lemonparty]. Great site to send friends to if you wish that their retinas be burned out of thier eyes. www.meatspin.com","time":1444185636146},"cornporn":{"definition":"Pornography with corn, Corn engaging in sexual acts, Nude Corn, etc. (See [CILS])","time":1444185688322},"b/e":{"definition":"<br />The Process of Breaking and Entering into a private business, home, or property. A crime in most states, except for New Jersey and towns in the South West region of West Virginia. Often misused for the Bacon and Eggs Special at Denny&apos;s<br />","time":1444186138674},"snake":{"definition":"long body limbless reptile","time":1444186157584},"solidsnake":{"definition":"He could kick Sam Fisher&apos;s ass any day. The terrorists Sam Fisher faces are pretty fucking dumb, considering they don&apos;t notice him when he&apos;s standing right next to them DESPITE the fact that he has three glowing lights on his forhead which act like a billboard advertising his presence.","time":1444186176777},"samfisher":{"definition":"1. (noun) The main character in the Splinter Cell series of video games.<br /><br />2. (verb) The act of being very silent and sneaky.","time":1444186204295},"blumpkin":{"definition":"The delicately balanced art of getting your cock sucked while taking a dump.","time":1444187027792},"doubleblumpkin":{"definition":"Similar to an ordinary [blumpkin] but in this case the girl [A.C. Slater]&apos;s the toilet and blows the guy as he [upper deck]s the toilet.","time":1444187034359},"reverseblumpkin":{"definition":"A variation of the [blumpkin] where one gives oral sex whilst evacuating their bowels, thus utilizing both alpha and omega of the ailimentary canal simultaneously. <br /><br />Or in laymans terms, when one sucks a cock at the same time they are also beaming Schatner off  the Enterprise....the sucker is the crapper.<br /><br />Note:  The [money shot] should occur at the precise moment of final fecal release, thus synchronizing anal closure with ejaculation.","time":1444187047536},"doubledeckerblumpkin":{"definition":"the act of a male individual shitting or pooping in the upper deck of the toilet while a girl goes down on you (aka; sucking your penis), while she releases poop out of her butthole into the lower deck bowl of the toilet.","time":1444187061392},"upsidedownblumpkin":{"definition":"69ing while taking a dump.","time":1444187080525},"spankwire":{"definition":"Spankwire is a [porn] website that hosts porn for free. it is similiar to [YouTube] but deals with porn.","time":1444187164607},"girls":{"definition":"A younger form of a woman. If you tried to have sex with a girl, you&apos;d be arrested, you damn pedophile.","time":1444187243871},"female":{"definition":"Most definately the finest thing ever created","time":1444187260734},"shit":{"definition":"1. One of the most popular swear&#x2f;cuss&#x2f;curse words&#x2f;profanities<br /><br />2. another word Feces. Poop. Dookie. Scheisse. Poo Poo. Brownies.<br /><br />The Shit List:<br /><br />The Ghost Shit <br />The kind where you feel shit come out, see shit on the toilet paper, but there&apos;s no shit in the bowl. <br /><br />The Clean Shit <br />The kind where you feel shit come out, see shit in the bowl, but there&apos;s no shit on the toilet paper. <br /><br />The Wet Shit <br />You wipe your ass fifty times and it still feels unwiped. So you end up putting toilet paper between your ass and your underwear so you don&apos;t ruin them with those dreadful skid marks. <br /><br />The Second Wave Shit <br />This shit happens when you&apos;ve finished, your pants are up to your knees, and you suddenly realize you have to shit some more. <br /><br />The Brain Hemorrahage Through Your Nose Shit <br />Also known as &quot;Pop a Vein in Your Forehead Shit&quot;. You have to strain so much to get it out that you turn purple and practically have a stroke. <br /><br />The Corn Shit <br />No explanation necessary. <br /><br />The Lincoln Log Shit <br />The kind of shit that&apos;s so enormous you&apos;re afraid to flush it down without first breaking it up into little pieces with the toilet brush. <br /><br />The Nororius Drinker Shit <br />The kind of shit you have the morning after a long night of drinking. It&apos;s most noticeable trait is the tread mark left on the bottom of the toilet bowl after you flush. <br /><br />The &quot;Gee, I Really Wish I Could Shit&quot; Shit <br />The kind where you want to shit, but even after straining your guts out, all you can do is sit on the toilet, cramped and farting. <br /><br />The Wet Cheeks Shit <br />Also known as the &quot;Power Dump&quot;. That&apos;s the kind that comes out of your ass so fast that your butt cheeks get splashed with the toilet water. <br /><br />The Liquid Shit <br />That&apos;s the kind where yellowish-brown liquid shoots out of your butt, splashes all over the side of the toilet bowl and, at the same time, chronically burns your tender poop-chute. <br /><br />The Mexican Food Shit <br />A class all on its own. <br /><br />The Crowd Pleaser <br />This shit is so intriguing in size and&#x2f;or appearance that you have to show it to someone before flushing. <br /><br />The Mood Enhancer <br />This shit occurs after a lengthy period of constipation, thereby allowing you to be your old self again. <br /><br />The Ritual <br />This shit occurs at the same time each day and is accomplished with the aid of a newspaper. <br /><br />The Guinness Book Of Records Shit <br />A shit so noteworthy it should be recorded for future generations. <br /><br />The Aftershock Shit <br />This shit has an odour so powerful than anyone entering the vicinity within the next seven hours is affected. <br /><br />The &quot;Honeymoon&apos;s Over&quot; Shit <br />This is any shit created in the presence of another person. <br /><br />The Groaner <br />A shit so huge it cannot exit without vocal assistance. <br /><br />The Floater <br />Characterized by its floatability, this shit has been known to resurface after many flushings. <br /><br />The Ranger <br />A shit which refuses to let go. It is usually necessary to engage in a rocking or bouncing motion, but quite often the only solution is to push it away with a small piece of toilet paper. <br /><br />The Phantom Shit <br />This appears in the toilet mysteriously and no one will admit to putting it there. <br /><br />The Peek-A-Boo Shit <br />Now you see it, now you don&apos;t. This shit is playing games with you. Requires patience and muscle control. <br /><br />The Bombshell <br />A shit that comes as a complete surprise at a time that is either inappropriate to shit (i.e. during lovemaking or a root canal) or you are nowhere near shitting facilities. <br /><br />The Snake Charmer <br />A long skinny shit which has managed to coil itself into a frightening position - usually harmless. <br /><br />The Olympic Shit <br />This shit occurs exactly one hour prior to the start of any competitive event in which you are entered and bears a close resemblance to the Drinker&apos;s Shit. <br /><br />The Back-To-Nature Shit <br />This shit may be of any variety but is always deposited either in the woods or while hiding behind the passenger side of your car. <br /><br />The Pebbles-From-Heaven Shit <br />An adorable collection of small turds in a cluster, often a gift from God when you actually can&apos;t shit. <br /><br />Premeditated Shit <br />Laxative induced. Doesn&apos;t count. <br /><br />Shitzopherenia <br />Fear of shitting - can be fatal! <br /><br />Energizer Vs. Duracell Shit <br />Also known as a &quot;Still Going&quot; shit. <br /><br />The Power Dump Shit <br />The kind that comes out so fast, you barely get your pants down when you&apos;re done. <br /><br />The Liquid Plumber Shit <br />This kind of shit is so big it plugs up the toilet and it overflows all over the floor. (You should have followed the advice from the Lincoln Log Shit.) <br /><br />The Spinal Tap Shit <br />The kind of shit that hurts so much coming out, you&apos;d swear it&apos;s got to be coming out sideways. <br /><br />The &quot;I Think I&apos;m Giving Birth Through My Asshole&quot; Shit <br />Similar to the Lincoln Log and The Spinal Tap Shits. The shape and size of the turd resembles a tall boy beer can. Vacuous air space remains in the rectum for some time afterwards. <br /><br />The Porridge Shit <br />The type that comes out like toothpaste, and just keeps on coming. You have two choices: a) flush and keep going, or b) risk it piling up to your butt while you sit there helpless. <br /><br />The &quot;I&apos;m Going To Chew My Food Better&quot; Shit <br />When the bag of Doritos you ate last night lacerates the insides of your rectum on the way out in the morning. <br /><br />The &quot;I Think I&apos;m Turning Into A Bunny&quot; Shit <br />When you drop lots of cute, little round ones that look like marbles and make tiny splashing sounds when they hit the water. <br /><br />The &quot;What The Hell Died In Here?&quot; Shit <br />Also sometimes referred to as &quot;The Toxic Dump&quot;. Of course you don&apos;t warn anyone of the poisonous bathroom odour. Instead, you stand innocently near the door and enjoy the show as they run out gagging and gasping for air. <br /><br />The &quot;I Just Know There&apos;s A Turd Still Dangling There&quot; Shit <br />Where you just sit there patiently and wait for the last cling-on to drop off because if you wipe now, it&apos;s going to smear all over the place. ","time":1444187263563},"nvm":{"definition":"nevermind","time":1444187405911},"ala":{"definition":"Used to express sorrow, regret, grief, compassion, or apprehension of danger or evil.<br /><br />Indo-European Roots","time":1444187685851},"deathbed":{"definition":"What you create for yourself when you fart in a tanning bed.","time":1444188019379},"tanningbed":{"definition":"A box you lay down in that helps you get wrinkles faster.","time":1444188083145},"odie":{"definition":"1) the well known Garfield friend!<br />2) Someone that likes Lazio and Roma FC team <br />3) a real Manchester UTD hooligan!<br />4) Typical name for a Pc Engine user","time":1444188316021},"pneumonia":{"definition":"The hottest new diet out there!  Try it!","time":1444188357561},"tbag":{"definition":"When you dip your nuts in and out of her mouth ..","time":1444188680845},"putain":{"definition":"1) French word: bitch, prostitute, whore.<br />2) Familiar french interjection: damn, &apos;damn it !&apos;","time":1444189050179},"fagot":{"definition":"The incorrect spelling of faggot.","time":1444189145301},"yosh":{"definition":"derived from a Japanese word meaning an enthusiastic affirmative, often used in l33t and other forms of online communication. Expresses approval and","time":1444190147811},"l33t":{"definition":"As the Internet was coming into its own, during the early 1980s, hackers that didn&apos;t want their websites, newsgroups, etc, to be picked up in a simple keyword search began using numbers to replace certain letters (mostly vowels) such as A = 4 or E = 3.<br /><br />At this point, l33t speak was only known to a select few and only used when necessary. However, in 1994, id Software began to add Internet connectivity to Doom and Doom II, leading to a revolution in PC gaming and also to the rise of l33t speak.<br /><br />As with any type of competition, &apos;smack&apos; talk became prevalent in online gaming. Phrases such as &apos;I am elite&apos; became common place, and somewhere down the line l33t speak crept in, reforming the phrase into &apos;1 4m 3l1t3&apos; in order to demonstrate that the speaker was a hacker and someone to be feared. It was further exaggerated by purposeful bad spelling and eventually wound up as something like this, &apos;1 4m 3l33t!&apos; and simplified to, &apos;1 4m 133t&apos;. Hence the name &apos;l33t speak&apos;.<br /><br />l33t speak was still relatively unknown to the Internet masses at this point. It had almost disappeared from gaming entirely. However, a very popular web comic called Megatokyo brought l33t speak into mainstream with its infamous speak l33t? comic. These days l33t speak is very well known to the hardcore Internet community (especially gamers).<br /><br />As you&apos;ve already seen, basic l33t is just replacing vowels with numbers:<br /><br />A = 4<br />E = 3<br />I = 1<br />O = 0<br />However l33t is a very flexible &apos;language&apos; and you can go from this very basic l33t, to ultra 1337 by being creative; a few examples:<br /><br />O = ()<br />U = |_|<br />T = 7<br />D = |)<br />W = \\&#x2f;\\&#x2f;<br />S = $<br />There is no agreed-upon way to write l33t, so it&apos;s up to you whether or not to go with light l33t, medium 1337, hard |_337 or even ultra |_33¯|¯. In this entry, &apos;l33t&apos; is used except when referring to medium, hard or ultra &apos;1337&apos;.<br /><br />The -0r clause can be used in place of -ed or -er, for example &apos;1 0wnz0r!&apos; (most commonly seen in ultra 1337 as &apos;1 0\\&#x2f;\\&#x2f;|\\|z0r!&apos;) rather than &apos;1 0wn3d&apos;. However it can also be used like this, &apos;1 4m l33t h4x0r!&apos; (in ultra 1337, &apos;1 4|\\&#x2f;| |_337 |-|4x0r!&apos;) rather than, &apos;1 4m 4 133t h4ck3r!&apos;.<br /><br />As a general rule, in l33t, rather than use &apos;s&apos; to make something plural, a &apos;z&apos; is used instead. Also &apos;f&apos; is normally changed to &apos;ph&apos;. The short &apos;u&apos; is often changed to &apos;00&apos;, as well.<br /><br />Punctuation is usually left out with greater consistency as the level of l33t increases. Full stops are left out entirely because, when you are chatting online, where you would normally put a full stop you just hit &apos;enter&apos; to send the message and keep typing. Exclamation marks are used quite a bit (and usually quite a number at once), mostly because l33t is most commonly used in expressions of pleasure. Commas are generally left out in hard and ultra 1337, and are uncommon in medium 1337.<br /><br />Recently after the dawn of MMORPGs such as World of Warcraft as a popular form of online gaming, l33t speak has become an epidemic to the point of burnout.  Most l33t speak is generally considered a sign of immaturity or is done derisively and tounge in cheek.  ","time":1444190614307},"softporn":{"definition":"Colloquial expression of the full term &quot;soft pornography&quot;.<br /><br />Pornography that is relatively less visual then its antecedent &quot;hardcore porn&quot;. Does usually not contain close-up images of genitalia, will not display bodily fluids and does not require its participants to actually engage in sexual activity.<br /><br />This variety of sexual explicity is commonly enjoyed by beginning pornography viewers.","time":1444191003946},"penismonger":{"definition":"A male [prostitute].<br /><br />Etymology - [Penis] (the male reproductive organ) [monger] (one who sells something)<br /><br />The literal definition is &quot;one who sells penis&quot;","time":1444192423983},"rowboat":{"definition":"A politically correct word to say retard.","time":1444192455805},"pruny":{"definition":"The condition of your fingertips after a long shower, bath, or swimming excursion.","time":1444192488145},"torpid":{"definition":"Slow.","time":1444192556697},"fawb":{"definition":"1. Fawb NEVER gets action from girls.<br />2. He like to punch&#x2f;hit&#x2f;throw girls to the ground.<br />3. He&apos;s not caring.<br />4. He drives a shitty ass car.<br />5. UNATTRACTIVE<br />6. Douche bag, who will ALWAYS BE A VIRGIN.<br />7. Has a face full of acne.<br />8. Brags about his job.<br />9. Has a bush for hair.<br />10. Likes to fuck other guys up the ass.","time":1444192587920},"flopping":{"definition":"A cowardly exaggerated expression of pain or injury heavily utilized by soccer players to get a red card issued on an opponent. In most instances said soccer player shows no sign of injury or pain approximately 3 seconds after desired outcome of flopping. Therefore soccer players are cowards, pussies and cannot play competitive sports like true gentleman.","time":1444192598042},"rapgod":{"definition":"Eminem","time":1444192619252},"whitetrash":{"definition":"anyone who goes by the name Paris Hilton, wants to be Paris Hilton, knows Paris Hilton, or has spent one night in Paris Hilton.","time":1444192627331},"lamp":{"definition":"To hit someone, especially in the face. ","time":1444192631305},"pen15":{"definition":"An old grade school prank. You&apos;d write Pen 14 on your hand and walk up to an unsuspecting schoolmate and ask him if he wanted to join telling him he could be Pen 15. You&apos;d then write Pen 15 on his hand, and everyone would laugh at him.","time":1444192639231},"dw":{"definition":"don&apos;t worry","time":1444192698867},"ronaldmcdonald":{"definition":"McDonalds mascot. A clown that likes you to sit on his lap while he gets an erection.","time":1444192770307},"damnskippy":{"definition":"Not just yes, but HELL yes.","time":1444192848959},"jerkass":{"definition":"A highly rude or insensitive person.","time":1444192877924},"nad":{"definition":"1. testicles<br />2. a hair-removal product","time":1444193167026},"knob":{"definition":"The glans, the penis head","time":1444194557269},"dip":{"definition":"to leave abruptly. To get the hell out of somewhere.","time":1444194724014},"koffing":{"definition":"A Pokemon that is full of poisonous gases and spews them out in battle.","time":1444195869058},"thirsty":{"definition":"1. Too eager to get something (especially [play])<br />2. [Desperate]","time":1444197096496},"play":{"definition":"Anything to do with sexual relations: fooling around, making out, oral sex or having intercourse.","time":1444197105285},"foolaround":{"definition":"Also see [hook up]. To fool around: When two people, usually not currently in a relationship, find themselves kissing, participating in oral sex, and sometimes (but not always) can refer to having sex. Sometimes &apos;fooling around&apos; is used when the specifics of a hookup are unknown.","time":1444197142972},"oralsex":{"definition":"The act of two persons using their mouths to perform sexual intercourse.  These two persons can be of the same or opposite sex but they are rarely a married couple.","time":1444197159130},"bored":{"definition":"What you probably are if you&apos;re looking this up.","time":1444197181575},"desperate":{"definition":"Someone who wants something so bad they will go to extreme lengths to get it.","time":1444197189519},"hookup":{"definition":"1. recieved a good or service as a favor<br />2. to make out with someone <br />3. to have sex with someone","time":1444197205878},"4chan":{"definition":"you have just entered the very heart, soul, and life force of the [internet]. this is a place beyond sanity, wild and untamed. there is nothing new here. &quot;new&quot; content on 4chan is not found; it is created from old material. every interesting, offensive, shocking, or debate inspiring topic youve seen elsewhere has been posted here ad infinitum. we are the reason for &quot;[not safe for work]&quot;. we are the [anonymous] army. cross us and you will fail. anonymous is everywhere. you depend on us every day. we bag your groceries, we fix your computers. anonymous sees you before you see him. sitting at desks around the world right now is a nameless, faceless, unforgiving mafia composed of the best of the best.<br /><br />we are 4channers. the people devoid of any type of [soul] or [conscience]. products of [cynicism] and [apathy], spreading those very sentiments daily. anonymous is the hardened [war veteran] of the internet. he does not forgive or forget. we have seen things that defy explantions. heard stories that would make any god-fearing, law abiding citzen empty their stomach where they stand. we have experienced them multiple times and eagerly await their return.<br /><br />4chan is a place of sheer [genius] and utter [stupidity], and there is often a thin line dividing the two. here you will see a state of mind that exists in most human beings, but is rarely if ever shown. this is a place where taboos do not exist. 4chan cannot simply be regarded as a simple website or imageboard. it is so much more than code. 4chan is alive and constantly changing. this is a subculture, a self-governing sect of the world. rich in history and foundation. to become a 4chan user is to speak a different language. to leave behind any methods of conventional thinking you once knew.<br /><br />there are things here that you will not understand and things you never will understand. if you cannot accept this then [GTFO] now. because there is no turning back.","time":1444197265695},"head":{"definition":"When a girl wants to pleasure you by licking, sucking your penis. Often times, teens dont know how to do this, so they practice a lot. They often times forget to be moving her hand up and down on the part of the penis her mouth cant reach, which will help the ejactulation process. Some girls enjoy, some dont, luckily, my girl doesnt mind it at all. <br /><br />Advice to all guys: while getting head, make sure to stay very &quot;focused&quot; and into it, and think about how fucking awesome it is while its happening, and just how good it feels, it will make it even better, and during the orgasm, enjoy! It is the best, but, you might not feel the best right after, like, you will feel a little &quot;unhorny&quot;, but thats normal. Make sure to love your girl, because she definately cares enough to do this to you. My advice: go down on her too, if she wants it.","time":1444197278387},"hitler":{"definition":"verb, to Hitler someone; ie, smudge poop on their upper lip, creating the illusion of a Hitler-style moustache.  Usually performed while the victim is sleeping.","time":1444197462140},"california":{"definition":"1. State the produces more food than anywhere else, has crazy night life, large schools, hot women, a load of stuff to do, and a the longest beach anybody has ever seen.<br />2.  A place you&apos;ll want to stay in once you visit get there.<br />3.  Extremely diverse.<br />3.  Much more entertaining than Texas.","time":1444198794615},"weeb":{"definition":"A one-syllable contraction of &quot;weeaboo&quot;, which is Internet for &quot;wapanese&quot;.","time":1444199898185},"weaboo":{"definition":" A negative term directed to anyone overly obsessed with Japanese culture to the point where they become annoying.Used frequently on the image boards of [4chan].<br /><br /> Most weaboos are uneducated about their obsession of choice and are often [noob]s who are overly zealous, trying to impress others with their [otaku] knowledge. Another trait of a weaboo is their desire to &quot;be Japanese&quot;. <br /><br />While the two terms are often fused together, weaboos are very different from anime fans or enthusiasts. A fan may be just as enthusiastic and knowlegable<br />about Japanese culture, mainly [anime], but they neither boast about their knowledge nor call themselves [otaku](because of its known negative connatation). <br /><br />","time":1444199904757},"drol":{"definition":"Either a Pro Hormone or Designer Steroid, that has drol at the end of the name: Superdrol, Halodrol, Furzadrol, Methyl-Drol, etc. ","time":1444200454050},"charizard":{"definition":"While having sex with a girl with pubic hair, light her pubes on fire as you ejaculate.  Your semen will put out half of the burning hair, and afterwards while she is flapping her arms about wildly, scream: &quot;YOU DON&apos;T HAVE ENOUGH BADGES TO TRAIN ME!&quot; and run out of the room.","time":1444201171796},"oreo":{"definition":"what black kids at my school are called if they aren&apos;t intolerant and disrespectful trolls who hold up the hallway everyday in between class pushing pot and cutting the entire lunch line.","time":1444201182273},"alakazam":{"definition":"When you do a girl doggy style , then take it out and spit on her back to make her think you jizzed on it, then when she turns around, you jack off and cum in har face and say &quot;ALAKAZAM BITCH&quot;","time":1444201260397},"abt":{"definition":"Abbreviation of the English word &apos;About&apos;","time":1444202564951},"ce":{"definition":"CE is an acronym for &quot;casual encounters&quot; a section of the popular trading website craigslist. CE represents to the rest of the world a place where sexual favors are exchanged for the lowest level of implied commitment. It is typically infested with single moms, prostitutes, transsexuals, and jailbait who are all vying with each other to trap Mr. Scumbag USA into an LTR (Long Term Relationship) with the promise of NSA (No Strings Attached) sex.","time":1444204844902},"erica":{"definition":"The most [beautiful] queens to ever walk the face of this earth...women named erica are [fierce] by nature and generally quite [sassy]. ","time":1444205836900},"tsundere":{"definition":"Tsundere is a slang born on the Internet, and it is a word to describe the nature of female anime or game characters. Tsundere is a word combining two words, &quot;Tsun Tsun&quot; and &quot;Dere Dere&quot;. Both terms describe attitudes of a person. &quot;Tsun Tsun&quot; is used for cold&#x2f;blunt&#x2f;curt attitude, while &quot;Dere Dere&quot; is used when a person becomes [spoony] in front of his&#x2f;her lover. <br />(Definition is from the game &quot; Tsuyokisu Cool×Sweet &quot;)","time":1444205924347},"yandere":{"definition":"Contrary to the popular belief that it is the opposite of [tsundere], it describes an [anime] character who is either [psychotic] or [violent] or both, and shows affection to the main character.  Became a popular [moe] genre after the airing of the last episode of [School Days].  Other yandere characters include Ryuuguu Rena from [Higurashi No Naku Koro Ni] series.","time":1444205990260},"senpai":{"definition":"Someone who will never notice you.","time":1444206058207},"incest":{"definition":"The way the British royal family keeps itself German.","time":1444216682306},"shakeitoff":{"definition":"To forget about someone or something, to let go, to get over it, to move on.","time":1444217023839},"chewedup":{"definition":"Blow job&#x2f; head","time":1444219308125},"interjections":{"definition":"A short, usually excited and loud single utterance or shout. [Wunderbar], Ow, Hey, Ugh, and Wow are all interjections, and usually followed by an exclaimation point and sometimes more speaking.","time":1444221052005},"awol":{"definition":"Absent Without Official Leave: A term used in the United States Military to describe a soldier or other military member who has left his or her post without permission (usually in disagreement with a particular order).  This is one of many military terms that has trickled down into everyday speech among civilian populations.","time":1444221440881},"fathom":{"definition":"1. a unit of mesuring distance that is 6 feet or about equal to the length of a grown man&apos;s outstreched arms.<br /><br />2. to contemplate or think about with effort","time":1444221816017},"ihy":{"definition":"acronym for I Hate You","time":1444222049203},"shotsfired":{"definition":"(Interjection) - A reply given directly after a person gives a witty remark or serious [burn].","time":1444222416191},"casey":{"definition":"a hot dude with a huge fucking cock ","time":1444223181862},"anna":{"definition":"The name for the most awesome person ever, It is impossible to fit so much awesome into any other person.","time":1444223452739},"cumulative":{"definition":"increasing or enlarging by successive addition","time":1444223676175},"float":{"definition":"A term used in reference to letting someone borrow money from you. See also [front] and [spot].","time":1444224132413},"fold":{"definition":"to back down from any thing","time":1444226715234},"oral":{"definition":"in the mouth","time":1444226996063},"pouts":{"definition":"When a male or female puff their lips out &amp; having a straight face in a way of trying to be sexy.","time":1444227376358},"vouch":{"definition":"Commonly used among internet geeks and gamers: To agree with someone on a point.","time":1444228865692},"tbe":{"definition":"to be edited.<br />like if you&apos;re in a post about the person above you or you&apos;re in a speed post thread","time":1444228884447},"glovebox":{"definition":"a girl&apos;s vagina","time":1444230144318},"gloves":{"definition":"A slang term for a condom, as used in &quot;Can I Get a What What&quot; by Jay-Z.","time":1444230171608},"boxing":{"definition":"Boxing is often labeled as old-school in nature. The perseverance and mental fortitude required from a successful fighter is unique from other sports. When a boxer demonstrates courage and tenacity inside the ring, he is often labeled as a &quot;throwback&quot; to the golden days of boxing.","time":1444230192085},"ballcock":{"definition":"part in the toilet that lets in the water. also known as a fill valve.","time":1444231781142},"slurp":{"definition":"slurp; the act of performing oral sex.","time":1444232040242},"cava":{"definition":"From the French, literally &quot;it goes.&quot; When asked as a question, it means &quot;how&apos;s it going?&quot; (Ca va?) or used as a response to that question, it means, its going fine. (Oui, ca va.) ","time":1444232729421},"implode":{"definition":"To collapse in on ones self, to explode inwards.  Also, to fail miserably at something.","time":1444233372163},"mmmm":{"definition":"To express the like or enjoyment of someone or something.","time":1444234109274},"mmm":{"definition":"Used to express pleasure or contentment--not necessarily related to food.","time":1444234131059},"mmmmm":{"definition":"Used to describe something delicious or fantastically attractive.","time":1444234144791},"mmmmmm":{"definition":"another way of saying yeah right or no in a nicer way.<br />the more m&apos;s added the more out of the question it is","time":1444234150416},"rightthere...":{"definition":"synonym of [right on] or [spot on]","time":1444235925602},"gspot":{"definition":"I am a female and I am telling you that the g spot is real.  Put your fingers in the vagina, with your palm up.  An inch or two in, you will feel a rough spot on the wall of the vagina.  More your fingers in a sort of &quot;come hither&quot; motion, rubbing this spot.  (This doesn&apos;t work on virgins because the g spot is above the hymen)","time":1444235936392},"neo":{"definition":"Main chracter in the Wachowski brothers Matrix trilogy. Neo is played by actor Keanu Reeves. Neo is a mythical man and his coming was fortold in a propehcy.","time":1444236495896}}