{"28":{"definition":"The number 28 means to titty bite.  The number 2 is meant to look like a jaw while the 8 being titties.","time":1443401649789},"100":{"definition":"to stay true;to be real;straight up","time":1443359343054},"333":{"definition":"Half evil.<br /><br />666 = evil, hence 333 = half evil.","time":1443409792693},"911":{"definition":"Good Lord. Lets finalize this shit.<br />911 - Sports car<br />9-1-1 - Emergency Number<br />September 11 - the day terrorists attacked America. <br /><br />Lets not trivialize the sacrifice our Public Servants paid that day by saying &quot;nine-eleven&quot; &quot;nine one one&quot;.<br /><br />my $.02","time":1443322502231},"1738":{"definition":"A term used by rapper [Fetty Wap] in his song &quot;[Trap Queen]&quot; to represent his squad in New Jersey: the Remy Boyz 1738. The [Remy Boyz] named themselves after a cognac liquor which they claim to be the finest: the Rémy Martin 1738.","time":1443374643118},"2015":{"definition":"A year that Marty {Martin McFly or to his mom as a teen, Calvin Klien(it was on his underwear)}(actor:Michael J. Fox) and the Doc {aka Doctor Emmit Brown}(actor; Christopher Lloyd)go to in the Doc&apos;s time machine (dillorian) this year has flying cars and a &quot;sky way&quot;, pepsi bottles are hard to open,and any game you play with your hand is supposedly a &quot;baby&apos;s toy&quot;","time":1443404211000},"2019":{"definition":"The year that the worst generation of teenagers will graduate High School. These are the kids born in 2000-2001 that are commonly known for the stupid 12 year old stereotype. They only care about their iphones and claim to have had sex several times but havent even kissed a girl yet. They have corrupted the kids younger than them and will most likely not graduate college.","time":1443404223203},"love":{"definition":"nature&apos;s way of tricking people into reproducing","time":1443303733384},"weeb":{"definition":"A one-syllable contraction of &quot;weeaboo&quot;, which is Internet for &quot;wapanese&quot;.","time":1443303976582},"wapanese":{"definition":"“Wapanese” are decidedly [word]caucasian[&#x2f;word] individuals who, by means of thoroughly warped postmodern acculturation processes, have come to the decision that it is in their best interest to act as if they were denizens of the nation of [word]Japan[&#x2f;word].  The term “wapanese” can be accurately though of as an analog to [word]wigger[&#x2f;word].  A [word]whitey[&#x2f;word] can be classified as a “Wapanese” if they are in possession of two or more of the following defining traits:<br /><br /> <br />1.  Has an unhealthy obsession with shallow, saccharine and intellectually insulting animation shows (also refered to as [word]anime[&#x2f;word] by the [word]nerd[&#x2f;word] elite) originally tailored for young Japanese children<br /><br />2.  Operates under the erroneous belief that every aspect of [word]American[&#x2f;word] culture is vastly inferior to that of Japan’s – even though 99.9% of Wapanese have never had firsthand experience of any sort with their preferred culture (in other words, they’ve never set so much as one foot upon the island(s) of Japan)<br /><br />3.  Halfheartedly studies Japanese language and&#x2f;or is a part-time practitioner of martial arts<br /><br />4.  Has a sword (samurai swords only, of course) collection<br /><br />5.  Is a Virgin<br />6.  May be afflicted with a terminal case of [word]yellow fever[&#x2f;word]; however, they constantly fail in their quest for Japanese pootytang<br /><br />7.  Extreme cases may traipse around whilst wearing a “costume” that makes them resemble their favorite [word]anime[&#x2f;word] characters (this practice is reffered to as [word]cosplay[&#x2f;word]; cross-dressing and raging homosexuality is not an uncommon component of cosplay.<br /><br /><br />Interestingly, Wapanese are generally though of as “failures” and rejects within their own culture.  Social scientists such as myself speculate that it was their failure to gain acceptance within their own culture than has lead many a white [word]geek[&#x2f;word] to seek out Japan’s culture as a surrogate; however, they’d be shattered to know that the insular and somewhat [word]racist[&#x2f;word] Japanese society would be even less accepting of them than the people of their true and native culture.","time":1443303983505},"weeaboo":{"definition":"Someone who is obsessed with Japan&#x2f;Japanese Culture&#x2f;Anime, etc. and attempts to act as if they were Japanese, even though they&apos;re far from it. They use Japanese words but usually end up pronouncing them wrong and sounding like total assholes. You can find alot of these faggots clogging up the forums of Gaia Online, hanging out in the international aisle of the supermarket, or crowding the manga section of your local bookstore. Synonym of [wapanese].","time":1443303993394},"leftnut":{"definition":"n.   a part of one&apos;s anatomy that one would sacrifice to experience something exceptional","time":1443304119857},"kappa":{"definition":"The main symbol&#x2f;emote of Twitch.tv. It represents sarcasm, irony, puns, jokes, and trolls alike. If you see this term used outside of Twitch.tv, then this is not the correct definition. Usually used at the end of an ironic or sarcastic sentence. Sentences that contain a Kappa should not be taken seriously. If you search &quot;Kappa Twitch.tv&quot; in Google you can see what the emote looks like, and why it is used as it is. Sentences that use Kappa do not always have to make sense.","time":1443304122779},"rightnut":{"definition":"the position of a passenger in the back seat of a vehicle, directly behind the person in [shotgun] position ","time":1443304126009},"wallace":{"definition":"WALLACE : verb (to WALLACE, Wallaced, Wallacing)  ON THE RIVER Wallace takes three forms:  1) Upwards Wallace - where the boat is flipped and dumps the entire crew (rafting)  2) Downward Wallace - where the swimmer(s) take an especially nasty deep swim (rafting)  3) Baby Wallace - A dirtbag lost his or her seat, paddle, or maybe a custy or two (rafting)  kayakers and C-1ers are Wallaced when they get worked in a hole, run over by a rubber pusher, get an epic beat down, and of course anytime they swim.  OFF THE RIVER:<br />Dirtbags are well known by their frequent slapping of beers and other precious articles (such as paperwork) from each other&apos;s hands. They take the same form as on the river, Downward: off the feet. Upward: off the face. The Baby Wallace is a slight bump of the arm that results in slight spillage, kind of like a warning shot... &quot;Hey Dirtbag, pay attention!&quot; with the added caveat that one must properly declare the Wallace by yelling &quot;Wallace&quot; during the act. (IF YOU DON&apos;T DECLARE WALLACE WHILE BEGINNING THE ACT, YOU ARE AN ASSHOLE AND SUBJECT TO A PUNCH IN THE NOSE!)<br />And no crying or getting angry watching your Wallaced drink soak into the earth! Grab it and pound it out!!!<br />NOTE: highly frowned upon to WALLACE a full beverage. Large stack of paperwork... BONUS POINTS  WALLACE may also be used in lieu of the word BURN!, in it&apos;s declarative form.","time":1443304148997},"steven":{"definition":"Sexy, Cool, Swave and Sophisticated","time":1443304158106},"foh":{"definition":"acronym for &quot;Fuck Outa Here&quot;","time":1443304330089},"goblin":{"definition":"class of gangster above a goon. rich,, powerful, yet still from the hood. killing on others below them and has much more authority. usually the head of gangs and has  much protection, but always loyal and always keep it real ","time":1443304469472},"wv":{"definition":"Word Verification. Some sites (like Blogger) have an option for the moderator to require comment posters to type in a random set of letters in order to make a comment. This requirement weeds out some comment spambots. Occasionally the Word Verification letters are eerily or humorously related to the content of the comment, and the poster will reference this in the comment with &quot;WV: word. Example sentence.&quot;","time":1443304513657},"carrowinds":{"definition":"A very annoying word used by Cameron directed toward Matt because he goes to Carrowinds often.<br />This word can be used to describe a place,city,or world.<br />A amusment park.","time":1443304547512},"dweeb":{"definition":"A dorky or nerdy person.","time":1443304639147},"johncena":{"definition":"Right as you cum while getting a blowjob, pull out of her mouth and blow your load right into her eyes. <br /><br />Proceed to wave your hand in front of your face and go &quot;YOU CAN&apos;T SEE ME!&quot;","time":1443304743153},"jamaica":{"definition":"A small, independent island country in the West Indies (Caribbean).  Originally a British colony and site of Port Royal, an important naval base and commercial center during colonial times.  The country obtained independence from British rule in 1962.  Currently famous for [ganja], [reggae] music, the [Rastafarian] ([rasta]) religion, and [jerk cooking].  Home to a population of 3 million, the Bob Marley Museum, and some seriously frightening drivers.","time":1443304781831},"aka":{"definition":"It&apos;s a short hand way and abreviation to say &quot;Also Known As&quot;","time":1443304801974},"fathom":{"definition":"1. a unit of mesuring distance that is 6 feet or about equal to the length of a grown man&apos;s outstreched arms.<br /><br />2. to contemplate or think about with effort","time":1443304886620},"twizz":{"definition":"to be intoxicated by alcohol.<br />or alcohol itself.","time":1443304992394},"cyber":{"definition":"Online sex that loners engage in if they are too ugly and boring to get a real boyfriend&#x2f;girlfriend.","time":1443305011979},"weeze":{"definition":"The word my mother used to describe the vagina when I was a young girl. This led to major confusion when a friend tried to explain her asthma to me.","time":1443305081771},"bakugan":{"definition":"A card&#x2f;marble game requiring Bakugan marbles and metal gate cards.<br />A Bakugan is rolled onto a metal gate card to open up.<br />Bakugan come in six attributes, and each Bakugan has a number called &quot;G power&quot; G power is what a Bakugan needs to beat another.<br />The Bakugan with the highest number wins.","time":1443305239035},"patch":{"definition":"In Computer Software industry: the process of taking old bugs out and putting new ones in.","time":1443305471762},"luded":{"definition":"Smoke or lost to a honda prelude in a race. as in prelude &apos;LUDED&quot;","time":1443305492021},"nipples":{"definition":"the center of a womans breast that become pointed, hard, and erect when they are stimulated or the woman is horny...or really cold...<br />not a sexual organ, but generally feels good when rubbed, sucked, licked, bitten, or vibrated.it typically turns guys and girls on when they see a girls hard nipples showing through her shirt, especially when the girl isn&apos;t wearing a bra.","time":1443305535535},"retardedness":{"definition":"the act of being retarded","time":1443305543801},"blastoise":{"definition":"One of the great water pokémon, fully equipted with a duel hydro pump.  He must have a HUUUGE BLUE COCK!","time":1443305686125},"gundam":{"definition":"1. A franchise of Japanese animation television series, OVAs, and movies, along with manga, models, video games, and other connected merchandise. Gundam is the property of Bandai of Japan and it&apos;s subsidiary Sunrise Incorporated, headquarted in Kobe Japan. The origional Gundam TV series, which aired in 1979 was called Kido Senshi Gundamu (Mobile Suit Gundam) and was the brainchild of anime legend Yashuyuki Tomino. Gundam as a general term can be used to denote not only the origional series, but any work that came after it. The UC series created by Tomino himself are regarded by critics and die-hard fans as being vastly superior to any of the newer incarnations.<br /><br />2. A high performance mobile suit used in a work which is part of the Gundam franchise. Gundams, like all mobile suits are large humanoid combat vehicles inititially developed for use in outer space conflict. The first Gundam was developed as part of the Earth Federation V-Project in 0079 of the Universal Century, to counter the Principality of Zeon&apos;s technological superiority. Needless to say, it was a success. Gundam can be used to refer to any of the derivatives of the Gundam in the UC universe, or any copies in alternate universes. Gundams are characterized by their signature V-Antenna, two eyes, and a somewhat blocky anthropomorphic design. They are often white, with red and white components, and are usually piloted by the heroes of the story. Note:All Gundams are mobile suits, but not all mobile suits are gundams.","time":1443305706966},"hajimehinata":{"definition":"The main character from Super [Dangan Ronpa] 2: Sayonara Accademy of Despair. Usually shipped as Komahina with [Komaeda]. He is more cynical than [Makoto Naegi] from Dangan Ronpa 1 . He also has a cameo in Dangan ronpa: Another Episode as his other self.  Spoilers:  Has an alternative identity named Izuru Kamakura which plays a major role in chapter 6 &amp; 0. This later influenced how the mastermind came back in SDR2.","time":1443305719967},"charizard":{"definition":"While having sex with a girl with pubic hair, light her pubes on fire as you ejaculate.  Your semen will put out half of the burning hair, and afterwards while she is flapping her arms about wildly, scream: &quot;YOU DON&apos;T HAVE ENOUGH BADGES TO TRAIN ME!&quot; and run out of the room.","time":1443305763723},"knockoff":{"definition":"An item that looks exactly like an original product but lacks the expensive designer label and is replaced with a fake one. Usually costs half the price with half the style appeal.","time":1443306115006},"weird":{"definition":"Interesting or strange.","time":1443306550273},"banter":{"definition":"Supple term used to describe activities or chat that is playful, intelligent and original. Banter is something you either posses or lack, there is no middle ground. It is also something inherently English, stemming as it does from traditional hi-jinks and tomfoolery of British yesteryear.","time":1443306822260},"amaze":{"definition":"Amaze means amazing.<br />It is commonly used by annoying teenage girls who don&apos;t like to say more than 2 syllables maximum. ","time":1443306835578},"rs":{"definition":"An abbreiviation for an [MMORPG] called [runescape] . A Very cool game.","time":1443306920310},"allegiant":{"definition":"The third and final installment in Divergent trilogy. Written by Veronica Roth.","time":1443306983468},"whit":{"definition":"A Super Hot and Sexy Woman with Junk in &apos;er Trunk.","time":1443307116527},"pawg":{"definition":"Phat Ass White Girl; girl with a phat ass and is white; commonly said by black males.","time":1443307124484},"wy":{"definition":"A slang word for a homosexual or also used in wrong terms when person is disliked.","time":1443307276687},"wutang":{"definition":"The second best Tang in the world.  Next to grape, I mean [poon] of course.  Consists of the RZA, GZA, ODB, Inspectah Deck, Raekwon the Chef, U-God, Ghostface Killah, Masta Killa, and Method Man.  Also a large syndacyte consisting of Cappadonna and Killah Priest to name a few.  Easily the best rap group with sharp lyricism named after the legendary Wu Tang sword of Chinese mythology.  Most songs involve a kung-fu intro followed by great production and outstanding lyrics.  All nine hail from Shaolin (Staten Island) and have produced 4 group albums in addition to MANY solo projects.","time":1443307334534},"fr":{"definition":"For Real","time":1443307498306},"megadeth":{"definition":"The worlds state of the art speed metal band","time":1443307569901},"fma":{"definition":"FMA is short for Fullmetal Alchemist.<br />It is an anime and manga filled with Action, Adventure, and Comedy. It&apos;s about the Elric brothers who are alchemists. It starts off with the brothers trying to bring their dead mother back to life with alchemy, but then Edward (older) loses an arm and a leg, and Alphonse (younger) loses his whole body.<br />There is said to be 52 episodes for the series. And in Japan, it is called Hagame no Renkinjustsushi.","time":1443307700859},"russianroulette":{"definition":"A sexual act involving 7 people. One person stands blindfold and pants-less while the other 6 form a circle around with their bare asses facing inwards while bending over, grabbing their ankles. The person in the middle spins around and then thrusts, trying to penetrate one of the six asses. If the thruster is a woman a strap on is required.","time":1443308024160},"blueballs":{"definition":"the excrutiating pain a man receives when his balls swell to the size of coconuts because of lack of sex, unfinished bjs, and just not cummin when he knows he should.<br /><br />Cure: JUST WACK IT MAN!! or get your woman to help you out and do the job right. It&apos;s that simple to make the horrible pain go away.","time":1443308482735},"blackballs":{"definition":"To cosnpire to ruin someones reputation untill they become unemployable and people refuse to associate with them.","time":1443308489435},"roast":{"definition":"To humorously mock or humiliate someone with a well-timed joke, diss or comeback.<br /><br />Noun form: the aforementioned joke, diss or comeback.<br /><br />See also [sizzle]<br />","time":1443308503186},"candle":{"definition":"A device used for nun masturbation.","time":1443309096461},"whatarethose":{"definition":"This is what you say&#x2f;scream when you see someone wearing shoes or other footwear that are dirty and&#x2f;or non-brand unknown. You should also point your finger in the air then while saying &quot;what are those?!&quot; Make your way down to the person shoes, all while their back is turned.","time":1443309205154},"rule66":{"definition":"The 66th rule of the Internet, which states that if it exists, there is a dubstep remix of it.","time":1443309671733},"gnsp":{"definition":"Good Night Sweet Prince","time":1443309904371},"stfy":{"definition":"1. Common misspelling of [STFU].  Often followed by its correct spelling in the next message.<br /><br />2. Can be quickly given the meaning &quot;SHUT THY FUCKING YAP&quot; when confronted about your misspelling.","time":1443310129519},"stf":{"definition":"Sa te fut<br />Romanian abbreviation for &quot;fuck you&quot;","time":1443310209603},"std":{"definition":"STD - stands for Sexualy Transmited Disease. The most commonly known is HIV&#x2f;AIDS. To say the least you don&apos;t want an STD.","time":1443310211354},"sick":{"definition":"1)crazy, cool, insane<br />2)what one is on a test day","time":1443310511282},"christianrock":{"definition":"An oxymoron.","time":1443311072168},"deeznuts":{"definition":"1) A sarcastic expression used to denote annoyance or frustration.<br />2) A term used when you just dont give a fuck<br />3) Look, my dick and balls are bigger than yours.","time":1443311105348},"acehood":{"definition":"Ace Hood (born May 11, 1989 in Deerfield Beach, Florida) is an American rap artist signed to DJ Khaled&apos;s label, We The Best Music, best known for his single, &quot;Cash Flow&quot;.[2][3][4] He is scheduled to release his debut album, Gutta, on August 26th 2008, and is also appearing on DJ Khaled&apos;s next album, We Global.In 2007, Ace Hood met DJ Khaled outside the offices of WEDR 99 Jamz, a South Florida radio station that mainly plays hip hop and contemporary R&amp;B music. Ace gave him a biography of himself and a demo tape. The same night, Khaled called Hood&apos;s manager and said he loved Ace&apos;s hunger and image. Khaled presented Ace one more test; to rap over the instrumental of &quot;I&apos;m So Hood&quot;. Khaled loved what Ace did, and a few weeks later, he was signed to We The Best Music, and soon after Def Jam.","time":1443311235793},"shawarma":{"definition":"Scary, but tasty meal consisting of [Mediterranian] spiced hicken or beef cooked on a revolving spit, wrapped up in a soft, warm [pita] along with veggies such as tomatoe, parsely, hommus, pickled turnips, lettuce, onion (sprinkled with [Sumac]), all doused with garlic, sweet &amp; sour, &amp;&#x2f;or tahini sauce. Similar to Greek [Gyro] or Middle-Eastern [Donair] (Doner) kebobs. [Ottawa] [Canada] has more Shawarma shacks than anywhere outside downtown [Lebanon].<br />","time":1443311303727},"madokamagica":{"definition":"An anime and manga series that centers around a girl named Madoka Kaname, and her friends Mami, Sayaka, Homura, and Kyoko, who meet a creature names Kyuubey that offers to grant them one wish if they will in turn become magical girls and help fight witches, which are the source of evil in the world.","time":1443311572525},"drake":{"definition":"Drake refers to a type of dragon that flies around small towns and large cities eating everyones pudding and spitting in their garbage cans. He will turn your jello into fruit punch and your coffee into kittens. Beware, this type of dragon will rape you in the toes at any given chance.<br /><br />P.S. they are extremely poisonous and are very sensitive about their sexuality and do not like to be touched at all.","time":1443311582714},"aubreygraham":{"definition":"The cutest and most suave dude on Degrassi. Always fly and always cool.","time":1443311626944},"drizzy":{"definition":"The up and coming rapper drake.  Nicknamed &quot;Drizzy Drake&quot; and can be found on many tracks with fellow young money rapper Lil&apos; Wayne, where he outshines wayne on every one of those tracks.","time":1443311699902},"anohana":{"definition":"Probably the realest anime you will ever watch. You&apos;ll know of its realness when you hit the end of episode 12. Good lord the feels. I watched Anohana last month. I&apos;m still crying.","time":1443311735166},"jazzy":{"definition":"Someone who is so smooth and fly. Real and classy all at the same time","time":1443311807881},"cancer":{"definition":"A disease lacking a sense of humor.","time":1443312177818},"lenny":{"definition":"a fine, sexy ass, tall guy.  <br />a well rounded individual.<br />intelligent<br />ladies love him","time":1443312194060},"lennyface":{"definition":"A unicode emoticon used when something might be edgy.<br />( ͡° ͜ʖ ͡°)","time":1443312198959},"bbau":{"definition":"(noun) Bitches Be Actin&apos; Up  Sometimes, a hoe gets off her leash and starts acting the fool. This constitutes a BBAU moment.","time":1443312245859},"bei":{"definition":"someone close","time":1443312376735},"bea":{"definition":"The name of the most amazing girl that you&apos;ll ever meet. With her, you get everything. A mixture of both beauty and an amazing personality, something rare to find nowadays. Someone that&apos;s kind and caring, smart, funny, good sense of humor, fun and easy to be around, mysterious in some ways, shy yet outgoing, sometimes dorky, etc. It&apos;s not hard at all to fall in love with this girl, both as a friend and a lover. When you hold her hand or wrap your arms around her, you&apos;ll never want to let go. She is a blessing in the lives of all those that are privileged to have her in their life. She makes you do things that you&apos;ve never done before. If you&apos;re lucky enough to have her, you should never let her go. She is just that amazing and should be cherished.","time":1443312380631},"bae":{"definition":"Bæ&#x2f;bae is a Danish word for poop. Also used by people on the internet who think it means baby, sweetie etc.","time":1443312389257},"cured":{"definition":"The condition of [marijuana] obtained by keeping it in a bag over a long period of time (months) and opening it every now and then (weeks) for it to get some air.  This process supposedly makes it taste better when smoked.","time":1443312629991},"flashing":{"definition":"Revealing your &quot;private parts&quot; to another person <br /><br />ie. <br />whipping out your penis<br />showing your tits","time":1443313348110},"wym":{"definition":"(Phrase) Meaning &quot;I&apos;m too lazy to type out &apos;what you mean?&apos;&quot;","time":1443313351587},"mf":{"definition":"mf has 2 meanings, often used as:<br /><br />(i) Mother Fucker<br />(ii) My Friend<br /><br />definition (i) is more commonly seen in chatrooms; whereas definition (ii) seen in multiplayer games.<br /><br />if someone uses mf towards you, it&apos;s best to pretend you dont understand, so they will explain - either (i) or (ii). Since you dont want to just start insulting them.","time":1443313548277},"8=d":{"definition":"I though it was a smiley face. I used it everywhere. Now I&apos;m banned from lots of forums. =(","time":1443315738872},"sue":{"definition":"A beautiful intelligent lady, who is determined to change the world for the greater good. Her incredible smile lights up the room. Her amazing personality and funny charm attracts men and women to want to be friends with her. It also helps that she has a nice rack. She is also one of the most caring people you will ever meet. She is a traveler and well cultured. Most Sues are athletic too. Watch out for this powerhouse, she can be the biggest bitch if you cross her or her loved ones. Sue would make a great teacher, lawyer, or accountant.","time":1443316072195},"lawsuits":{"definition":"Something vietnamese people do when they get into accidents.","time":1443316084896},"ericcartman":{"definition":"A foul-mouthed, mean spirited, sexually confused, and morbidly obese 9-year-old on South Park.","time":1443316102890},"jews":{"definition":"1. Someone who practices Judaism.<br /><br />2. Derogatory term for someone tight with their money or someone not very generous.","time":1443316129263},"chill":{"definition":"1. to calm down<br />2. cool, tight, wicked, sick, sweet, nice, etc.<br />3. to hang out<br />4. to be easy going<br />5. a little bit cold<br />6. its ok","time":1443316435916},"8=3":{"definition":"This is supposed to resemble a man&apos;s genitals. 8 resembling the balls, = resembling the you know what and the 3 resembling the end. Yeah pretty sick.","time":1443316576386},"comethru":{"definition":"To go over to the location a thirsty nigga is tryna get you so he can beat it up","time":1443317511538},"incompetent":{"definition":"A lack of intelligence, or inability to do simple tasks.","time":1443317576469},"cba":{"definition":"Can&apos;t Be Arsed.  Unwilling to expend energy on the task in hand.  May be used more generally in reference to the state of mind where nothing at all seems remotely worth doing.","time":1443317684043},"oppai":{"definition":"japanese. (usually, a woman&apos;s) breasts. a tasty treat.","time":1443318056181},"mismo":{"definition":"Your Best friend, a good person you hand out with a lot.","time":1443318086697},"deuces":{"definition":"when someone holds up two fingers symbolizing &quot;peace&quot; when leaving an establishment, &quot;deuces&quot; is often said. ","time":1443318223470},"aggy":{"definition":"Getting angry, violent, short for aggitated","time":1443318516128},"darksouls":{"definition":"Dark Souls is the Sequel to the 2009 PS3 exclusive title &apos;&apos;Demon&apos;s Souls&apos;&apos;. Dark Souls is an action RPG released in October 2011 by Bandai Namco and From Software.  In Dark Souls you play as a chosen Undead or &quot;hollowed&quot;. Aside from the opening cinematic, the game lacks any real overarching story and is instead told by your interactions with various NPCS. The game features an open world with many interesting bosses each with their own unique looks and attacks.  Dark Souls is mistakenly considered a very difficult game, however, it is more of a trial and error game similar to Capcom&apos;s Mega man franchise. Players are meant to die in the game over and over until they eventually learn what they are supposed to do.  Dark Souls features a unique online multiplayer system where players can enter another players game and assist them with killing enemies or to duel in PVP.  The game features a lot of character and weapon customization and will keep players occupied for a long time.","time":1443318713178},"drumsticks":{"definition":"An amazingly delicious ice cream cone filled with chocolate and peanuts","time":1443319166065},"atm":{"definition":"At the moment.","time":1443319227306},"queer":{"definition":"queer: Originally pejorative for gay, now being reclaimed by some gay men, lesbians, bisexuals and transgendered persons as a self-affirming umbrella term. Caution: still extremely offensive when used as an epithet.<br /><br />","time":1443319556762},"queertheory":{"definition":"The theory that hates on gender roles and gender identity. The &quot;queer&quot; or &quot;strange&quot; people are awesome. Also, heteronormativity is really bad because society has developed a &quot;norm&quot; that they are superior, so the idea that we need to prevent death or extinction is bad because it ignores that gays and lesbians cannot reproduce. A lot of Queer Theory&apos;s credentials go Lee Edelman.","time":1443319559857},"heteronormativity":{"definition":"A term that can be used to describe institutions, policies and beliefs that reinforce the rigid categories of male and female. These categories, supposedly, determine our sex, sexuality, sexual desire, gender identity, and gender roles.","time":1443319571192},"dd":{"definition":"Really big breats - Double D.<br />","time":1443319789874},"wet":{"definition":"1)when a girl is horny and leak vaginal fluid<br />2)when someone has a bedwetting accident<br />2)to smoke PCP","time":1443319914263},"i'mwet":{"definition":"To be intoxicated beyond comprehension, stupefied by an alcoholic potion; helplessly inebriated","time":1443319918454},"moist":{"definition":"When a female becomes sexually aroused. ","time":1443319922057},"vagina":{"definition":"The best friend a penis will ever have.","time":1443319944672},"vaginalfluid":{"definition":"Fluid that flows like [honey] from a woman&apos;s [vagina] when she&apos;s horny.","time":1443319947699},"irrational":{"definition":"See [female].","time":1443320564442},"dw":{"definition":"don&apos;t worry","time":1443320579197},"loli":{"definition":"1) short for [lolicon]<br />2) [hentai] that contains underage females in sexual situations.<br />3) an underage child, often depicted in sexual poses in hentai movies&#x2f;images.","time":1443321500354},"calvinharris":{"definition":"Typical sellout, in his old days he was a cool electro&#x2f;house music artist who released cool tracks like &quot;The Girls&quot;, &quot;Blue&quot; and &quot;Acceptable in the 80s&quot;. Now he&apos;s a pop star who releases chart music for kids and people who like pop music. He just releases tracks now where he provides some average bet for some horrible rapper like Tinie Tempah to rap over or for some chart singer to sing over. The fact more people like him now does NOT make him a better music artist.","time":1443321730837},"kq":{"definition":"Kink Quotient. On a scale of 1-9 (10 being seriously frowned upon by the law)<br />A numerical evaluation of an individuals penchant for deviant sex or otherwise.","time":1443321819215},"kg":{"definition":"The act of licking the sensitive area between the ball sac and the anus.","time":1443321828133},"50shadesofgray":{"definition":"simply put, it&apos;s paperback porn","time":1443321972716},"patamon":{"definition":"An orange rodent-like [Digimon] who has [Tai] as his Tamer. He is a [Rookie Digimon] and can [Digivolve] into several other Digimon such as Angemon and Pegasusmon.","time":1443322029468},"veemon":{"definition":"The ultimate idiotic annoying lifeform.","time":1443322043396},"agumon":{"definition":"Agumon is a Rookie Digimon creature from the Japanese Digimon media franchise that comprises anime, manga, toys, video games, trading card games and other media. He is the unofficial mascot for the Digimon franchise as he and his alternate forms (called Digivolutions) are featured in almost all Digimon media&#x2f;merchandise. The name &quot;Agumon&quot; is partly derived from the Japanese onomatopoeia &quot;aguagu&quot;, the sound of biting, and from the suffix -mon (short for &quot;monster&quot;) which all Digimon carry at the end of their names. Thus, Agumon is literally a &quot;biting monster&quot;. Coincidently, the world &quot;Agu&quot; also means Fire in Nepalese as Agumon often is seen using fire attacks.  &quot;Agumon&quot; is the name that all members of this particular Digimon species share. There are several different Agumon that appear in various Digimon anime and manga series who are almost always main Digimon characters. Each lead Agumon is partnered (bonded) with a child called a DigiDestined. DigiDestined are children chosen by benevolent beings (usually a group of ancient, powerful Digimon) to defeat evil forces in the Digital World, the plane on which all Digimon live. The DigiDestined use their psychological states to trigger their Digimon to transform into a Digivolved form. Digivolution changes a Digimon&apos;s species and increases its power dramatically.  The most well-known appearance of Agumon is in the Digimon Adventure anime as the partner of Taichi Kamiya (called &quot;Tai&quot; for short). An Agumon also appears as a main character in Digimon Savers, partnered to Masaru Daimon. In the Digimon Next manga one is partnered to Tsurugi Tatsuno, and another with Teru Raku in the D-Cyber Chinese manhua.  The Agumon of Digimon Adventure also appears in the sequel series Digimon Adventure 02 and all the Digimon Adventure&#x2f;02 related movies.<br />He is a cross between a fire breathing dragon and a Tyrannosaurus Rex.  Agumon is a short and stout Tyrannosaurus rex-like Digimon standing about 2½ feet tall, though an Agumon appearing in Digimon: The Movie stands about 7-9ft tall, though this Augumon was different from the one appearing in the series. His skin is bright orange and his eyes, which are large and disc-shaped, are light green. His forearms are noticeably larger than his upper arms because they are comprised entirely of broad, three-clawed hands. (Early artwork for the Digimon virtual pet depicted him with four claws per hand.) Agumon&apos;s large feet also sport three claws. Rare for Digimon of his size (yet common for many higher level digimon), Agumon has distinct pectoral muscles. His tail is fat and stubby, and his head and muzzle are almost as large as the rest of his body. Each side of his head has a small, visible ear-hole. Agumon is a vaccine type Digimon.  Agumon is the main Digimon in Digimon Adventure, the first Digimon anime series. Agumon&apos;s personality is extremely brave, relaxed, and funny. Being partnered to the leader of the eight DigiDestined featured in Adventure, Agumon is a decisive factor in many battles. He is always the first of the partner Digimon to Digivolve into a stronger form. Agumon is also one of only two partner Digimon to Digivolve to the Mega level, the highest and strongest form a Digimon can obtain. (Yamato &quot;Matt&quot; Ishida&apos;s partner Gabumon is the other Digimon to reach Mega.)<br />Agumon plays a major role in the Digimon Adventure movie Our War Game!. (This film was combined with Digimon Adventure (Movie) and Digimon Hurricane Touchdown&#x2f;Supreme Evolution! The Golden Digimentals to make the English language Digimon: The Movie.) In it, Agumon and Tai teams up with Matt, Gabumon, Tentomon (partner of Izzy Izumi), and Patamon (partner of T. K. Takaishi) to enter the Internet to battle Infermon, an evil Digimon who had taken residence there. (Digimon are made of data and can enter electronic communication networks at will; DigiDestined are temporarily converted to data for this purpose.) Eventually, Infermon was defeated when WarGreymon (Agumon&apos;s Mega form) DNA Digivolved with MetalGarurumon (Gabumon&apos;s Mega) to form Omnimon.  Agumon in episode 11 of Digimon Adventure 02, (The Storm of Friendship).<br />In Digimon Adventure 02 new DigiDestined were chosen to defend the Digital World. Agumon was no longer a main character, although he made intermittent appearances throughout the series. His most notable contribution was to begin the chain of events that led to Veemon (the new main Digimon) obtaining Raidramon, one of his Armor Digivolved forms. Agumon was temporarily held captive by the Digimon Emperor, the evil persona of the DigiDestined actually named Ken Ichijouji. He was forced to Dark Digivolve to SkullGreymon and a possessed MetalGreymon. Veemon and his partner Davis Motomiya unlocked Veemon&apos;s Raidramon form during the battle to free Agumon.  Attacks<br />Pepper Breath&#x2f;Pepper Flame&#x2f;spit fire blast: Shoots an orange and red fireball of varying strength from his mouth.  The name &quot;Agumon&quot; refers only to the Rookie form of this Digimon. Throughout the series, Agumon gains the ability to Digivolve into a number of more powerful forms, each with a different name and special attack. However, the Rookie level is his preferred form and the one he spends most of his time in, due to the amount of energy required to stay in a higher form.","time":1443322057317},"sjw":{"definition":"Social Justice Warrior. A pejorative term for an individual who repeatedly and vehemently engages in arguments on social justice on the Internet, often in a shallow or not well-thought-out way, for the purpose of raising their own personal reputation. A social justice warrior, or SJW, does not necessarily strongly believe all that they say, or even care about the groups they are fighting on behalf of. They typically repeat points from whoever is the most popular blogger or commenter of the moment, hoping that they will &quot;get SJ points&quot; and become popular in return. They are very sure to adopt stances that are &quot;correct&quot; in their social circle.  The SJW&apos;s favorite activity of all is to dogpile. Their favorite websites to frequent are Livejournal and Tumblr. They do not have relevant favorite real-world places, because SJWs are primarily civil rights activists only online.","time":1443322091200},"terriermon":{"definition":"A rabbit like character from the tv show [digimon], who is actually based on the dog breed [terrier], and not a rabbit as portrayed in the english dub. He is small and [feisty], the clown of the series. First appeared in the only English movie; Digimon the Movie, and in the third japanese film; Digimon, Hurricane Touchdown&#x2f;The Golden Digimentals.<br />He was first partnered with a young boy named Wallace, or Willis in the English version, and was the twin of the digimon [Lopmon] who was actually based on a rabbit. <br />In the original japanese version, Terriermon is named &quot;[Gumimon]&quot;, after his babyII&#x2f;in training stage. Lopmon is named after his babyII&#x2f;in training stage in both versions, and is referred to as [Cocomon]. <br />The second and most recent time Terriermon was included in [Digimon] was in Season 3, Digimon Tamers, partnered with Henry Wong (a different Terriermon, however).<br />This Terriermon is where we have the phrase &quot;[momentai]&quot; from (also written as moumentai) which translates as &quot;take it easy&quot; or &quot;relax&quot;, which sums up the tiny digimon nicely, calm and layed back, a reluctant fighter. <br />His most notable move is his &quot;petit twister&quot; or &quot;Terrier Tornado&quot; in the dub, in which he spins his long ears quickly to create a mini twister with great force.","time":1443322104223},"menstruating":{"definition":"When a woman bleeds from her vagina for 4 - 7 days and is usually pretty irritable because she has to either shove a stick up there or wear a mattress between her legs until she is DONE menstruating- also she has a bunch of extra hormones so BACK OFF.","time":1443322104868},"z100":{"definition":"A radio station in New York City, 100.3 FM to be exact.","time":1443322287685},"zedd":{"definition":"Zedd, born Anton Zaslavski, is a German [EDM] producer. The son of two classically trained musicians, this young prodigy started playing the piano at just four years old. Anton also played drums in his early teens, and was inspired to produce electronic music after hearing [Justice]&apos;s album, &quot;Cross&quot;. Zedd has produced numerous popular tracks, like &quot;Spectrum&quot; and even went on tour with [Lady Gaga]. His most popular track, &quot;Clarity&quot; (from the album with the same name) has been performed on Letterman by Zedd himself, vocalist Foxes, and fellow producer Alvin Risk. Besides being one of the biggest talents in EDM, Zedd is also exceptionally handsome and hilarious. He has a very promising future!","time":1443322312306},"maryland":{"definition":"The state with the biggest identity crisis in America.  Parts of it like DC and Baltimore are extremely ghetto, with two of the top 5 murder rates in the country. Balto is the heroine capital of the world. Suburbs like Potomac are Bethesda are among the richest and most well educated in the country, and populated by lawyers and doctors with preppy rich children who drive Benz&apos;s.  To the far west, you have the type of hicks that live in West Virginia up in the Appalachian mountains.  To the south and the east you have the kind of hicks you might find in Mississippi.  In Ocean City you have retired people who decided to go live on the beach.  Around the bay area, you have a lot of fisherman.  Maryland may be mixed up, but the crabs are damn good.","time":1443322324922},"selenagomez":{"definition":"The only female Disney star under the age of 18 who is a good role model to younger viewers. She is said to &apos;take over&apos; [Miley Cyrus]&apos;s place. Thats completely false. <br />Selena will never be that ugly, untalented, slutty, or fake. Her tv show [Wizards of Waverly Place] is becoming to be a huge hit. Her music career is slowly becoming successful BECAUSE she has talent. The only reason Miley&apos;s music career is doing good is because her hit tv show [Hannah Montana] is based on her poor singing.<br /><br />Sorry miley, but you&apos;re going to fail and watch selena rise to the top.","time":1443322332653},"jasonderulo":{"definition":"An R&amp;B artist whose voice is so generic that he feels the need to shout his name out at the beginning of every song.","time":1443322552677},"rimjob":{"definition":"the act of orally stimulating the external anal sphincter to cause sexual arousal","time":1443323086525},"lgi":{"definition":"Lets Get It!","time":1443323087235},"niggapede":{"definition":"A large black centipede doing some crazy shit.","time":1443323135255},"ots":{"definition":"One Take Session. To record a video or audio clip in one continuous take without any cuts.  Gabe Bondoc does many OTSs on youtube.","time":1443323265182},"offtheshits":{"definition":"Short term is OTS, This means a person is either high drunk or rolling. Rolling is the slang term for high on a pill. Originated in Chicago but now known wide because of a rap group known as GBE.","time":1443323279938},"pleb":{"definition":"Actually defined as a member of a despised social class, a commoner, a member of the plebs of ancient Rome.  Also low-born, undisinguished, vulgar, and my personal favourite: vulgar-looking.  <br /><br />Other words with similar meaning: Scrut, Townie, Kappa-Slapper, Rude-Boi, Scum, Greb, Scav, &amp;c.","time":1443323643583},"gulpin":{"definition":"The god of all Pokémon.<br /><br />It is stronger than Mewtwo, rarer than Celebi, has a better singing voice than Jigglypuff, and is more loved than Pikachu.<br /><br />Gulpin brings joy and monster trucks to all the Pokédorks, and whosoever believes in it shall not perish, but go to the great Pokémon daycare in the sky to do epic Pokémon battle amongst each other for all eternity.  ","time":1443323908911},"glomp":{"definition":"v, to glomp<br />NOT sexual, it is the action of one person lovingly (and dramatically) attacking another with a hug.<br />A glomp is often preadatory and lies somewhere in the grey area between a caring embrace, and a flying leap to tackle someone.<br />The term is used extesively in [anime] culture, as well as online in text form (anime because many anime characters do this often, and online because it is short and descriptive).","time":1443324026755},"midol":{"definition":"a medicine only for girls<br />some call it the pms medicine<br />it relieves menstrual symptoms<br />girls love it","time":1443324028721},"miam":{"definition":"The French equivalent to &quot;yum,&quot; or &quot;yummy.&quot;<br /><br />Used to designate satisfaction, liking, or pleasure.","time":1443324121414},"comma":{"definition":"a very important grammar thang. without it, many sentances would be very different.","time":1443324175854},"nevan":{"definition":"Nevan----Usually quite confound in the ways of the jedi yet is somehow accepted by everyone he&#x2f;she ever meets. Has the ability to argue on any matter quite heavily somehow with no real reasons for his position.<br />weight range 200-???? ","time":1443324216761},"w/":{"definition":"the word, &quot;with&quot;","time":1443324245197},"yvonne":{"definition":"Latina , Sexy Girl , Great Role Model . Ambicious and Great in bed.<br />A bad ass motherfucker who who won&apos;t take no shit off of nobody.<br />A Fly, Crazy, Fresh, Princess, Beautiful, Gangster, Diva, Fun, Irritating, Badass, Playertastic, Indescribable; Young lady who always looks her best.  Not many can handle her. But always wanna try.<br />Someone who is talked about, on a regular basis. She gives no fuckkk.  She knows what she deserves and won&apos;t settle for anything less.  Most often misunderstood.  She is bold and is capable of anything. Regardless of her bold nature, she is often secretive, but is always observing behind her withdrawn manner.  She can be argumentative and pack a powerful sting, but that’s simply because she see all opposition as a healthy challenge.","time":1443324309324},"ggwp":{"definition":"good game, well played","time":1443325025130},"drag":{"definition":"Inhaling smoke from a cigarette or joint. Having a puff or hit.","time":1443325993804},"bs":{"definition":"bull shit, duh","time":1443326873518},"god":{"definition":"A guy who talked to some Jewish guys, some Christian guys, and some Islam guys, and accidentaly caused more people to die than anyone else in human history.","time":1443327064872},"shz":{"definition":"Going to be a Virgin for life","time":1443327629134},"dingo":{"definition":"An older male who hits on or dates younger women.<br />(Male version of a Cougar)","time":1443328426126},"donkey":{"definition":"A girl with a fat booty.","time":1443328433167},"myst":{"definition":"The game series created by Rand and Robyn Miller and their small company Cyan (now Cyanworlds) in 1993. Myst is a graphical, point and click adventure game. The story revolves around a man name Atrus and his family, and around the fictional society of D&apos;ni. The D&apos;ni had the power to create links to other worlds through special books, called linking books. The Myst series was, at it&apos;s time phenominal in sales and in graphical quality. The series is comprised of the games Myst, Riven, Exile, Revelation, URU and URU&apos;s expansion packs To D&apos;ni and The Path of the Shell. There is also an upcoming Myst game, to be released in 2005 entitled The End of Ages. <br /><br />Myst once held the record for the most copies of a game sold, only to be surpassed thus far by The Sims.","time":1443329466199},"daijoubu":{"definition":"Japanese word for okay<br /><br />In english slang, used as:<br />1. It&apos;s okay.<br />2. I&apos;m okay (not hurt).<br />3. That&apos;s fine.","time":1443329618760},"tyvm":{"definition":"Thank You Very Much","time":1443329811453},"swallow":{"definition":"1. A bird, but who cares about a bird?<br />2. What women should do instead of spitting. In the mouth and down the throat. Anywhere else is unacceptable. No snow balling either. Your woman and all woman should accept the gift with a smile and open mouth. She shall lick it clean. She should then ask for seconds. She will respond when she&apos;s finished with: &quot;Please suh, could I have sum more?","time":1443329825781},"meep":{"definition":"The most versatile word in the English language, or in fact any language!<br /><br />Can mean whatever you want it to mean, but the most popular uses are:<br />1. An exclamation akin to &apos;ouch&apos; or &apos;uh oh..&apos;<br />2. Filling in the blanks where other (rude) words would go.<br />3. A greeting! I personally say meep instead of Hello...<br />4. A random expression of happiness used to fill gaps in conversation.<br /><br />Meep is the best word ever! Meep!","time":1443330186319},"charizarding":{"definition":"When you light a girls pubes on fire, put it out with your jizz then flap your arms and say &quot;You don&apos;t have have enough badges to train me&quot;","time":1443330233188},"venusaur":{"definition":"A bigass dinosaur [Pokemon].","time":1443330252931},"venasauring":{"definition":"When you tie your ball sack up in vines and slap your partner with them whilst shouting &apos;you don&apos;t have enough badges to train me&apos;.","time":1443330271601},"blastoising":{"definition":"When you jack off two guys over your shoulder, aiming their jizz at your partner. Yelling &quot;You do not have enough badges to train me!&quot;","time":1443330332911},"pikachuing":{"definition":"When you hook jumper cables to a car battery and a girls nipples, while she she repeatedly screams &quot;PIKACHU&quot; as loud as she can till you cum in her vag. After, she calls you ash for the rest of the night","time":1443330381885},"gamble":{"definition":"To run across a road at a fast pace without looking to see if there are any vehicles moving towards you in the hope of not getting hit by uncoming traffic. It was created in the late 90s&#x2f;early 00s by Mark Mc Legend and some wigger.","time":1443330634670},"waps":{"definition":"With A Passion","time":1443330698517},"suu":{"definition":"A phrase used when someone or something is embarassing or of ownage classification; also a subsitution for saying &apos;owned!&apos;.  <br />Usually said out loud in a crowd or group blantantly declaring  the ownage or embarassment.  Derived from the blood call &apos;suu woop&apos;","time":1443330801089},"miia":{"definition":"Miia: a state of drunkeness brought about by the excessive consumption of cider resulting in a catatonic-like state most notable for a permanant smile and inability to speak.  A girl who has a bizarre sense of humour which only increases in bizarreness after consumption of apple cider. Has been known to invent noises when surprised and is a major fan of skinny jeans.","time":1443330889548},"gitgud":{"definition":"To get better. To &quot;Get Good&quot;.","time":1443330904310},"britain":{"definition":"The only culture alive that can use the word &quot;cunt&quot; as any available part-of-speech.","time":1443330917981},"hamster":{"definition":"small furry thing that dances.","time":1443330986404},"innuendo":{"definition":"Anything that gives off a wrong idea, or sick minded thought","time":1443331014172},"littlesister":{"definition":"A woman who is officially affiliated with a fraternity. Little Sisters are usually given the fraternity&apos;s letters to wear after a sort of initiation, but they don&apos;t undergo a Pledge period and have limited rights and  privileges within the frat. They are not considered to have equal standing with the Brothers and don&apos;t participate in rituals or attend meetings.Usually long time friends of the guys in the frat and&#x2f;or the serious girlfriend of a Brother, a Little Sisters provide support to the fraternity. They assist in Rush events, bake cookies, and generally make the guys look good.","time":1443331100370},"lietome":{"definition":"A popular TV showed aired Monday&apos;s on Fox (as of 2010). The main character is Dr. Cal Lightman, a professional deception expert, a skilled reader of body language in order to determine what a person is thinking, and interpret their emotions.","time":1443332542628},"netflixandchill":{"definition":"It means that you are going to go over to your partners house and fuck with Netflix in the background.","time":1443332572267},"arresteddevelopment":{"definition":"Only the best show EVER to hit TV!<br />A new cult classic, like Seinfeld and Office Space","time":1443332584193},"trailerparkboys":{"definition":"A popular mockumentary about the lives of ex-convicts between prison terms. The main characters are Ricky, Julian, Bubbles and Jim Lahey, Trailer Park Supervisor, along with Randy, Ray, Cory, Trevor, Sarah, Lucy and J-ROC. <br /><br />The show airs Sunday nights at 9 and Thursday nights at 9:30 on Showcase in Canada. It is currently in it&apos;s fourth season. It also airs on BBC America, however, the show is bleeped and edited, because of the swearing and content. Cocksuckers.","time":1443332597826},":f":{"definition":":F or :f <br /><br />Drooling.","time":1443334119137},"satin":{"definition":"anything that is particualy sleazy or slutty in a gross way","time":1443334331531},"saten":{"definition":"Saten, Noun, A mixture of satan and satin combined to make saten, a soft devil.","time":1443334376723},"buddyholly":{"definition":"great rock star,and long lost reletive of rivers cuomo","time":1443334388444},"aids":{"definition":"A very dangerous disease that currently can&apos;t be cured. It will destroy your immune system until even a cold can kill you. <br /><br />Contrary to what most of these homophobic twelve-year-olds added as the definition, AIDS can be aquired through any form of sex with a carrier. In fact, you don&apos;t even have to have sex. Just sharing blood or drinking breastmilk (This applies to everyone, not just babies) can give you AIDS.","time":1443334399961},"riverscuomo":{"definition":"he&apos;s a walking oxymoron.<br />shy rock star<br />cool nerd<br />definitly easy on the eyes (but im not gonna over play that because hes so embarassed of being famous and i assume also of having so many 14 year olds who say hes so hot)","time":1443334399979},"ebola":{"definition":"something people chant while running through the hallways at my school. It is sung just like the Ri-cola commercial","time":1443334439461},"fuckfest":{"definition":"1.n.- a party or gathering of people, with the express purpose of having sex with various partners. Syn.- [orgy]<br /><br />2.n.- A party or gathering of people where no sex will actually occur, but called a &quot;fuckfest&quot; for the express purpose of making other people believe or think of an orgy.","time":1443334496409},"heathens":{"definition":"Oft times used as an insult by Christians against people who don’t worship their god. They tend to confuse Atheism, Paganism and Heathenism. Atheism is of course a lack of belief in any gods. Paganism is an umbrella term for many polytheistic non-Abrahamic religions. Whereas a heathen is one who practices the pre-Christian religion of the ancient Germanic people.  They worship the Germanic and Norse gods and goddess’. <br /><br />Heathens are hard polytheists, meaning they believe each god and goddess is a real and distinct individual not an aspect or archetype of a greater being. Besides the major gods spoken of in the lore, there are also local gods, ancestral spirits, and various sorts of wights. To a heathen reading and understanding one’s heritage is very important, this is why there is such a heavy emphasis placed on reading the sagas. Heathens take their religion very seriously.<br /><br />Heathens have a very complex idea of the soul and of the afterlife (even though not much emphasis is placed on the here after as is in Christianity).  In Norse Mythology humans were created from living and organic matter, not dead earth. The soul is made up of many parts, some that are passed down through the generations, all of which come together in a certain place and time to form a unique person. Some parts of the soul pre-exist this life, some parts continue to live on, and some perish upon death. There are nine worlds in Norse Mythology, Midgard which is Earth, Asgard which is were the Aesir dwell, Hel which is the realm of the dead (not to be confused with the Christian notion of fiery Hell), Ljossalheim (Means Light Elf Home), which is where the demigods and divinized ancestral spirits dwell (these would be the home of elves), Svartalfheim (meaning Dark Elf Home), similar in that ancestral spirits and demigods dwell here as well but has to do more with emotional than intellectual spirits (this would be the home of dwarves), Vanaheim which is where the Vanir dwell, Jotunheim this is where the giants live, and Muspellsheim and Nifelheim are the worlds of fire and ice respectively. <br /><br />Another concept which makes Heathen’s unique is that of the Wyrd.  Basically that you weave your own fate by the actions you take in life. Every action that you take or don’t take effects your wyrd. There is no forgiveness (or sin for that matter), if you wrong someone you must take action to make amends and set what is wrong right.<br /><br />Many Heathens go by the Nine Noble Virtues which are Hospitality, Courage, Truth, Loyalty, Honor, Self Reliance, Perseverance, and Discipline.<br />","time":1443334982721},"nosepicker":{"definition":"(noun) a person who has a habbit of picking there nose.","time":1443336693406},"sauced":{"definition":"sauced: to be so drunk all you can think about is how drunk you are","time":1443336700462},"mexicanhotpocket":{"definition":"The act of unflolding a hide-a-bed, dropping a duce, and reflodling for some unexpected individual to find at a later time.","time":1443336738421},"brittanyspears":{"definition":"A skanky poser bitch who acts inocent and tells little girls to screw and dress like whores","time":1443336802630},"r.a.t.s":{"definition":"A snitch. A person who has &quot;&quot;tattled&quot; on another person","time":1443336828902},"jit":{"definition":"a young muthafucka that don&apos;t know shit","time":1443336851019},"thrillseeker":{"definition":"a thrill seeker is a person who has one night stands without wearing a condom","time":1443336851859},"jackofalltrades":{"definition":"The other definitions are wrong.<br />A Jack of all Trades is someone who is decent at everything, but not especially adept at any one thing.","time":1443336998566},"sma":{"definition":"V. Suck My Ass.<br />The term used by girls when wanting to display extreme displeasement.  Alternate for suck my dick.<br />Also stands for Sucks Major Ass<br />Term used when something is very unsatisfactory.","time":1443337551662},"ema":{"definition":"a gorgeous, nice girl who is freaking irresistible for guys.","time":1443337557425},"oral":{"definition":"in the mouth","time":1443339520769},"voltorb":{"definition":"Voltorb, this pokemon is a giant dick. Your pokemon with own it, but is has the move &apos;Self - Destruct&apos; and can easily wipe out one of your pokemon.","time":1443341189428},"swampass":{"definition":"A common condition in which the ass crack and crotch becomes overly moist, sweaty, and stinky from one or all of the following:<br />- sweating on a hot day<br />- not bathing enough<br />- long day of work, sports, play<br />- incomplete wipe due to rush or laziness<br /><br />The crack will often feel squishy, wet, unpleasant, and itchy.  It is recommended to take a bath with soap to sanitize the condition.","time":1443342199252},"wip":{"definition":"Work In Progress","time":1443343680170},"drool":{"definition":"leaking saliva from ones mouth. often with desire for something ie Tasty feed, woman, sexy car.","time":1443343782848},"soccer":{"definition":"The world&apos;s most popular sport","time":1443344341623},"amigo":{"definition":"spanish for [friend].","time":1443344518726},"daterape":{"definition":"Date rape is a fast growing phenomenon in Pubs and Nightclubs.  The essential idea is that you spike a target&apos;s drink with a sedative drug, usually GHB or Rohypnol, and wait for them to become affected and semi-unconscious.  At this point you offer to help the virtually incapacitated victim home or to a taxi, obviously nobody will be suspicious as the victim appears simply to be heavily inebriated. Having taken the victim to a secluded spot, you proceed to rape them, the effect of the drug ensuring they can offer no resistance or remember the experience&#x2f;assailant.  Due to the nature of the crime, in up to 80% of date rapes the victim knows the rapist well.","time":1443345082896},"lesbian":{"definition":"a woman whose emotional, romantic, and sexual energies are geared towards other women.","time":1443346545028},"help":{"definition":"what i need","time":1443347988030},"ps":{"definition":"1.Post Script<br /><br />2.Pen Spinning<br /><br />3.PhotoShop<br /><br />4.PlayStation","time":1443349351806},"combing":{"definition":"When a man combs a woman&apos;s hair using his penis","time":1443352302611},"hon":{"definition":"Short for honey, a term of endearment","time":1443352615618},"meme":{"definition":"(noun)   <br />    <br />1 : an idea, belief or belief system, or pattern of behavior that spreads throughout a culture either vertically by cultural inheritance (as by parents to children) or horizontally by cultural acquisition (as by peers, information media, and entertainment media)  <br />    <br />2 : a pervasive thought or thought pattern that replicates itself via cultural means; a parasitic code, a virus of the mind especially contagious to children and the impressionable <br /><br />3 : the fundamental unit of information, analogous to the [gene] in emerging [evolutionary theory] of culture  <br />  - meme pool (n.) : all memes of a culture or individual   <br />  - memetic (adj.) : relating to memes   <br />  - memetics (n.) : the study of memes   <br />    <br />4 : in [blogspeak], an idea that is spread from [blog] to blog <br />    <br />5 : an internet information generator, especially of random or contentless information   <br />    <br />(Etymology : meme : derived from the Greek mimëma, &apos;something imitated&apos;, by [Richard Dawkins] in 1976)","time":1443352940865},"nb":{"definition":"abbreviation for nota bene: used to mark something as particularly important.","time":1443353028604},"tfw":{"definition":"That Feel When<br />Followed by some feel you should be able to relate to.","time":1443353036559},"shag":{"definition":"can mean rough tobacco, or else amateur beach-style dancing in the US. But in the main UK sense, as noun or verb, is an alternative to &quot;fuck&quot; ... but with a slight, important difference of effect. To some ears, &quot;fuck&quot; (like &quot;bang&quot;) can sound like an aggressive act, and&#x2f;or violent conquest, whereas &quot;shag&quot; (a softer sound) sounds more like an enjoyable fun activity. &quot;Shag&quot; is still often the preferred term among women who are very keen on &quot;shagging&quot;, very much enjoy shagging men (and&#x2f;or women) and getting shagged themselves. But don&apos;t so much want to get &quot;fucked&quot; (though if talking about another woman, especially a rival, it may well be a different story!). (Note also: &quot;fucking&quot; can also suggest &quot;meddling&quot; or &quot;cheating&quot;, &quot;fucked&quot; is also associated with &quot;broken&quot; or &quot;finished&quot;, &quot;had it&quot; - &quot;shagged&quot; is used simply to mean &quot;very tired&quot; .... one more reason for the preference by some people for &quot;shag&quot; over &quot;fuck&quot;!)","time":1443353904964},"fed":{"definition":"Rudeboys word for the Police. Even though its slang for the FBI in the U.S.","time":1443354860705},"bed":{"definition":"a matress on a stand or on the floor (lol) that has a blanket and pillows on it and u got to sleep on it coz sleep is so good","time":1443354876096},"sed":{"definition":"Socially emotionally disturbed<br />Seriously emotionally disturbed","time":1443355079954},"ied":{"definition":"Improvised<br />Explosive<br />Device<br /><br />When a bunch of [faggot] [muj] bury explosives, such as C4, mortar rounds, artillery shells, grenades and such in sandy streets. The bomb is set off remotely by a [pussy] [muj] hiding somewhere when either a mounted or dismounted Coaltion patrol passes by. <br /><br />These events are usually recorded and put on the web, set with radical Islamic chants in the backround and the triggermen screaming &quot;Allah Akbar!&quot;, which means &quot;[God] is great.&quot;<br /><br />Very, very popular in Iraq, but now is turning up in Afghanistan.","time":1443355151998},"ped":{"definition":"A kid who likes to listen to Pink Floyd and experiment with drugs. There is always at least one Peds per school. Look for them typically driving an old-school car like a Trans Am.","time":1443355158928},"led":{"definition":"Light Emiting Diode<br /><br />A magical light that has no other match for it. It consumes just a couple of volts (2.4 - 4.8) and VERY few mA (20-50) and in return it provides a steady and constant lightsource with a lifespan of almost 11 years!<br /><br />It&apos;s definitely a breakthrough in lighting devices since it&apos;s properties make it inexchangable with old fashioned burn-bulbs.<br /><br />Pros:<br />- High luminosity in low voltage<br />- Huge lifespan<br />- Very low consumption<br />- Immediate response in current variations<br /><br />Cons:<br />- Cannot compete bulb luminosity in high voltages<br />- Very sensitive to slight voltage changes (can burn very easily)<br />- Cannot be used in high voltages except with the help of voltage limiters (transformers&#x2f;resistances)<br />- Does not work with AC currents since ALL diodes have a certain unchangable polarity.<br /><br />Colour variations:<br />Red, Yellow, Green are the most common.<br />Blue and White are more recent.<br />Other colours in construction since the light depends on the material of the chip nested inside the LED.<br /><br />Leds exist in clear caps or in coloured caps. Clear caps usually have more power needs and also, Blue&#x2f;White have increased power consumption compared to all other colours.<br /><br />A LED can be used to save lives (like in medical equipment to show your alcohol levels in your blood) or even take lives as well (like show how much battery left you have in your lightning fartgun).<br /><br />It can also be used to hypnotize some nerds who see it and just get mesmerized and can do most of the things you tell them, EXCEPT lend you some LEDs from their collection!<br /><br /><br />Note: Subhuman creatures who know NOTHING about LEDs but have one (or more) blue LEDs in their cars (or similar vehicles&#x2f;devices&#x2f;appliances), should stick them up where the sun doesn&apos;t shine and not touch them and infect them with their brainlackitis.","time":1443355162499},"hed":{"definition":"Short term for marijuana, also, a type of shop specializing in the sale of drug related paraphenalia","time":1443355233596},"eed":{"definition":"Short for eediot AKA idiot<br />a quicker way wich is more effective","time":1443355624217},"ned":{"definition":"Non - educated delinquent Scottish [Chav]. Different accent ... simular clothing and same attitude.","time":1443355632998},"med":{"definition":"Medications.  Commonly used both on- and offline to refer to prescription drugs, generally of the psychotropic variety.","time":1443355641012},"jed":{"definition":"a guy who is so vicious you cannot comprehend his viciousness. he kicks so much ass that he is an ass kickin machine and all the ladies come flockin to honey. jed is the master, the one ruler of all! he is the one man able to kick ass on a daily basis, and he could bang your mom so quick, she wouldnt know where the intense pleasure came from! to simplify, jed is the master biatch!!!!!!","time":1443355677697},"unorthodox":{"definition":"Out of the ordinary.","time":1443357314081},"rof":{"definition":"Acronym for Roll on the floor starving.","time":1443358092177},"rofl":{"definition":"ROFL is an internet accronmym for Rolling On Floor Laughing, and like all things internet it has adapted to nerd culture and has taken on new real-life use, though usually in a satirical way.<br /><br />ROFL can be merged with other accronyms to created super [l33t] acronyms that &quot;r0x0r y0ur b0x0rs&quot; per se. Some examples of the merged accronyms are as follows:<br /><br />ROFLAARP: Rolling On Floor Looking At Assorted Rodent Pornography<br /><br />or<br /><br />ROFLEW: Rolling On Floor Laughing whilst Eating Waffles","time":1443358102443},"vb":{"definition":"VB - A rather horrid beer favoured by the proletariat and Northern Territorians.  Still remarkably better than the weak swill that Americans call beer.  <br /><br />Also known as green death and Vaginal Backwash","time":1443358952883},"read":{"definition":"To tell someone about themself, mostly used by gay black men.","time":1443358988298},"tpain":{"definition":"Faheem Najm, an American Muslim hiphop singer from [Tallahassee], [Florida], currently signed under [Konvict] music. <br /><br />T-Pain became famous with songs like &quot;I&apos;m in love with a Stripper&quot;, and &quot;I&apos;m Sprung&quot;. Between 2006 and 2007, T-Pain found himself in numerous singles and radio-hits such as &quot;I&apos;m N Luv&quot;, &quot;Buy U a Drank&quot;, &quot;Bartender&quot;, &quot;U and Dat&quot;, &quot;I&apos;m a Flirt&quot;, &quot;Outta My System&quot;, &quot;Baby Don&apos;t Go&quot;, &quot;Shawty&quot;, and the remix to just about every song ever.<br /><br />At around the same time, [R Kelly] appeared in more songs than he&apos;d ever been in before, remixes, singles, every song you can name.","time":1443359679660},"malish":{"definition":"A very delicious meal","time":1443359754662},"selfcontrol":{"definition":"One of the Fruits of the Holy Spirit. A visible attribute of a true Christian life as found in Galatians 5:22-23.","time":1443359815472},"bap":{"definition":"n. breasts  (orig. NW England)","time":1443359855829},"fetus":{"definition":"Main entree in a delicious buffet.","time":1443361297015},"molest":{"definition":"to touch without permission","time":1443361301228},"fightnight":{"definition":"A term used in the eastern suburbs of Cleveland for smoking marijuana.  Used to conceal the identity of the real act by using the name a popular video game. The &quot;game&quot; can mean the marijuana itself. This term has spread to various college campuses already.","time":1443362489572},"pikachu":{"definition":"fat-assed yellow wombat","time":1443362575625},"eevee":{"definition":"Cute little Normal type [Pokemon] that looks like a puppy. Eevee can evolve into the following five Pokemon by using the methods below:<br />1: [Vaporeon]-water stone<br />2: Jolteon- thunder stone<br />3: Flareon- fire stone<br />4: Espeon- get it to evolve from happiness during the day<br />5: Umbreon- get it to evolve from happiness during the night","time":1443363878084},"eve":{"definition":"First girl.<br />Most important girl therefore.<br />Everything a girl is suppose to be.<br />You cant call Eve &apos;fit&apos; or &apos;hot&apos;<br />Eve is so much more.<br />Eve is beautiful.<br />I dated an Eve. Woah.<br />Eves are amazing. looking for another .<br />If you know or have an Eve , you are one lucky man.<br /><br /><br />Adam - luckiest guy alive.","time":1443363980425},"adam":{"definition":"The first Man to ever get laid.","time":1443364642684},"payday":{"definition":"As per the John Waters film A Dirty Shame, a PAYDAY is an unflushed turd.","time":1443364681676},"locked":{"definition":"(Irish) to be highly inebriated<br />Very drunk","time":1443364961347},"goat":{"definition":"Greatest<br />Of<br />All<br />Time<br /><br />(like tight, the best)","time":1443365852492},"crack":{"definition":"As a rule of thumb, it is profoundly unwise to take crack-cocaine. The brain has evolved a truly vicious set of negative feedback mechanisms. Their functional effect is to stop us from being truly happy for long. Nature is cruelly parsimonious with pleasure. The initial short-lived euphoria of a reinforcer as powerful as crack will be followed by a &quot;crash&quot;. This involves anxiety, depression, irritability, extreme fatigue and possibly paranoia. Physical health may deteriorate. An intense craving for more cocaine develops. In heavy users, stereotyped compulsive and repetitive patterns of behaviour may occur. So may tactile hallucinations of insects crawling underneath the skin (&quot;formication&quot;). Severe depressive conditions may follow; agitated delirium; and also a syndrome sometimes known as toxic paranoid psychosis. The neural aftereffects of chronic cocaine use include changes in monoamine metabolites and uptake transporters. There is down-regulation of dopamine D2 receptors to compensate for their drug-induced overstimulation. Thus the brain&apos;s capacity to experience pleasure is diminished.","time":1443366002598},"okl":{"definition":"A name for cheese, which infact describes it as being made by Jim Carrey","time":1443367389787},"incest":{"definition":"The way the British royal family keeps itself German.","time":1443367624912},"betch":{"definition":"A betch is another way of saying &quot;Bitch&quot; except it sounds a million times better and makes you feel cool!<br />","time":1443367792539},"experiment":{"definition":"When two girls, usually in college, decide to engage in lesbian activity without having to admit to being lesbians.","time":1443368247811},"u.p.":{"definition":"(adjective) hard or erect","time":1443368250860},"sleep":{"definition":"You have been awake for 18 hours and are now viewing this useless definition of sleep. You are very tired and your brain is not functioning at its normal capacity. The bags under your eyes are starting to weigh you down. It&apos;s 1:30am and you have to get up at 6:30am for work. Another coffee wont help you now...","time":1443368257133},"og":{"definition":"Original gangster","time":1443369107201},"trapqueen":{"definition":"A bomb-ass female.<br />The baddest female.<br />She is loyal to her friends,lives for her family,and gives no fucks to bitter,petty bitches.<br />She also enjoys listening to trap music.","time":1443369427603},"rng":{"definition":"Random number generator.","time":1443369737670},"louis":{"definition":"a person with an abnormally large penis and natural hormones that girls can&apos;t help swooning over","time":1443369926305},"yaoi":{"definition":"Yaoi is a slang meaning &apos;boys love&apos; or [homosexuality] that is used in the japanese language. Popular with fangirls who like their favorite anime guys to kiss.","time":1443369968306},"yuri":{"definition":"1. Explicit lesbian relationships in anime or manga<br />2.To be the first to do something. Derived from Yuri Gagarin, first human in space. ","time":1443369973969},"doder":{"definition":"Someone who looks, and is, a complete loser.","time":1443370161656},"trial":{"definition":"A sport in which sportsmen on modified bicycles attempt to navigate over and across a variety of obstacles, from rocks to cars, using a combination and variation of moves, such as bunny hops, endos and pedal kicks.<br /><br />The standard Trials bike has is strong, and more importantly light, with sharp brakes, bomb-proof wheels and a low frame with with bars for maximum manouverabilty. <br /><br />Trials is the only true bike sport, and Trials riders are elite to other sell-out bikers like [BMX]ers and other fags who hang around on the streets these days, getting in our way.","time":1443370308778},"proxy":{"definition":"A sort of &quot;middle man&quot; on the internet.  Normally when you go to a website, you send your &quot;request&quot; packets straight to the site&apos;s server, and then the server sends &quot;reply&quot; packets back which is what you see as the website.  With a proxy, you send your request packet to a server, which then sends a new request packet to the website&apos;s server, which then sends back a reply to the proxy&apos;s server, and the proxy sends the web site to your computer.  This can be used for anonymous surfing on the web.  Not all proxys are anonymous, though.  Some just edit the packet they send to have your IP address instead of the proxy&apos;s, then the reply goes straight to you.","time":1443370375492},"digimon":{"definition":"1.  An anime series that has been constantly slandered by pokemon fans and attempts to ruin it were made by horrible dubbers, but is still truly one of the greatest(And darkest.) anime of all time, and has spawned quite a large fandom(And some truly great fanfics.)  Anyone who says they saw the dark masters arc and didn&apos;t shed a single tear is either inhuman, lying, or having a serious problem with his or her tear ducts.(AKA [Digimon Adventure])<br /><br />2. [Digimon Tamers]<br /><br />3. [Digimon Frontier]<br /><br />4. An assortment of various monsters that are the native inhabitants of the digital world in any of the digimon series.","time":1443371060358},"y":{"definition":"Depending on the context it can mean either why or yes.","time":1443371098555},"cocoa":{"definition":"The best drink ever.<br />Like heated chocolate milk, but with more love.","time":1443371107003},"hershey":{"definition":"The great american chocolate bar","time":1443371118949},"mynigga":{"definition":"your partner through think and thin. someone who will always help you out, no matter the situation.","time":1443371149650},"jay":{"definition":"Someone who is a beast at everything he&#x2f;she does. Such as running barefoot on a muddy [cross country] course-or being beyond hot. ","time":1443371211425},"ayylmao":{"definition":"A common phrase spoken by extra terrestrials, the only phrase that does or ever will matter and could mean anything.","time":1443371694983},"lmai":{"definition":"similar to the expression LMAO but instead of meaning laughing my arse off, it means laughing my arse in.. haha<br /><br />invented during a spelling mistake in and msn conversation :)","time":1443371703053},"intimidate":{"definition":"means to scare some one or fill with fear.","time":1443371719366},"sniping":{"definition":"the act of bidding on an item on ebay literally seconds before the auction ends. This prevents anyone from outbidding you while also ensuring that you don&apos;t bump the price up too much. ","time":1443371828596},"fap":{"definition":"The onomatopoeic representation of masturbation.  Often used to suggest that something is attractive.","time":1443372045775},"bert":{"definition":"A person who is, sophisticated, extremely intelligent and exceedingly well-endowed. A person known as Bert is often the most respected or adored member of any group of people. To be called Bert is the utmost sign of respect: it signifies that the person being referred to has the ability to please and impress others on every possible level.","time":1443372711696},"tampa":{"definition":"Similar to Atlanta but not as many skyscrapers and very spread out. The club areas are actually suburbs, Ybor City and Channelside. The area surrounding University Of South Florida is where you can get your car shot up, raped or killed.","time":1443372727873},"smg":{"definition":"Acronym for sub-machine gun","time":1443372764108},"k":{"definition":"Online: 1. A term of acknowledgement; esp. without particular interest.","time":1443372854807},"s":{"definition":"The nineteenth letter of the alphabet. After R and before T.","time":1443372859966},"adapt":{"definition":"A crazy sick biller with a good personality. As a good youtube bit has a lisp","time":1443373234853},"pms":{"definition":"A powerful spell that women are put under about once every month, which gives them the strength of an ox, the stability of a Window&apos;s OS, and the scream of a banshee. Basically, man&apos;s worst nightmare.","time":1443373762860},"shota":{"definition":"Refurs STRICTLY to young boys. Female shota is colled Lolli. <br /><br />Shota, or more commonly in Japan; Syouta, is LEAGAL in Japan because the age of concent is 13 there. Rather than attracting gay men, this appeals to young Japanese girls &amp; one of my friends.","time":1443373920340},"kik":{"definition":"A smartphone app that allows users to chat with eachother, for free, whether they have an iPhone, iPod Touch, Blackberry, or Android device.  *Can also be used in the form of a verb, meaning to contact someone through Kik.","time":1443374069393},"crucifix":{"definition":"A position in a fight where you pin your opponent to the ground with your knees on his arms and sit on his belly. Your opponent cannot protect himself, so you can wail away as much as you want.","time":1443374351035},"amy":{"definition":"to take, hold, or steal your heart. a person who is a soulmate. a good lover.","time":1443374955243},"emotes":{"definition":"A term used in [MMORPG]&apos;s such as [World of Warcraft] which describes an action your character can perform which is usually accompanied by sound and sometimes even an animation. Emotes include: <br /><br />&#x2f;poke <br />&#x2f;cheer <br />&#x2f;chicken <br />&#x2f;moo <br />&#x2f;dance <br />&#x2f;insult<br /><br />Also a useful way to communicate across factions in games like [WoW] where Alliance and Horde players speak different in-game languages such as Orcish, Darnassian, etc.","time":1443374964347},"emoticon":{"definition":"An emoticon, sometimes called a smiley, is a sequence of printable characters such as :) or ^_^, that is intended to represent a human facial expression and convey an emotion. Use in internet forums and instant-messaging.","time":1443374969768},"wbu":{"definition":"Chatspeak for &apos;what about you?&apos;<br /><br />What<br />&apos;Bout<br />You","time":1443375277963},"kendricklamar":{"definition":"An incredible up-and-coming West Coast rapper from Compton. He is well know for is highly praised album&#x2f;mixtape [Section.80] and for recently being signed to [Aftermath] Records. He has great lyrics, wordplay, and flow, which is demonstrated in his popular street song &quot;Rigamortus.&quot; He is also great at using story-telling and emotion in his songs which is conveyed in his Brenda&apos;s Got a Baby-esque song &quot;Keisha&apos;s Song (Her Pain).&quot; Fellow West Coast rappers [Dr. Dre], [Snoop Dogg], and [Game] have named him the new king of the West.","time":1443375923285},"bn":{"definition":"short for &quot;bitch nigga&quot; or a young black lady who is annoying or complains too much; can also be applied to black people in general ","time":1443376821250},"metaknight":{"definition":"The leader of the meta knights and a master swordsman.<br />He has a giant flying ship called the halberd and has appeared in many kirby games, also in smash bros brawl.<br />He has very fast swipes and his final smash is galaxia darkness.<br />","time":1443377482865},"dankmemes":{"definition":"A sarcastic term to refer to an old&#x2f;overdone [meme].","time":1443377503406},".":{"definition":"Ends a fucking sentence","time":1443377705309},"ass":{"definition":"(_!_) = Normal Ass<br />(__!__) = Big Ass<br />(!) = Tight Ass<br />(_?_) = Dumb Ass<br />(_E=MC2_) = Smart Ass<br />(_$_) = Rich Ass<br />(_x_) = Kiss My Ass<br />(_X_) = Get Off My Ass<br />","time":1443377738760},"ubers":{"definition":"The ultimate, above all, the best, top, something that nothing is better than. Also Über","time":1443377963178},"anythinggoes":{"definition":"A way to say &quot;whatever it is, it&apos;s okay&quot; or &quot;everything is okay&quot;.","time":1443377978680},"amazing":{"definition":"Something that is so wonderful, it is hard to find the words to match.  Something that makes your heart beat faster or your heart melt. Something that tops everything else, and always crosses your mind.","time":1443378459443},"bestthingintheworld":{"definition":"Heather","time":1443378463411},"heather":{"definition":"Beatiful, creative,smart,spontanious, girl who would be a good catch to bring home to mother. Who is down right sublime.<br /><br />","time":1443378468045},"roses":{"definition":"The most beautiful girl ever. A rose has the face of an angel and when you see her eyes light up when she smiles, you can&apos;t help but smile back. She is hilarious, and loves pulling pranks.","time":1443378559221},"twinky":{"definition":"adj;<br />An INSANE female, usually Caucasian. Someone who has not one but TWO twinkles in their eyes due to their high degree of social insanity, someone so over obsessed with an estranged lover that they become oblivious to their actions and consequences of their actions. Prone to fits spontanious crying,screaming, violent fits of rage or any emotional outburst at work, restaurants, traffic or any public place without sign or warning. <br />Can usually be found on the internet in singles chatrooms or have singles profiles on dating websites. Will come off as overly sexual possibly even agressive and enticing but will become posessive and demanding after intercourse. Has been known to call 8, 9, 15 or more times per day and will show up at your home or work un announced if ignored. <br />VERY, VERY hard to get rid of. Lacks any shame or accountability. ","time":1443378632964},"fuckoff":{"definition":"1. A message used by the hand that is a direct insult to another person.<br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1443378634459},"potato":{"definition":"People get confused when sentences don&apos;t end the way they potato.","time":1443378698061},"burnt":{"definition":"When one smokes too much weed and is in a permenant state of mellowness.<br />A person who is burnt is slow to react and is sometimes too stupid to carry on intelligent conversation.","time":1443378842925},"thatguy":{"definition":"The person everyone loves to hate and never wants to become.","time":1443378944364},"wincest":{"definition":"The term &quot;wincest&quot; consists of both win and incest.<br />It&apos;s basically an act of hot sex between family members, which makes it WINcest.<br /><br />Commonly used in &#x2f;h&#x2f; within 4chan.","time":1443379356316},"wynaut":{"definition":"1. a species of Pokémon that evolves into wobbuffet.<br />2. A slang term use to say why not.","time":1443379629465},"indefinitely":{"definition":"When you know, and she knows, absolutely and beyond all reasonable doubt that your manhood is in all the way up to the hilt.","time":1443379787177},"suny":{"definition":"Stands for State University of New York.","time":1443380228182},"trollface":{"definition":"A rather deformed face meant to display the expression that trolls have whilst angering people.  It was formed by a man who calls himself &quot;Whynne&quot; on a whim; it was a short comic displaying the fantasy and reality of trolling on the web...  In other words, faggotry is the result of an uneducated opinion being surpressed by people with actual brains, and thus, the idiot decides to troll, rather than the troll making, and I quote: &quot;Intentional logical fallacies.&quot;","time":1443380256825},"thisissparta":{"definition":"The greatest cry ever shouted in the history of the universe, only to be shouted directly before delivering a kick to the sternum over a large, seemingly endless pit that has no logical reason for being there but looks really, really, awesome.","time":1443380479725},"puncake":{"definition":"vagina, volva, pussy, puntang, cliterius, punani","time":1443380496930},"los":{"definition":"A dope ass rapper from Baltimore, MD. Kills your favorite rapper&apos;s beat and doesn&apos;t take shit from anybody. Most of his music can be found on Youtube.com&#x2f;SwaggaBoyLosTV or datpiff.com Has fans that actually care about his music, not just ride his dick because he is the new trend.","time":1443380659168},"staggered":{"definition":"In cars, when the rear wheels are wider than the front wheels. Used to give the car a more aggressive look and better traction in rear-wheel-drive cars. Many high-performance cars come like this from the factory, but it can be done to any car as an aftermarket upgrade.","time":1443381144615},"mbb":{"definition":"Initialism for McKinsey &amp; Co., Boston Consulting Group (BCG), and Bain &amp; Co. — the top three strategy consulting firms.","time":1443381167785},"mb":{"definition":"MB: (Medium Boto)- Someone who evolved from “SB” (Small Boto) to “MB” . A “MB” has more than 1 chic and wants to lose their v-card to any girl, but no one wants to fck him .","time":1443381174100},"yh":{"definition":"yh is short for &quot;Yes, my intellegence is equil to the butt of a horse&quot;","time":1443381205695},"bt":{"definition":"(n.) acronym for &quot;big tits&quot;; only acceptable for use when interchangable with one&apos;s name, as if a nickname, i.e. used only in the place of a name, specifically that of a female with large breasts (exs.: inappropriate use - That woman has B.T.; appropriate use - I have a date with B.T.)","time":1443381519560},"arcadia":{"definition":"Land of the Asians","time":1443381641847},"rotation":{"definition":"The order in which a group of people [word] blaze.<br />The order in which the [spliff] is passed.","time":1443381703639},"kayden":{"definition":"american name meaning fighter. Someone who is handsome, light hearted, smart, funny, dedicated, successful, loving, strong. may also be stubborn, verbal, indecisive, forgetful. Not afraid to go for what they believe in.","time":1443381788454},"autism":{"definition":"A condition characterized by obsessive interests and a lack of eye contact.Asperger Syndrome has many facets involving a difficulty in [communication] and inability to grasp social situations and body language. Sufferers report an interest in minor and trivial details, rather than being able to see [the bigger picture]. They also find &apos;small talk&apos; difficult.Sufferers also get absorbed in their own head space and find relationships difficult. They also have a tendency to take words and phrases literally, e.g. If someone with Asperger&apos;s saw a sign in a telephone bill paying shop stating &quot;cash point&quot; the AS suffer would assume [cash point] meant an ATM cash machine and would go to draw money out of it.AS sufferers tend to prefer the company of pets and animals and shun the limelight.They can also have temper tantrums and indulge in activities called [stimming] which is hand flapping or other none verbal gestures such as finger flicking - sufferers of Asperger Syndrome do this when under stress or pressure.Asperger syndrome is a big subject and their are countless different personality types and subcategories of illness&#x2f;condition.Sufferers are often referred to as eccentric or [weird].  Everyone with Asperger Syndrome is different.Asperger Syndrome is a form of Autism. ","time":1443381792848},"hmu":{"definition":"Hold my unicorn.","time":1443382232030},"oath":{"definition":"Used in Australian slang in conjuction with a swear word to make an exclaiment of agreement as such.","time":1443382287190},"andrew":{"definition":"Ultra cool, Usually hot or at least sort of cute. Awesome sense of style, music, and humor. Sexy, awesome kisser","time":1443382315031},"kms":{"definition":"stands for: kill my self","time":1443382346458},"cocky":{"definition":"Thinking too highly of yourself. *Its ok to be cocky if you&apos;re the shiznit, though.*","time":1443382927532},"otp":{"definition":"One True Pairing. Meaning the your favorite combination of characters in a fandom.","time":1443383272181},"steal":{"definition":"To punch someone","time":1443383532486},"gau":{"definition":"Used as a term of endearment towards a friend or acquaintance. (Pronounced Gaw)","time":1443384373229},"jags":{"definition":"an irritating individual with no sense of a social filter and no realization of the implication of his actions; socially inept.","time":1443385162801},"jaguar":{"definition":"In the lexicon of older women seeking younger men, a jaguar is 50 and over, where the cougar is in their 40s, and the puma under 40.  Jaguars tend to be financially stable and are only looking for sex from their 20 something prey.","time":1443385184237},"smh":{"definition":"Acronym for &apos;shake my head&apos; or &apos;shaking my head.&apos; Usually used when someone finds something so stupid, no words can do it justice. Sometimes it&apos;s modified to &apos;smfh&apos; or &apos;smmfh&apos; by those that prefer profanity in their internet acronyms.","time":1443385186135},"flopped":{"definition":"Equates to &apos;beaten&apos;, [weighed] or [murked]. If somebody is &apos;flopped&apos;, they are beaten up. Used by [rudeboys] and [chavs] in south Essex.","time":1443385270575},"idek":{"definition":"An abbreviation for &quot;i don&apos;t even know&quot;, commonly used after doing something stupid. Originating from www.idontevenknow.com","time":1443385458276},"protools":{"definition":"A very stable piece of audio production software. Though stable, it unfortunatly is designed by Digidesign, the biggest bastards in the industry. They require you to use exclusively their hardware in conjuction with the software. When the new version of protools comes out, all the sudden you have to buy new hardware because its not compatible with the new version... even though Digidesign themselfs designed and sold the hardware to you only two years earlier. Their hardware is high quality... and you pay for it. An entry level Protools TDM system costs upwards of 10 grand. Isn&apos;t it nice to know that those thousands of dollars of hardware will be useless in two years? Protools doesn&apos;t play nicely with other pieces of software. Your computer must be free of all other sofware for Protools to work. If by any chance (which is great) that you will need tech support, Digidesign will be glad to take your $60&#x2f;hour to tell you that the reason your system doesnt work is because YOU fucked it up, even though its clearly bullshit... Every professional in the industry should stock up on MOTU I&#x2f;O&apos;s and nice mic pre and just use Nuendo. It may be slightly less stable, but it can do more and your hardware will last you many years with multiple versions of software.","time":1443385459253},"snowy":{"definition":"adj., one who does coke.","time":1443385742560},"itachi":{"definition":"The sexiest anime villain ever.","time":1443386132129},"mymom":{"definition":"The Reverse of saying &quot;Your Mom&quot; as a joke. it can be used in the same way. People use it if you don&apos;t want to hurt someone feeling about there mom. A good way to laugh at your self. Most of the time when used it doesn&apos;t make sense but is still funny. This is best see in used in the Cartoon network TV Show &quot;Regular Show&quot; by Muscle Man.","time":1443386180039},"ib":{"definition":"A.K.A. International Baccalaureate - A malicious program aimed at the unnaturally brighter population in an attempt to overload their brains, thus reducing them to vegetables without lives.  However, a true IB student will respond by adapting and bsing their way through.","time":1443386191798},"ded":{"definition":"adj.  Ded is when you are dead from joy, hilarity, sexiness, or other great feelings as such.<br /><br />There is a large difference between ded and [dead].  Do not confuse the two.<br /><br />The verb form is &apos;deds&apos; or &apos;dedded.&apos;<br />","time":1443386606029},"bane":{"definition":"cause of harm, ruin, distress, destruction, or death. <br /><br />similar words are [effigy] <br />","time":1443386797610},"herb":{"definition":"used by rapper esoteric, in the song herb. pronounced like its spelled, no silent h. it doesnt mean weed or drugs, its a term for someone who follows trends, or just is a complete bullshitter.  basicly one of those kind of people that nobody likes.","time":1443387262312},"hingo":{"definition":"The bane of everything that is good in the universe.  Should be avoided and shunned at all costs.  Widely associated with the fall of civilization into the depths of Hell.  Also, the exact opposite of [blarg].","time":1443387310123},"rude":{"definition":"Def 1: dragging a mat over somone,<br />Def 2: stepping on somone while they&apos;re doing the splits.","time":1443387476290},"man":{"definition":"Someone who is obsessed with women making them sandwiches.","time":1443387477961},"~":{"definition":"used at the end of words to make them longer. instead of saying &quot;It&apos;s taking too looooooonnnggggg.&quot; you would say, &quot;It&apos;s taking too long~&quot; Periods are rarely used after. Used by literates and occasionally preps.<br /><br />can also be used as an exclamation point. originates from, well, the buttons being next to each other.","time":1443387533620},"gold":{"definition":"An [element] found on the [periodic table] under<br />[atomic number]: 79<br />[symbol]: [Au]<br />[atomic weight]&#x2f;[atomic mass]: 196.96655g<br />[group name]: [Coinage] metal<br />[group]: 11<br />[period]: 6<br />[block]: d-block<br />[CAS Registry ID]: 7440-57-5<br />Standard [state]: [solid] at 298 [K] <br />[Colour]: gold <br />[Classification]: [Metallic] <br />[Availability]: gold is available in many forms including wire, foil, and bars.<br /><br /><br />Gold is usually [alloyed] in [jewellery] to give it more strength, and the term [carat] describes the amount of gold present (24 carats is pure gold). It is estimated that all the gold in the world, so far [refined], could be placed in a single cube 60 ft. on a side. It is [metallic], with a yellow colour when in a mass, but when finely divided it may be black, ruby, or purple. <br /><br />It is the most [malleable] and [ductile] metal; 1 ounce (28 g) of gold can be beaten out to 300 square feet. It is a soft [metal] and is usually alloyed to give it more strength. It is a good [conductor] of heat and [electricity], and is unaffected by air and most [reagents].<br /><br />The most common gold [compounds] are auric chloride (AuCl3) and chlorauric acid (HAuCl4). A mixture of one part nitric acid with three of hydrochloric acid is called aqua regia (because it dissolved gold, the King of Metals). It is unaffected by air and most reagents. It is found free in nature and associated with [quartz], [pyrite] and other [minerals]. Two thirds of the world&apos;s supply comes from [South Africa], and 2&#x2f;3 of [USA] production is from [South Dakota] and [Nevada]. Gold is found in sea water, but no effective [economic] process has been designed (yet) to extract it from this source.<br /><br />It would not normally be necessary to make gold in the laboratory as it is readily available commercially. The most romantic way to extract gold is by panning it out from a stream in some pleasant valley but most such sources are now [depleted]. Panning relies upon the [density] of gold (which is very high) being much greater than that of the sand and other [particulates]. It therefore settles to the bottom of the pan. <br /><br />Today, more often than not, gold is [extracted] from ores. These ores often contain relatively little gold. Some of these processes cause [environmental] concern. The ore is crushed to a powder so as to expose the small gold particles. These are dissolved by treatment of the [rock] with cyanide solution in air. The result of this is a gold cyanide complex. Addition of zinc powder to the resulting solution [precipitates] out the gold.<br /><br />4Au + 8NaCN + O2 + 2H2O  4Na[Au(CN)2] + 4NaOH<br /><br />2Na[Au(CN)2] + Zn  2NaCN + Zn(CN)2 + Au (s)","time":1443387566533},"platinum":{"definition":"when used in the phrase &quot;go platinum&quot;, it means to sell 1 million copies of an album.","time":1443388602933},"silver":{"definition":"The name of someone who is characteristically hot and feisty. [Silver] is driven and unique in his&#x2f;her creativity and personality. He&#x2f;She makes a great girlfriend or boyfriend, but be careful, most likely you&apos;re not the only one after them","time":1443388626469},"mcpe":{"definition":"Minecraft Pocket Edition is the most popular version and mobile version of Minecraft. Availabley on Android, iOS and recently Windows phone, the game is also played by YouTubers.","time":1443388859623},"lsbg":{"definition":"light skinned black girl.","time":1443389436868},"candy":{"definition":"n.<br /><br />1. euphamism for sex<br />2. something (usually flashy like a [lure]) used to get sex<br />3. drugs, particularly cocaine, [crack], or [E]","time":1443389755452},"vegas":{"definition":"Trunication of &quot;Las Vegas&quot;. Used often in reference to the city in Nevada, or the lifestyle of the late 1950&apos;s that typified the &quot;Rat Pack&quot; era.","time":1443389839746},"afaik":{"definition":"as far as i know","time":1443389867289},"yandere":{"definition":"Contrary to the popular belief that it is the opposite of [tsundere], it describes an [anime] character who is either [psychotic] or [violent] or both, and shows affection to the main character.  Became a popular [moe] genre after the airing of the last episode of [School Days].  Other yandere characters include Ryuuguu Rena from [Higurashi No Naku Koro Ni] series.","time":1443390159728},"ip":{"definition":"1. Internet Protocol, or Internet Protocal Address(IP Address), commonly used for various means of communication.<br />2. In Progress. Often used in old RTS games, such as WarCraft II.","time":1443390314706},"parasyte":{"definition":"Name of the man with the smallest penis on the planet. Much smaller than [bgm].","time":1443390390893},"oniichan":{"definition":"Onee-chan is Japanese for older brother.<br /><br />","time":1443390653707},"oniisama":{"definition":"a respectful japanese term for &apos;older brother&apos;, &apos;onii&apos; being brother, and &apos;sama&apos; being a reverence of an ending.","time":1443390736794},"imoto":{"definition":"Younger sister (japanese mafia)","time":1443390797641},"imouto":{"definition":"Imouto (ee-mo-oo-toh) is the Japanese Romaji for &apos;little sister.&apos;<br /><br />When referring to ones own family, or someone who is not unlike family, such as a lifelong or childhood friend, it can just be said as imouto.  However, when referring to another family, you should always add a suffix on the end, such as imouto-san, unless given consent otherwise.","time":1443390799439},"brit":{"definition":"A person who was born&#x2f;raised or lives in Britain.<br />Some folk think it can be used as an insult but most of us couldn&apos;t care less.<br />We spell our words correctly as Americans spell theirs correctly.. It&apos;s just a matter of whether or not you use &apos;American English&apos; or &apos;British English&apos;.<br />","time":1443391067843},"shawnmichaels":{"definition":"The greatest wrestler ever. Period. He owns you. And he did not screw over Brett Hart damnit. It was Vince. It was all his fault.","time":1443391344307},"idk":{"definition":"Shorthand form for &quot;I Don&apos;t Know&quot;.","time":1443391356611},"undertaker":{"definition":"The Deadman, greatest wrestler of all time.","time":1443391358571},"tripleh":{"definition":"The greatest wrestler in the WWE today.  Triple H is a terrific actor, a skilled wrestler, and really knows how to make you love to hate the guy.","time":1443391373197},"ultimatewarrior":{"definition":"God Himself. Sent in a capsule from a place long from here, and He came for only one reason: to take and keep coming. Not to ask, but just to give. Not to want, but just to send. Send the power of the Warrior. Down everybody&apos;s throat in the WWF &apos;til they become sick of it. Well, you&apos;re gonna get sick of it. Because that freak of nature right there is just beginning to swell. And when He gets big enough, brother, there ain&apos;t gonna be room for anybody else but Him and all the Warriors... floatin&apos; through the veins... and the power of the Warriaaaaaaaah...","time":1443391373405},"therock":{"definition":"A &quot;professional wrestler&quot;(actor) with well evolved eyebrows.","time":1443391410376},"ganondorf":{"definition":"Semi-famous villain from the Nintendo 64 adventure, The Legend of Zelda: The Ocarina of Time. Ganondorf has an exceptionally unique case of [unibrow], in which his eyebrows connect clearly with his hair, thus forming one very long eyebrow.  This puts the typical unibrow (one that connects in the middle of one&apos;s face above the nose) to shame.","time":1443391432645},"onions":{"definition":"an ounce of cocaine","time":1443391497160},"shrek":{"definition":"A large green ogre. With a donkey friend.","time":1443391505530},"gore":{"definition":"a) graphic violence,the depiction of particularly vivid and realistic acts of violence and brutality in visual media such as literature, film, television, and video games. It may be real, simulated live action, or animated<br /><br />b) in music, the subgenre of grindcore, or grind, most influenced by metal and especially death metal, having barely or no influence by hardcore at all. Consisted of  low growls, gurgles, and screams, heavily distorted guitars, death metal drumming with a lot of powersnared rhythms. Sometimes also called grindgore or gore grind. Easily distinguished from other grind bands that are not gore such as suicide silence, a black rose burial, Braindrill, and Shotgun facelift. Many scene kids have been known to add gore to their myspace display name even though they dont listen to gore, only grind and at times not even that.","time":1443391839722},"bof":{"definition":"&quot;whatever&quot;, in French","time":1443392008743},"migi":{"definition":"the noise one makes when they want something&#x2f;about to cry.","time":1443392199073},"space":{"definition":"the final frontier","time":1443392238767},"imo":{"definition":"&quot;In My Opinion&quot;","time":1443392391159},"punt":{"definition":"(MIT slang) (1) To skip class (2) To avoid doing work. Ant: tool. ","time":1443393090933},"glassjoe":{"definition":"Anything rediculously easy.","time":1443393106013},"rq":{"definition":"An abbreviation of &apos;[Rage Quit]&apos;, which is the act when a player quits&#x2f;exits a game in frustration, usually when he&#x2f;she has been killed. Used in online multiplayer&#x2f;LAN games, or chat. E.g WC3(DOTA).","time":1443393407557},"imy":{"definition":"IMY is an abbreviation for I Miss You","time":1443393820234},"fsh":{"definition":"First used in german boards to motivate male to copulate female.<br /><br />fsh=&quot;fick sie hart&quot; ~ bone her","time":1443394226964},"nigga":{"definition":"Nigga is a word which evolved from the derogative term &quot;nigger&quot;. Tupac best defined the distinction between the two.<br /><br />NIGGER- a black man with a slavery chain around his neck. <br /><br />NIGGA- a black man with a gold chain on his neck.","time":1443394275075},"hola":{"definition":"Similar to hey! or hi! - Popular and Informal greeting used among young people in spanish language and travelled people as a trendy greeting.  Used either with friends or unkown people.","time":1443394546272},"stfu":{"definition":"1) Acronym used for the phrase &quot;shut the fuck up&quot; for efficiency reasons.","time":1443394553845},"inuendo":{"definition":" noun.<br />*A clever way to say what you mean, but not necessarily mean what you say because of underling hidden intent that must be inferred to be understood.<br />.:almost ALWAYS sexual but does not have to be:.  <br />  *Usually said in jest, but cum on folks, we know what your really getting at.","time":1443394564091},"ala":{"definition":"Used to express sorrow, regret, grief, compassion, or apprehension of danger or evil.<br /><br />Indo-European Roots","time":1443394805311},"thot":{"definition":"A Thot is a hoe. Plural: Thotties","time":1443394846514},".3.":{"definition":"A [smiley], basically. The two periods are eyes and the three is a pursed mouth, like a kissy face.","time":1443395860040},"pewdiepie":{"definition":"A Swedish YouTube commentator, and [Machinima] director. PewDiePie (PewDie for short). PewDie is probably one of the most epic YouTube commentators, doing mostly horror games. he&apos;s known for girlish screams, bro fists, and a very loud intro.","time":1443395991070},"katrina":{"definition":"A beautiful girl that has many qualities. The perfect woman for any man.","time":1443397113164},"pansexual":{"definition":"1. Adjective:  A group which is open to members of all sexual orientations or gender identities including [straight], [gay], [lesbian], [bisexual],  [transexual], or [transvestite].<br /><br />2. Noun:  A person who is sexually interested in other people regardless of gender including [male]s, [female]s, [transexual]s, [tansvestite]s, [gender bender]s,  [hermaphrodite]s, [intersexual]s, [androgenous] people, and those with [sex-chromosome anomaly] such as [klinefelter syndrome] or [turner syndrome].<br /><br />3. Noun: A person who is a member of a pansexual group or a person who associates with  people of all sexual orientations but is not necessarily interested in sex with people of all [sex]es or [gender]s though they may be comfortable with public displays of affection ([PDA]s) or semi-public sexual activity which is not confined to their own [sexual orientation].<br /><br />4. Noun: One who perceives all activities and experiences as sexual.<br /><br />5. Noun: One who believes that all consensual activities are ethical.<br /><br />6. Noun. One who believes that all<br />human behavior stems from the sex drive.<br /><br />7. Adj.  Pertaining to a person, group, or idea fitting the above descriptions.<br /><br />Derivation: From the greek &quot;pan&quot; (meaning &quot;all&quot;) and the english &quot;sexual&quot;<br /><br />Alternate forms: [pansexuality] [pansexualism] [pansexualist] [pansexualize]<br /><br />Synonyms: [omnisexual]","time":1443397803517},"blessed":{"definition":"As in Brian Blessed. A man who could out-boom God in the Booming Voice Olympics. Often described as &apos;shouty&apos; in his acting performances, this is really an inadequate adjective. While the volume the man can produce is quite simply staggering and which regularly makes wilderbeast stampede for their lives even on another continent, volume alone is only part of his amazing talent. His shouting is at once deafeningly loud, jolly, heartwarming, deceptively articulate and imposing. An absolute pleasure to experience, even while your ears begin to shatter.<br /><br />In addition he understands the aesthetic of contrast in further enhancing the magnitude of his shouting. He will very often speak at a delicate volume for several words in a row, and he is so well spoken you&apos;d think he was a librarian at Cambridge. But then, without notice... &quot;AH WELL, WHO WANTS TO LIVE FOREVER? HAHAHAHAHAHA.... DIIIIIIIIIIIVE!!!!&quot;<br /><br />In common usage today as slang for someone whose charismatic presence is felt immediately by all (example below) ","time":1443397873546},"shower":{"definition":"Device that men use to wack off while at thier in-laws house","time":1443397882343},"bigsean":{"definition":"A sexaholic rapper who talks about nothing in his music, degrading women, and always have to resort to sex in his songs. He made an over-whelmingly annoying song, called, &quot;Dance&quot;, or &quot;Dance (Ass) Remix ft. Shitty Minaj&quot;. That song is so annoying, that I wanted to commit a genocide to idiot Big Sean fans because they help support his shit. And he also puts out wack ass lyrics that consists of pathetic metaphors that a 1st grade child could make up. No talent is required of what he does. He&apos;s is a piece of shit in the Music Industry that isn&apos;t even about Rap&#x2f;Hip Hop. I don&apos;t see him as Rap&#x2f;Hip Hop at all. He&apos;s just a gay ass Pop star. Even Biz Markie would stick his foot up Big Sean&apos;s ass with lyrical skill. Anyone who buys into Big Sean&apos;s bullshit is a total fucking moron and doesn&apos;t REAL music. I can name shit loads of musicians that would solo Big Sean lyrically. Big Sean is a fucking joke, period.","time":1443397884921},"yfw":{"definition":"Abbreviation for &quot;your face when&quot;.","time":1443397915975},"transvestite":{"definition":"A cross dresser. Most transvestites are NOT homosexuals, however.<br /><br />Official definition from the American Heritage Dictionary of the English Language:<br /><br />A person who dresses and acts in a style or manner traditionally associated with the opposite sex.","time":1443398121807},"nerds":{"definition":"One whose IQ exceeds his weight.","time":1443398123640},"escort":{"definition":"noun, a term for a woman paid by the hour, not the act, but usually for sex.  A [prostitute].  Often, higher quality and cost compared to street [scrag].","time":1443398261060},"homophobia":{"definition":"The fear that gay men will treat you the way you treat women.","time":1443398415847},"ws":{"definition":"(n) Acronym for &quot;watersports&quot; or sexual contact involving pee or urine","time":1443398712709},"poke":{"definition":"What my mom tells me not to be doing to any girls at the age of 15.","time":1443398760549},"jen":{"definition":"Gorgeous, amazing, perfect everything. The girl who has always been my best friend, the girl who I should&apos;ve been chasing this whole time. I love her. &lt;333<br /><br />- Sugarlips","time":1443398785652},"ofc":{"definition":"Used in instant messaging to represent &apos;Of course&apos;","time":1443399191622},"yard":{"definition":"hanging ground. chilling ground, home, area where you live","time":1443399949741},"hml":{"definition":"hit my line","time":1443400086211},"shin":{"definition":"a device for finding furniture in the dark.","time":1443400820446},"deeznutz":{"definition":"something to say to annoy or frusterate something. one of the most popular listed below.","time":1443400830395},"spamming":{"definition":"posting useless crap on forums over and over","time":1443400831286},"lol":{"definition":"The name &apos;Lol&apos; is an abreviated form of the name &apos;[Laurence]&apos;.","time":1443400848790},"light":{"definition":"An incredibly talented singer&#x2f;songwriter from Timmins, Ontario. LIGHTS Poxleitner was recognized for rad her synth- pop skills with a Juno award for the song Drive My Soul. Also known for her artistic abilities (especially drawing comics), LIGHTS does all of the artwork for her albums.  Sometimes referred to as the female equivalent of Owl City, this talented young woman&apos;s success was launched on MySpace. Common hobbies include: playing WoW, hanging out with her tarantula Lance, making vlogs, and being made of awesome.","time":1443400901286},"hax":{"definition":"[n] Something deemed unfair or unexpectedly unfavorable. Could be used to accuse someone of using cheating&#x2f;hacking&#x2f;some sort of trickery to accomplish something, usually jokingly.","time":1443401232763},"jenifer":{"definition":"Variant of Guinevere: Fair one. Guinevere was King Arthur&apos;s mythological queen.  White wave","time":1443401415280},"amber":{"definition":"An exceptionally attractive pale young woman with beautiful freckles and a divine rack. She is hot beyond this world and is also a fantastic lover.","time":1443401425846},"montana":{"definition":"The most manly state in the union where men head-butt bison, punch trout in the face, and chop down trees with their gargantuan dicks. ","time":1443401478360},"fettywap":{"definition":"Handsome young rapper&#x2f;singer from Paterson, NJ known for his song &quot;Trap Queen&quot; and his squad Remy Boyz ... 1738","time":1443401485206},"tooka":{"definition":"That loud pack, marijuana, usually blunts. The dankest weed in all the land rolled prime into a noice blunt.","time":1443401498293},"gdk":{"definition":"Fuck a bitch ass GD. Means &quot;killa of GD&quot;","time":1443401503773},"bdk":{"definition":"&quot;BDK&quot; (Black Disciple Killers) also known as &quot;GD&quot; (Gangster Disciples) is a gang in Chicago. Rappers such as Lil Jay, P. Rico and Lil JoJo who was shot and killed at the age of just 18 by the Black Disciples, are affiliated with the gang. The gang is also known as BrickSquad, FBG (Fly Boy Gang), and Tooka Gang after fallen member Shondale &quot;Tooka&quot; Gregory  The Black Disciples, also known as GDK for &quot;Gangster Disciple Killers&quot;, are a rival gang to the Gangster Disciples, thats why they call them selves the Black Disciples &quot;KILLERS&quot;!  You probably think you dont know anything about the Black Disciples, but they are a lot more popular then you think.<br />If you listen to rappers such as Chief Keef, FredoSantana, Lil Reese, SD, and Tadoe then you should have some idea of what the Black Disciples are. Chief Keef and his crew are a part of the #300 set of the Black Disciples. Rappers such as RondoNumberNine, Edai and L&apos;A Capone who has also been shot and killed at a very young age for dissing a fallen member of rival gang BrickSquad, Shondale Gregory, are part of the #600 set of the Black Disciples. These two sets have very few beef with each other, if any, and rappers from both sets collaborate with each other to make songs.","time":1443401506601},"penis":{"definition":"The tool used to wean and convert lesbians and virgins into useful, productive members of society.","time":1443401548159},"wow":{"definition":"Acronym for the game World of Warcraft.","time":1443401560917},"stop":{"definition":"To cease a motion.<br />","time":1443401580935},"morningwood":{"definition":"A morning erection that is naturally caused as the brains enters the REM-deep sleep phase.  At this stage, the body&apos;s skeletal muscle structure relaxes and causes hypervasodilation in the capillaries of the body, resulting in said erection.","time":1443401589594},"shutup":{"definition":"to cease to talk.","time":1443401614712},"cooper":{"definition":"one sexy individual<br />someone that ooses sex apeal. an extremely wanted person <br />","time":1443401617683},"titfuck":{"definition":"The act of inserting the penis between two tits and fucking them.","time":1443401640400},"d":{"definition":"&quot;a way of referring to your dick without the extra letters&quot;","time":1443401645366},"quiet":{"definition":"1) Containing little noise, but not silence.<br /><br />2) The state of little sound.<br /><br />3) To lower something&apos;s (usually the voice&apos;s) sound.","time":1443401653687},"horny":{"definition":"i assume that if you&apos;re looking up horny you&apos;re probably horny in some way, hence the first example.<br /><br />what happens to me after reading anything.<br /><br />the state i am in after reading the above definitions.<br /><br />desiring [sex] or a wanting to [masturbate].<br /><br />see [ganting] or [randy]<br />","time":1443401659440},"sophisticated":{"definition":"The opposite behavior of 98% of the population below age 21.<br /><br />Sophistication is a mix of knowing when a joke&apos;s over, caring somewhat about the consequences of your actions, talking about something of reasonable importance, having a good dose of common sense, not letting your immediate reactions control your life, knowing how much information is TOO much information, and not wearing wearing your jeans lower than your underwear.","time":1443401777263},"messedup":{"definition":"1.)To be wasted or drunk. (see wasted). <br />2.)To be beaten up badly. <br />3.)Something that is strange or weird.","time":1443402039547},"ksa":{"definition":"Kingdom of Saudi Arabia","time":1443402586796},"usa":{"definition":"The only country keeping penguins from coquering the Earth","time":1443402597166},"muslim":{"definition":"Somebody who goes to live in other peoples countries but refuses to integrate with or tolerate their way of life. At the same time they demand we tolerate them and make all the changes to accomodate their stoneage way of life.<br /><br />Not all muslims are terrorists, but most terrorists are muslims.<br /><br />Great Britain - Love it or leave it.","time":1443402599445},"australia":{"definition":"The best fuckin&apos; country in the world, Australia, is also the only place where Christ could never have been born, as in Australia, you cannot find 3 wisemen and a virgin.","time":1443402622410},"brazilian":{"definition":"A WAXED vagina that is smooth without the stubble that shaving causes.","time":1443402650117},"american":{"definition":"Technically, an American is someone from the Americas - i.e. North or South America. However, it is so commonly referring to people from the USA that we&apos;ll just ignore that point for now.<br /><br />An American is someone who lives in the USA. Not all americans are overweight, ignorant pricks with an addiction to burgers and flag waving. Some of them are actually friendly, intelligent people!<br /><br />Remember, kids: just because meet or hear one person from a certain place doesn&apos;t mean that everyone from there is like it. Oh, and did I mention that the actions of the US government don&apos;t ALWAYS speak unanimously for every last citizen of the USA? Just wanted to clear that up.<br /><br />They do think some wierd things, though.. They call football soccer, American football football, aluminium aloominum, jam jelly and so on. But belittling them for differences like that would be a bit petty of me, wouldn&apos;t it?","time":1443402660857},"brazil":{"definition":"The largest country of South America and one of the most beautiful of the world. Also known in the world for its peaceful and kind people. The famous Rain Forest is placed in the north of the country, and is rich in mineral water, minerals (gold, quartz, bauxite, etc...) and the most important: bio-diversity. For this reason it needs to be protected and not explored by foreign people with the excuse to protect the nature.","time":1443402663309},"drugcartel":{"definition":"An illegal organization that controls production, wholesale and to a lesser extent distrubtes illegal drugs to street pushers. Biggest drug cartels by nationality in the US are Mexican followed by Colombians and Dominicans. <br /><br />Colombians don&apos;t really push inside the US as of today. They have a liason with the Dominican groups, which their areas of operations are north eastern states and to a lesser degree the south, that whoesale and distriubte on the behalf of the Colombians. Mexicans are by far the largest out of the 3 main groups and have basically the rest of the US.<br /><br />Worldwide, the Colombians are considered the largest.","time":1443402689332},"goml":{"definition":"Acronym for get on my level.","time":1443402751962},"koala":{"definition":"a cute australian marsupial that eats only eucalyptus leaves. A marsupial is like a kangaroo (they have pouches for their babies) they are not bears","time":1443402756906},"doge":{"definition":"wow<br />so urban<br />very informatiev<br />much confuse  wow","time":1443402771341},"dropbear":{"definition":"A native to the australian outback, the drop bear is a mysterious, yet chillingly savage member of the marsupial family. If you are unlucky enough to pitch a tent under a tree inhabited by a drop bear, and rouse it from it&apos;s slumber, be prepared for pain country! It will drop from the tree, latching onto your face (a la the facehugger from the alien)and proceeds to rid you of any good looks you may (or may not) have once had.<br /><br />Only known deterrant is a generous smearing of vegemite behind the ears. It saved me once and I&apos;d do it again in a heartbeat!","time":1443402789313},"shit":{"definition":"1. One of the most popular swear&#x2f;cuss&#x2f;curse words&#x2f;profanities<br /><br />2. another word Feces. Poop. Dookie. Scheisse. Poo Poo. Brownies.<br /><br />The Shit List:<br /><br />The Ghost Shit <br />The kind where you feel shit come out, see shit on the toilet paper, but there&apos;s no shit in the bowl. <br /><br />The Clean Shit <br />The kind where you feel shit come out, see shit in the bowl, but there&apos;s no shit on the toilet paper. <br /><br />The Wet Shit <br />You wipe your ass fifty times and it still feels unwiped. So you end up putting toilet paper between your ass and your underwear so you don&apos;t ruin them with those dreadful skid marks. <br /><br />The Second Wave Shit <br />This shit happens when you&apos;ve finished, your pants are up to your knees, and you suddenly realize you have to shit some more. <br /><br />The Brain Hemorrahage Through Your Nose Shit <br />Also known as &quot;Pop a Vein in Your Forehead Shit&quot;. You have to strain so much to get it out that you turn purple and practically have a stroke. <br /><br />The Corn Shit <br />No explanation necessary. <br /><br />The Lincoln Log Shit <br />The kind of shit that&apos;s so enormous you&apos;re afraid to flush it down without first breaking it up into little pieces with the toilet brush. <br /><br />The Nororius Drinker Shit <br />The kind of shit you have the morning after a long night of drinking. It&apos;s most noticeable trait is the tread mark left on the bottom of the toilet bowl after you flush. <br /><br />The &quot;Gee, I Really Wish I Could Shit&quot; Shit <br />The kind where you want to shit, but even after straining your guts out, all you can do is sit on the toilet, cramped and farting. <br /><br />The Wet Cheeks Shit <br />Also known as the &quot;Power Dump&quot;. That&apos;s the kind that comes out of your ass so fast that your butt cheeks get splashed with the toilet water. <br /><br />The Liquid Shit <br />That&apos;s the kind where yellowish-brown liquid shoots out of your butt, splashes all over the side of the toilet bowl and, at the same time, chronically burns your tender poop-chute. <br /><br />The Mexican Food Shit <br />A class all on its own. <br /><br />The Crowd Pleaser <br />This shit is so intriguing in size and&#x2f;or appearance that you have to show it to someone before flushing. <br /><br />The Mood Enhancer <br />This shit occurs after a lengthy period of constipation, thereby allowing you to be your old self again. <br /><br />The Ritual <br />This shit occurs at the same time each day and is accomplished with the aid of a newspaper. <br /><br />The Guinness Book Of Records Shit <br />A shit so noteworthy it should be recorded for future generations. <br /><br />The Aftershock Shit <br />This shit has an odour so powerful than anyone entering the vicinity within the next seven hours is affected. <br /><br />The &quot;Honeymoon&apos;s Over&quot; Shit <br />This is any shit created in the presence of another person. <br /><br />The Groaner <br />A shit so huge it cannot exit without vocal assistance. <br /><br />The Floater <br />Characterized by its floatability, this shit has been known to resurface after many flushings. <br /><br />The Ranger <br />A shit which refuses to let go. It is usually necessary to engage in a rocking or bouncing motion, but quite often the only solution is to push it away with a small piece of toilet paper. <br /><br />The Phantom Shit <br />This appears in the toilet mysteriously and no one will admit to putting it there. <br /><br />The Peek-A-Boo Shit <br />Now you see it, now you don&apos;t. This shit is playing games with you. Requires patience and muscle control. <br /><br />The Bombshell <br />A shit that comes as a complete surprise at a time that is either inappropriate to shit (i.e. during lovemaking or a root canal) or you are nowhere near shitting facilities. <br /><br />The Snake Charmer <br />A long skinny shit which has managed to coil itself into a frightening position - usually harmless. <br /><br />The Olympic Shit <br />This shit occurs exactly one hour prior to the start of any competitive event in which you are entered and bears a close resemblance to the Drinker&apos;s Shit. <br /><br />The Back-To-Nature Shit <br />This shit may be of any variety but is always deposited either in the woods or while hiding behind the passenger side of your car. <br /><br />The Pebbles-From-Heaven Shit <br />An adorable collection of small turds in a cluster, often a gift from God when you actually can&apos;t shit. <br /><br />Premeditated Shit <br />Laxative induced. Doesn&apos;t count. <br /><br />Shitzopherenia <br />Fear of shitting - can be fatal! <br /><br />Energizer Vs. Duracell Shit <br />Also known as a &quot;Still Going&quot; shit. <br /><br />The Power Dump Shit <br />The kind that comes out so fast, you barely get your pants down when you&apos;re done. <br /><br />The Liquid Plumber Shit <br />This kind of shit is so big it plugs up the toilet and it overflows all over the floor. (You should have followed the advice from the Lincoln Log Shit.) <br /><br />The Spinal Tap Shit <br />The kind of shit that hurts so much coming out, you&apos;d swear it&apos;s got to be coming out sideways. <br /><br />The &quot;I Think I&apos;m Giving Birth Through My Asshole&quot; Shit <br />Similar to the Lincoln Log and The Spinal Tap Shits. The shape and size of the turd resembles a tall boy beer can. Vacuous air space remains in the rectum for some time afterwards. <br /><br />The Porridge Shit <br />The type that comes out like toothpaste, and just keeps on coming. You have two choices: a) flush and keep going, or b) risk it piling up to your butt while you sit there helpless. <br /><br />The &quot;I&apos;m Going To Chew My Food Better&quot; Shit <br />When the bag of Doritos you ate last night lacerates the insides of your rectum on the way out in the morning. <br /><br />The &quot;I Think I&apos;m Turning Into A Bunny&quot; Shit <br />When you drop lots of cute, little round ones that look like marbles and make tiny splashing sounds when they hit the water. <br /><br />The &quot;What The Hell Died In Here?&quot; Shit <br />Also sometimes referred to as &quot;The Toxic Dump&quot;. Of course you don&apos;t warn anyone of the poisonous bathroom odour. Instead, you stand innocently near the door and enjoy the show as they run out gagging and gasping for air. <br /><br />The &quot;I Just Know There&apos;s A Turd Still Dangling There&quot; Shit <br />Where you just sit there patiently and wait for the last cling-on to drop off because if you wipe now, it&apos;s going to smear all over the place. ","time":1443402809788},"scorpion":{"definition":"A undead Spectre. His name was Hanzo Hasashi and he was once alive and was a ninja in a clan of assassins. He was killed by a rival clan member, Sub-Zero, and was cast into the Netherrealm. He returned to kill Sub-Zero, but later vowed to protect his younger brother in the future. He is not evil, but he is not good, either. Recently was &quot;killed&quot; by being thrown into Shang Tsung&apos;s Soulnado and was ripped apart by it&apos;s heavenly power.","time":1443402813410},"bye":{"definition":"a nicer way to say &quot;your f-ing ugly. get out of my face&quot;","time":1443402827081},"hue":{"definition":"A word (used primarily by Brazilian gamers or those parodying them) similar to &quot;haha&quot; or &quot;lol&quot;.","time":1443402835513},"giggity":{"definition":"a word that provokes sexually generated activities.","time":1443402856220},"hai":{"definition":"A salutation, friendly hello","time":1443403299353},"nando":{"definition":"Best fast food chicken in the world. Beware peri-peri addiction","time":1443403596501},"dois":{"definition":"an exclamation, related to &quot;duh&quot;","time":1443403632662},"putout":{"definition":"When a female dispenses her sexual favors she is said to &quot;put out&quot;.","time":1443403666203},"tsundere":{"definition":"Tsundere is a slang born on the Internet, and it is a word to describe the nature of female anime or game characters. Tsundere is a word combining two words, &quot;Tsun Tsun&quot; and &quot;Dere Dere&quot;. Both terms describe attitudes of a person. &quot;Tsun Tsun&quot; is used for cold&#x2f;blunt&#x2f;curt attitude, while &quot;Dere Dere&quot; is used when a person becomes [spoony] in front of his&#x2f;her lover. <br />(Definition is from the game &quot; Tsuyokisu Cool×Sweet &quot;)","time":1443403685187},"rotmg":{"definition":"Short for the online game &quot;Realm Of The Mad God&quot;","time":1443404015581},"fluff":{"definition":"A [fanfic] which the story has no plot. Only humourous or romantic nonsense. ","time":1443404288127},"wigga":{"definition":"Caucasian that takes great pride in draping him&#x2f;herself with shiny FUBU, Johnny Blaze, Champion, Wu-Tang and whatever else fake shit they can find at the markets, then pretend they are in the ghetto and call their mates &quot;Dawg&quot; and &quot;Bitch&quot; or &quot;Word Up Niggah&quot;. Prerequisite of wearing an oversized jacket on a stinking hot day.","time":1443404521151},"wu-tang":{"definition":"The second best Tang in the world.  Next to grape, I mean [poon] of course.  Consists of the RZA, GZA, ODB, Inspectah Deck, Raekwon the Chef, U-God, Ghostface Killah, Masta Killa, and Method Man.  Also a large syndacyte consisting of Cappadonna and Killah Priest to name a few.  Easily the best rap group with sharp lyricism named after the legendary Wu Tang sword of Chinese mythology.  Most songs involve a kung-fu intro followed by great production and outstanding lyrics.  All nine hail from Shaolin (Staten Island) and have produced 4 group albums in addition to MANY solo projects.","time":1443404653964},"ettoi":{"definition":"It literally means &quot;and you&quot; in French. It is most commonly used in greeting and farewells.","time":1443404882710},"ho":{"definition":"A word Santa Clause says three times when he sees your wife, mother and sister together in the same room.","time":1443405043636},"simi":{"definition":"HOT SKANK. she is mysterious and exotic and leavees all the boys wanting it. shes a pro at throwin stuff in da airr but can hit da books too. shes every boyss fantasy grl and knows how to get a guy going. shes a pro at everything she does. in definition she is everything a guy needss but shes an undercover grl and you woudnt know unless you got to know her. shes rare and if she gives you a chanace consider it a blessing.<br />","time":1443405723958},"bloodmoon":{"definition":"When a man engages in coitus with a woman on her period, then inserts his bloody penis into her anus.","time":1443405807355},"coitus":{"definition":"fancy way to say fuck","time":1443405821547},"dingus":{"definition":"another word for a spaz.<br /> NOTE: a dingus is NOT a stupid person, because a dingus is someone who can make you laugh by doing stupid THINGS, but they are not stupid people. a stupid person is an idiot. idiot and dingus are different.","time":1443406078308},">.<":{"definition":"see [&gt;_&lt;]<br /><br />a face made when frustraited, pissed, upset, or the like.<br /><br />also associated with [cartman].","time":1443406479160},"frenchkiss":{"definition":"An open-mouthed kiss with tounge","time":1443406538842},"kiss":{"definition":"The sweetest thing a guy can do without bein an ass.","time":1443406545582},"chivalry":{"definition":"Something women complain is dead even though it cannot logically exist in an equal society, which is something women wanted. It&apos;s one or the other.","time":1443406654580},"truthordare":{"definition":"the only game in the world when you would honestly lick your friend&apos;s shoe and then get humped several times with out being totally drunk.","time":1443407334975},"fuma":{"definition":"A fake ass pair of shoes resembling Puma.","time":1443407335678},"alcohol":{"definition":"The cause of, and solution to all life&apos;s problems.","time":1443407599676},"ily":{"definition":"I Love you","time":1443408039110},"fastlane":{"definition":"a wealthy and stylish pace and quality of life that emphasizes quick and precise response to competition","time":1443408234360},"dirty":{"definition":"not clean","time":1443408657496},";-;":{"definition":"many meanings: sad,tear,confusion, etc.","time":1443408714804},";(":{"definition":"Crying, or simply a tear.","time":1443408722605},"hiv":{"definition":"Stands for &quot;Human immunodeficiency virus&quot;.  contrary to some idiot&apos;s beliefs, it was not given to us by the homosexual community.  It is believed to originated in Africa from a mutated form of a virus in a diseased monkey.  We dont actually know how it came about.  It is widely accepted that HIV causes [AIDS] (acquired immune deficiency syndrome) but becuase we cannot do experiments to prove this (due to morality issues) the African government can claim that there is no evidence supporting this hypothesis and does not have to supply medicine for its citizens.","time":1443408728724},"spam":{"definition":"spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam ","time":1443408733944},"ag":{"definition":"AG or &quot;aggressive&quot;... a thug gay girl that looks and dresses like a guy. a tomboy.","time":1443408739168},"latias":{"definition":"[Latios] sister and my favorite Dragon Pokemon. Kind of looks like a pink and white jet plane with eyes. She has Psychic abilities which allows her to see through her brothers eyes and become invisible. She can also take on the form of a human.","time":1443408745765},"compton":{"definition":"The slums outside of L.A. This area is very poor and revolves around gang violence, sex and drug dealing. Compton has produced famous rap artist such as Dr. Dre, IceCube and The Game","time":1443408769585},":3":{"definition":"A symbol meant to represent the cat face made by anime characters when they say something clever, or sarcastic, or are commenting on something cute.    ","time":1443408772205},"brain":{"definition":"Another word for head, or blowjob. This term is most appropriate however, because unfortuantley, most male brains reside in their penile regions","time":1443408802094},"latios":{"definition":"Species of Pokemon<br />Type: Dragon&#x2f;Psychic<br />Color: Light blue&#x2f;white (hint of red)<br /><br />Latios&apos; special abilities including camouflouging and telekentic sight relayed by a Latias.","time":1443408822985},"jason":{"definition":"the only name that can be spelled through 5 months of the year.","time":1443408958356},"darkness":{"definition":"N. A person of african heritage with an extremely dark complection and aswell owns a suade couch which someone has &quot;grinded&quot; there feet into.","time":1443408988925},"heartless":{"definition":"A person that doesn&apos;t care what they do to hurt someone.","time":1443409000964},"knight":{"definition":"Rank in the fuedal system, one below baron and one above the general peasants.<br /><br />Developed during the 800s in a kingdom covering France and a lot of the surrounding area, and rapidly spread to the rest of Europe as far east as Russia and as far south as Spain and Italy. Kings were finding they owned more land than they could control, so they gave vast expanses of it to barons (dukes, counts, etc) in return the barons would pay taxes to the king and would fight for him when it was demanded of them, and they must provide an agreed number of men. Barons are like the medieval equivilant of generals.<br /><br />The barons continued to break up this land into smaller patches, which was controlled by a knight. The knight usually owned one or two villages in his land. The knight would tax the peasants in his land. In return for this, the knight must fight for their lord baron when called upon, and also pay taxes to him, exactly the same duties that the king expects from the barons.<br /><br />The knight could be viewed as the medieval equivilant of captains&#x2f;minor officers today. They recruited both men-at-arms (peasants aspiring to be honourable warriors) and archers (peasants that played the less honourable role of using bows&#x2f;crossbows to fight,) and took these men with them when the baron called them to fight.<br /><br />The knight is a trained killer. Taken from a family of high rank, the young knight (or &quot;page&quot;) left home at about the age of 6 to live with another knight, or even a baron, in their manor or castle. For the first 4 or so years, they were taught manners, such as how to speak different languages or how to carve a roast. From the age of around 10, they were upgraded into &quot;squires:&quot; knights to be. Training as a squire was particulry difficult. By about the age of 18, the knight was a fully trained and honed killer, and was knighted by their master in a long knighting ceremony.<br /><br />Knights from around 1100AD onwards were expected to follow a code of chivalry, which meant being polite to everyone and being generous to the poor. Knights are sometimes dramatised; many knights ignored the code and were simply ruthless, greedy killers. Most base rules were followed however: it was considered cowardly to use a bow, and it was also very dishonourable (and also a waste of ransom money) to kill a defenceless or surrendering opponent.<br /><br />Contrary to popular belief, knights were NOT common soldiers in armour. Knights were men of rank, and it was rare to see huge armies of knights without a vast number of peasant infantry accompanying them. Sometimes the knights and men-at-arms would gather to lead the first wave, as it was their honour and right to do so, but as tactics became more and more important in medieval warfare this custom was less common.","time":1443409011516},"blood":{"definition":"A national street gang, well known for wearing the color red, selling crack, and illiteracy","time":1443409031360},"supedup":{"definition":"to be modified in any fashion, usually used when referring to cars.","time":1443409215395},"ecchi":{"definition":"Softcore [hentai].  Often includes panty-shots, nudity, or perverted situations.  Almost always used for humor.  Ecchi does not describe actual sex acts.","time":1443409589937},"gassy":{"definition":"A boy nicknamed gassy. He has strong acne, pitiful hair, non-saggy pants, pale skin&amp;eye lashes. He fancies many girls at once. He is athletc, not popular. He doesn&apos;t have many friends, and the friends he has love him. :]","time":1443410180054},"chulo":{"definition":"Chulo in Mexican slang refers to someone who is cute, hot, good looking etc.  It can be used to describe almost anyone and is not related to sexual attraction (though it can be.) If you hear it being used in Southern California by Chicanos, Mexican Americans, etc. they are NOT referring to a pimp.","time":1443410556385},"derp":{"definition":"The contemporary DNC and GOP parties are one party. the DeRps.  Ignore what they say, watch what they do!  Your common DeRp wants government spending and lots of it. DeRps don&apos;t care if they have to borrow it&apos;s only important that all of their choice interest groups (hobbies) are fed at the end of the day. The only difference between the DNC and the GOP is what the spending goes toward. They&apos;re consumers just like generation x women and no one takes their men seriously. The generation x women wear the pants in the DeRp house and they represent the marginal power of the DeRp vote.  If you&apos;re into programmed reality TV shows, the DeRps offer a lot of sibling rivalry intrigue for your interactive enjoyment.","time":1443410594650},"bronze":{"definition":"the police","time":1443410603501},"headache":{"definition":"An old, cliched excuse that a woman comes up with when she doesn&apos;t feel like having sex.","time":1443410616107},"nido":{"definition":"Spanish slang for vagina.","time":1443410622959},"savage":{"definition":"Bad ass.  Cool. Violent.","time":1443410655216},"zero":{"definition":"1. The number 0, nothing.<br /><br />2. The name of a Japanese Kamikaze Aeroplane. <br /><br />3.One of the cool names people love to use.<br /><br />4.Zackenberg Ecological Research Operations <br /><br />5.Zoning and Emotional Range Omitted (anime) <br /><br />6.Name of an A-class (now S) Maverick Hunter and X&apos;s best friend in the Megaman&#x2f;Rockman X series. He also features in his own series, Megaman Zero. He have several names given by the fans such as the Crimson Devil, Captain Kamikaze and Zero Omega. He is also the last Wilybot (robots constructed by Dr.Wily) and he&apos;s the original carrier of the Maverick Virus.<br />He&apos;s famous for his long, long, loooong blond hair, red armour and his sabre. Earlier on, he&apos;s famous for his devil-may-care attitude and rather reckless style. Now he&apos;s cool and clear-headed, particularly after Iris died.<br />Living up to his name, in the first X game he self-destructed to save X&apos;s life from Vile. He came back in the second game, and sacrificed himself AGAIN in the fifth. But he still came back in the next instalment.<br />In the Zero series which is set after 100 years of the X series, he&apos;s the main hero, helping the rebels to fight against an anarchy rule. Only time will tell to reveal if he&apos;s the true Zero...or not.<br />However, without doubt, Inafune the creator os Zero obviously shows he loves Zero more...*sob*","time":1443410693712},"beatingadeadhorse":{"definition":"It doesn&apos;t matter how much you want to continue riding beating a dead horse is not going to get you anywhere.<br /><br />If something is already done and over with there is no point in still talking about it.<br /><br />If something is already broken there is no point in trying to use it. ","time":1443410705625},"rex":{"definition":"See [awsome], [sexy], [super-sexy sex god], or [Dog]. He way too sexy, almost too sexy for his own good. Is the father of several love-children. Mother really liked dog-names.","time":1443410728405},"raptor":{"definition":"A drunk female in high-heels. Usually characterized by lots of stumbling and screeching.","time":1443410736130},"boo":{"definition":"1. Boyfriend or girlfriend<br />2. Word used to scare people","time":1443410744729},"nvrm":{"definition":"Chatspeak for &quot;never mind&quot;","time":1443410905550},"oui":{"definition":"a word french women use when having sex  also- the french word for &apos;yes&apos;","time":1443412240141},"sin":{"definition":"Good, dirty fun.","time":1443412825401},"sins":{"definition":"Good, dirty fun.","time":1443412832053},"snuggle":{"definition":"To make oneself comfortable, usually by moving closer to another person or thing.  To embrace closely, as to show affection or offer warmth.","time":1443412882593},"missjackson":{"definition":"Janet Jackson if your nasty.","time":1443413074786},"janetjackson":{"definition":"Fine-ass woman who showed her titty at the superbowl.  Made the halftime show not suck as it usually does, and also made up for the fact that the Panthers lost.  Pissed off alot of annoying, pissy conservatives.","time":1443413083793},"blood+":{"definition":"A great anime, that follows the line of a movie called Blood:The Last Vampire. <br /><br />Under the care of her adoptive family, [Saya] Otonashi has been living the life of an anemic and amnesiac, but otherwise ordinary schoolgirl. Saya’s happy life is shattered when she is attacked by a chiropteran, and learns that she is the only one who can defeat them. (&quot;Chiroptera&quot; is the name of the order of biological classification that contains bats, probably the reason for the vampiric creatures being called &quot;Chiropterans&quot;.)<br /><br />Armed with her sword, Saya embarks on a journey with her family, allies and faithful servant, Haji, to rid the world of Chiropterans and rediscover her identity. The course of the journey reveals the background history of the chiropeterans and Saya&apos;s very deep past, which extends into the mid-19th century.<br /><br />The series is initially set in present day (September 2005) Okinawa City (Koza), on Okinawa Island, near the US Kadena Air Base. In the course of the series, Saya visits locales across the world, while fighting enemy chiropterans and searching for her origins.<br /><br />The anime consists of 50 episodes, and there is word that there will be a second season created in 2008.[citation needed]","time":1443414697457},":c":{"definition":"The saddest man in the whole entire world.","time":1443414986757},":'(":{"definition":"1. Showing sadness while talking online. Looks like a crying face.<br /><br />2. Showing that you wish to shove a small square object into the side of your head.","time":1443415010036},"arceus":{"definition":"The apparent &quot;god&quot; of the Pokemon world, soon to appear in the 12th Pokemon movie to enact [judgement day] upon the universe. Some question, now that you can hack [GOD] IN A [POKE-BALL], what legendaries are left to spew out.","time":1443415042943},"gdi":{"definition":"God Damn Independent, a college student that is not in a fraternity&#x2f;sorority.","time":1443415098707},"anal":{"definition":"What to avoid in prison.","time":1443415158566},"prison":{"definition":"A great place for peadophiles and child molesters","time":1443415177970},"urmom":{"definition":"A highly derogatory phrase which replaces the subject of a person&apos;s sentence to form a base and unoriginal form of retaliation (for those with difficulty thinking of witty comebacks).","time":1443415183800},"phil":{"definition":"Very popular in high school, gets all the ladies but tends to have sex with all the older girls.  Always on some type of drug, usually a phil might be shy but he carries a big package below.  Warning - Phil&apos;s have a very high sex drive and will fuck anything, so be prepared.","time":1443415191299},"nathan":{"definition":"A guy who is caring and intelligent and is superior to all even God.He is loved by all his mates and is there for everyone who has problems and is a great listener.He is so caring and such a strong fighter that nothing can beat him.He is the kinda guy you want as a mate or a lover.A legend at the guitar and guitar hero.He is just an amazing happy person who is easy to love.He has a very nice personality and is very easy on the eyes and is very cute.He is a perfect man in everway unless you cross his path when he is sleepy then you have hell to pay lol. Generally a nice guy with lots of friends who adore and love him.A one of a kind...","time":1443415213569},"jared":{"definition":"1.someone who has achieved the mastery of greatness<br />2.someone you would stride to be like<br />3.a manifestation of excellence<br />4.basically the raw-est nigga God could create ","time":1443415225793},"caleb":{"definition":"to have a sexy body. to have strong biceps, and ripped abs, and a nice ass","time":1443415236243},"chevy":{"definition":"1. An abbreviation of Chevrolet, an American car manufacturer owned by General Motors.","time":1443415254027},"jackson":{"definition":"A person of high energy and appeal. His intensity is both a blessing and a curse. His spontaneity and enthusiasm are inspiring but at times exhausting. He is easily loved and a pure joy to all who meet him. His zest for life is contagious.","time":1443415266940},"lucas":{"definition":"Super-Badass kid. Usually does incredibly stupid things. All around leader. Extremely  attractive and cool.<br /><br />Fly as a motha-fucka.<br />","time":1443415269194},"michealjackson":{"definition":"A mis-spelling of the legendary music icon &quot; Michael Jackson &quot;. (Hard to believe that folks don’t know how to spell the name of one of the most famous and successful pop-stars of the last 50 years.)  Although he was performing with his brothers from the age of 5, his album Thriller, recorded when he was in his twenties, was the cornerstone of his career, and still remains the biggest selling music album of all time, with sales estimated at around 140million to date. His influence on modern popular music and dance is immeasurable. During the Motown 25 Anniversary special in 1983, he astounded the audience with his performance of Billie Jean which gave birth to his signature move the &quot;moonwalk&quot; and established him as one of the most amazing and electrifying dancers in the world.  He received many accolades including 17 Grammys, 26 World Music Awards , 23 entries in the Guiness Book of World Records, 6 Brit awards and numerous awards in recognition of his humanitarian efforts and charitable donations.  His sudden death on 25 June 2009, aged just 50, shocked the world, but his musical legacy lives on – forever The King of Pop.","time":1443415288831},"crystal":{"definition":"a rare beauty, who is extremly smart, and has a love for life! A beautiful person who wants to change the world and all that she meets in it!!! My hero","time":1443415314868},"x":{"definition":"(cheifly British)  In the UK, &apos;X&apos; is commonly used at the end of a message to represent kisses. Similar to &apos;Xs and Os&apos; (kisses and hugs) in North America, however &apos;X&apos; can be and is often used by people of varying familiarity (platonic friendships, siblings, crushes, dating, married, etc.) Usually more Xs means more familiarity. Xs can be seen used between two people of the same sex without being regarded as homosexual.","time":1443415323886},"shevy":{"definition":"The classyist of deviantly sutle women.<br />Beautiful by definintion. Extreemly playfull and sexy. Could be a legendary raging house party in 90&apos;s and it could be their host in a dark and exoctic black lace dress. Long curls and dark sexy eyes. Her girly girls Sex is legendary She is Shevy she is fine and knows what it means to party.","time":1443415342521},"nick":{"definition":"the most amazing person alive with a huge penis","time":1443415360025},"erica":{"definition":"The most [beautiful] queens to ever walk the face of this earth...women named erica are [fierce] by nature and generally quite [sassy]. ","time":1443415370848},"charles":{"definition":"The sexiest thing one the freaking Earth. The fucking hottest person in the world.","time":1443415388688},"anna":{"definition":"The name for the most awesome person ever, It is impossible to fit so much awesome into any other person.","time":1443415405725},"piscean":{"definition":"a person whose sun signis is pisces is known as Piscean just like cancerian, Capricornian","time":1443415424616},"balto":{"definition":"1. Leader of a sled dog team a long time ago who led the team to get an antitoxin back to nome to cure a diptheria epidemic.<br /><br />2. Movie made in the ninties based on a true story. Stars a <br />Wolfdog named Balto who doesn&apos;t know what he is. <br /><br />A russian goose who is Balto&apos;s mentor.<br /><br />A hot dog named Jenna who is Balto&apos;s girl friend.<br /><br />Two polar bears - muk and luk<br /><br />Steele - A sled dog leader who wants nothing but glory and hates balto.<br /><br />and many others","time":1443415433744},"jeremy":{"definition":"A named based on the biblical name Jeremiah. Used as a name for children who are blessed with a large brain and&#x2f;or penis. Also used as a replacement for &quot;perfect&quot;.","time":1443415547046},"jd":{"definition":"1.The coolest dork i know and the main character on scrubs.<br /><br />2. somebody who [trip]s or hallucinates frequently.","time":1443415567697},"joshua":{"definition":"Joshua is a sexy, masculine individual exuding the most desirable of traits.  Although Joshua may be timid at first, his genuine and compassionate charm shine through above all things.  He can be trusted with any secret and will always pull through even when the going gets tough.  His understanding and supportive nature can put anyone at ease as he is never judgmental but rather always willing to listen with an open mind.  He is the epitome of a true man.","time":1443415580177},"shrekislove":{"definition":"Shrek is life.","time":1443415601411},"frost":{"definition":"another way to say that you are high off weed.","time":1443415622379},"eos":{"definition":"Eos (Aurora) is the goddess of the dawn.","time":1443415629724},"sundar":{"definition":"Any guy, who hits, stares or jumps infront of a group of people to get their attention.<br />A guy who acts black cause he came out like that of his moms [poon]<br />Someone who never gets invited to any parties, or get-togethers.<br />One whom loves to spend time at Starbucks.","time":1443415666749},"bandi":{"definition":"The term &quot;Bandi&quot; has a variety of meanings.  1. A male slut who plays girls like board games.<br />2. A complete douchebag who can&apos;t even complete high school.<br />3. A guy with a small dick.<br />4. An overall imbecilic, cocky, idiot who should take a look in the mirror and realize he&apos;s ugly as fuck.","time":1443415699853},"roams":{"definition":"1|Wandering&#x2f;travveling around, Might be for long periods of time.<br /><br />2|[Exploring]&#x2f;touring.<br /><br />3|[Wander]&#x2f;walking around. People who have little to do and &quot;roams&quot; around the house.<br /><br />   *The meanings are of equal importance.","time":1443415722317},"pokemonshowdown":{"definition":"An awesome website where you can battle pokemon online. How cool is that?","time":1443415743406}}