{"7":{"definition":"The fiercest digit known to man.","time":1444365326309},"69":{"definition":"Simultaneous oral sex. Can be practised by M+M, M+F or F+F.<br /><br />The reference is that the numerals 6 and 9 are inverted versions of each other, reflecting the physical position that the couple must adopt when engaged in this sexual practice.","time":1444267720402},"n_n":{"definition":"See: [^_^]","time":1444236775438},"^_^":{"definition":"The Asian variation of the classic smiley face. This is sometimes used in more cheerful situations. ","time":1444236785907},"pff":{"definition":"a term used to say i dont care or fuk that shit","time":1444237089028},"san":{"definition":"The basic suffix attached to a name in Japanese; indicates some respect, approx. equivalent of Mr. or Ms.  Leaving off suffixes is disrespectful, so if you have no other suffix, -san is preffered.","time":1444237821421},"sama":{"definition":"A suffix to a name of a person with high values (Such as a queen, or a priest); A more formal name than san (see [san])","time":1444237840968},"superno":{"definition":"A negative answer to a question usually ranked higher than [no] on the Negative Response Severity Scale (NRSS) yet inferior to a [mega no] or [fuck no]. this term is nearly synonymous to [hell no]<br /><br />As a general rule, one should NOT argue with a [super no].","time":1444237896611},"fuckoff":{"definition":"1. A message used by the hand that is a direct insult to another person.<br />.........................&#x2f;´¯&#x2f;)<br />......................,&#x2f;¯..&#x2f;&#x2f;<br />.....................&#x2f;....&#x2f; &#x2f;<br />.............&#x2f;´¯&#x2f;&apos;...&apos;&#x2f;´¯¯`·¸<br />..........&#x2f;&apos;&#x2f;...&#x2f;....&#x2f;.......&#x2f;¨¯\\<br />........(&apos;(...´(..´......,~&#x2f;&apos;...&apos;)<br />.........\\.................\\&#x2f;....&#x2f;<br />..........&apos;&apos;...\\.......... _.·´<br />............\\..............(<br />..............\\.............\\","time":1444238174494},"stareyes":{"definition":"A term used to describe an individual on a controlled substance, usually cocaine or a hallucinogen.","time":1444238459841},"autism":{"definition":"A condition characterized by obsessive interests and a lack of eye contact.Asperger Syndrome has many facets involving a difficulty in [communication] and inability to grasp social situations and body language. Sufferers report an interest in minor and trivial details, rather than being able to see [the bigger picture]. They also find &apos;small talk&apos; difficult.Sufferers also get absorbed in their own head space and find relationships difficult. They also have a tendency to take words and phrases literally, e.g. If someone with Asperger&apos;s saw a sign in a telephone bill paying shop stating &quot;cash point&quot; the AS suffer would assume [cash point] meant an ATM cash machine and would go to draw money out of it.AS sufferers tend to prefer the company of pets and animals and shun the limelight.They can also have temper tantrums and indulge in activities called [stimming] which is hand flapping or other none verbal gestures such as finger flicking - sufferers of Asperger Syndrome do this when under stress or pressure.Asperger syndrome is a big subject and their are countless different personality types and subcategories of illness&#x2f;condition.Sufferers are often referred to as eccentric or [weird].  Everyone with Asperger Syndrome is different.Asperger Syndrome is a form of Autism. ","time":1444239844755},"fufufu":{"definition":"A Japanese term for (often evil) laughter. It is often used in manga or manga-styled scenes in anime when someone is deviously plotting something. It is mostly humorous.","time":1444240107350},"psssh":{"definition":"essentially the word &apos;psssh&apos; means...<br /><br />-the simple sound that i am making with my mouth is much better than everything you just said.<br /><br />-can also mean, &apos;i don&apos;t care&apos;<br />or<br />-&apos;you are full of shit&apos;<br />or<br />-used to express amusement<br /><br />it is a word that reduces the worth of any previos speech, elevating itself to a higher level of conversation, language and vocabulary.<br /><br />it is frankly, the ultimate word.","time":1444240129470},"boolean":{"definition":"An expression or value that evaluates as either true or false, logically, or as a 0 or 1 to a compiler.","time":1444240167378},"allahuakbar":{"definition":"Literally &quot;God is great&quot; in Arabic. Nice thought, however...  what is said by people beheading hogtied victims &quot;in the name of God&quot;  or what is said by someone in a carbomb seconds before he fires it off in a crowded marketplace.","time":1444240830894},"brothel":{"definition":"house of prostitution","time":1444241098967},"dw":{"definition":"don&apos;t worry","time":1444241629014},"plunder":{"definition":"1. To facilitate intense&#x2f;hardcore sexual intercourse with deep penetration<br />2. Sexual activity that many view as fantasy; anal sex","time":1444242218003},"oral":{"definition":"in the mouth","time":1444242254514},"brb":{"definition":"Acronym for &quot;be right back&quot;","time":1444242600966},"doge":{"definition":"wow<br />so urban<br />very informatiev<br />much confuse  wow","time":1444245990826},"grateful":{"definition":"sitting on a grate, eating too much grate, working with grates too much.","time":1444246195907},"saur":{"definition":"Sympathetic audio urinary reflex.<br /><br />The sudden uncontrollable urge to urinate when pouring liquids  or hearing the sound of pouring liquids.","time":1444246374964},"crocs":{"definition":"quite possibly the ugliest but most comfortable shoes ever. everyone wears them from babies to old farts and rich kids to poor[ish] kids. they are very heinous looking.","time":1444247761137},"bh":{"definition":"Acronym for Butt Hurt","time":1444247903723},"necrophelia":{"definition":"A seriously disturbing act of sexual gratification.","time":1444248119340},"m9":{"definition":"Commonly thought of as mistakes on messenger services, however the terms are both equivalent to M8 - obviously an abbrieviation of the word &quot;mate&quot;. ","time":1444248162382},"sed":{"definition":"Socially emotionally disturbed<br />Seriously emotionally disturbed","time":1444248489881},"tfw":{"definition":"That Feel When<br />Followed by some feel you should be able to relate to.","time":1444249092091},"suca":{"definition":"Italian expressio for &quot;suck&quot; (Original from Sicily)","time":1444249769507},"tyler":{"definition":"Originating from the movie &quot;Fight Club&quot;, Tyler is used to describe one who is extremely sexy and bad ass.   ","time":1444249927134},"ironman":{"definition":"A Genius Billionaire Playboy Philanthropist.","time":1444249992984},"gnaw":{"definition":"A method to in which one shows affection or hunger by &apos;eating&apos; another person, animals or various inanimate objects. It&apos;s often a compliment....or a very hungry person looking for a quick snack. Probably out of you.<br /><br />It&apos;s often a symbol of friendship or [lurve]. Unless the person has pointy teeth..then it&apos;s quite painful.<br /><br />People have been known to respond to gnaws with : [chew], [nibble], [counter-gnaw], various yells, and death glares. <br /><br />It&apos;s also a wonderful way to greet a person, as shown below. (screennames have been changed so there :p ) taken from real conversations.","time":1444250009754},"pensi":{"definition":"A person who has had thier fingers replaced with penis&apos;. The process in which this is done is using a Peenu on your fingers. It is not suggested you do this.","time":1444250239255},"vape":{"definition":"To inhale vapor from E-cigarettes. Used because &quot;smoking&quot; an E-cig doesn&apos;t apply as there is no smoke only vapor.","time":1444250830312},"birb":{"definition":"the popular culture phenomenon that is &apos;birb&apos; is rooted in the mindset cultivated by LOLcats and doge. birb manifests on both twitter and tumblr.  You will not understand birb if you do not have a sense of humour.","time":1444250874542},"phallus":{"definition":"(n.) <br />1. An object that is either a penis, or in some way is related a penis, not neccessarily in shape<br /><br />2. An object that represents masculinity","time":1444250945297},"lool":{"definition":"lol","time":1444251037868},"normal":{"definition":"A word made up by this corrupt society so they could single out and attack those who are different","time":1444251108948},"pleb":{"definition":"Actually defined as a member of a despised social class, a commoner, a member of the plebs of ancient Rome.  Also low-born, undisinguished, vulgar, and my personal favourite: vulgar-looking.  <br /><br />Other words with similar meaning: Scrut, Townie, Kappa-Slapper, Rude-Boi, Scum, Greb, Scav, &amp;c.","time":1444251173741},"lefthandman":{"definition":"A man who is being seen on the side by a woman who has another man who is her boyfriend.","time":1444251180334},"balance":{"definition":"To be the better half for someone else and vise versa.","time":1444251205870},"code":{"definition":"The way a GHETTO ASS black person pronounces the word cold.","time":1444251266640},"cold":{"definition":"Heartless, <br />Having no emotions,<br />","time":1444251274166},"master":{"definition":"The dominant person in a D&#x2f;s or BDSM relationship. Also refered to as the Top, Dom, Domme.","time":1444251281541},"meme":{"definition":"(noun)   <br />    <br />1 : an idea, belief or belief system, or pattern of behavior that spreads throughout a culture either vertically by cultural inheritance (as by parents to children) or horizontally by cultural acquisition (as by peers, information media, and entertainment media)  <br />    <br />2 : a pervasive thought or thought pattern that replicates itself via cultural means; a parasitic code, a virus of the mind especially contagious to children and the impressionable <br /><br />3 : the fundamental unit of information, analogous to the [gene] in emerging [evolutionary theory] of culture  <br />  - meme pool (n.) : all memes of a culture or individual   <br />  - memetic (adj.) : relating to memes   <br />  - memetics (n.) : the study of memes   <br />    <br />4 : in [blogspeak], an idea that is spread from [blog] to blog <br />    <br />5 : an internet information generator, especially of random or contentless information   <br />    <br />(Etymology : meme : derived from the Greek mimëma, &apos;something imitated&apos;, by [Richard Dawkins] in 1976)","time":1444251285994},"lefthand":{"definition":"Its a hand, and, its the left one..","time":1444251501740},"magnet":{"definition":"May be used as a proof that there are miracles everywhere.","time":1444251518931},"righthandman":{"definition":"The person with whom someone of power relates to best. Derived from jesus sitting at the right hand of God.","time":1444251531207},"scoot":{"definition":"1. To move over in order to create space<br /><br />2. To exit with particular haste","time":1444251536821},"benis":{"definition":"[Benis] is to refer to ones entire package. Balls &amp; Penis.","time":1444251581556},">~<":{"definition":"The expression after you facepalm","time":1444251603414},"es":{"definition":"1.) Skate shoes.<br /><br />2.) The [German] word meaning &apos;it&apos;.","time":1444251665972},"bm":{"definition":"acronym for bad mannered, used by korean computer players. ","time":1444251973644},"wtf":{"definition":"The World Taekwondo Federation.<br />WTF, holds many competitions throughout the world.","time":1444252433155},"huehuehue":{"definition":"Laughter - most prominent with speakers of Brazilian Portuguese.  The Brazilian equivalent of &quot;haha&quot;.","time":1444252444584},"sml":{"definition":"&quot;STORY (OF) MY LIFE&quot;<br />Similar to &quot;FML&quot; aka &quot;FUCK MY LIFE&quot;.","time":1444252486732},"tml":{"definition":"Text me Later","time":1444252510644},"pyre":{"definition":"a large pile of wood for burning corpse.","time":1444252742572},"leopold":{"definition":"An all around noble name. Comes from Old English origin and means brave lion. Leo=lion and pold=bold or brave. Can also mean incredibly intelligent and perfect. Anyone named leopold is meant to be a leader. People with this name tend to be really successful and lead really happy lives. I wouldnt be surprised if a Leopold ended up running for President one day","time":1444252834208},"se":{"definition":"Social Engineering - hacker term for manipulating people","time":1444252911507},"netflixandchill":{"definition":"It means that you are going to go over to your partners house and fuck with Netflix in the background.","time":1444252962125},"fr":{"definition":"For Real","time":1444253040161},"mambo":{"definition":"Among the many dance forms that became popular among Cubans and their tourist visitors between World War II and the Cuban Revolution, the Mambo was arguably the peppiest. During the era of Latin big bands in the 1940s and 50s, Mambo artists such as Perez Prado and Machito and his Afro-Cubans were similar to and influenced by American Swing orchestras with their swollen brass sections. In fact, Mambo is named after the instrumental break when horn players would trade licks and push the dancers into a frenzy. Like the Cuban cha-cha-cha, it became popular in New York City with non-Cubans and was quickly adopted into the repertoire of the popular big bands.","time":1444253170262},"teabag":{"definition":"To dunk ones scrotum into the open mouth of another person","time":1444253353242},"santa":{"definition":"The fattest, oldest pimp this side of the north pole.","time":1444253437803},"santaclause":{"definition":"That creepy guy at the mall who pops a boner in your lap when you sit down for a picture you&apos;ll just throw away in 4 months.","time":1444253458376},"santaclaus":{"definition":"The fat bastard who didn&apos;t give me a Bumblebee Transformer in 1985, and will die a slow, painful death for being such a lying son of a bitch.","time":1444253495745},"santaclaws":{"definition":"Ferociously sharp fingernails used for ripping open presents.","time":1444253497554},"genius":{"definition":"A super-smart math teacher that teaches at HTHS and can divide by zero.","time":1444253915408},"math":{"definition":"the lesbian sister of biology","time":1444253952785},"biology":{"definition":"1. The scientific study of life.<br /><br />2. One of the many things that has been pissing off religious zealots for decades.  A drop in a bucket, really.<br /><br />3. One of the many things that has been pissing off about 90% of all students for decades.<br /><br />4. The 21st century counterpart to physics&#x2f;chemistry (20th century) and mechanics (19th century).","time":1444254008352},"ap":{"definition":"a class in which students start off the year with high hopes and it eventaully turns into a class full of crying over acheivers with damaged GPAs and emotional scars","time":1444254027636},"pl0x":{"definition":"A slight variation of [plox] (Means please). The &quot;0&quot; was added purely as a way to annoy the hell out of everyone who reads it.","time":1444254941679},"bbw":{"definition":"A word that fat chicks use as a euphemism for fat.  These girls usually run personal ads calling themselves &quot;pleasingly plump.&quot;  Sure, you&apos;re pleasingly plump if the South Pole is refreshingly chilly.","time":1444255205634},"scapegoat":{"definition":"(n.) A scapegoat is an event person or object that is used to lay the blame on for all that goes wrong, regardless of the contributions of others. This will usually carry on until the scapegoat has gone, or has managed to successfully defend itself against the arguements presented to it.<br /><br />The word comes from Judaism. During mass reconciliation the rabbi would bring a goat to the alter. The sins of the people would be absorbed into the goat, and it would then be killed, its&apos; blood staining the alter until cleansed. This is what [Jesus Christ] reflected in his crucifixion, being a scapegoat.<br /><br /><br />(v.) to make the scapegoat","time":1444256534342},"peanuz":{"definition":"It means PENIS. Yes, that thing you love more than life itself.","time":1444257341587},"scarf":{"definition":"To pig out or &apos;down&apos; food really fast and hastily.","time":1444257536259},"hax":{"definition":"[n] Something deemed unfair or unexpectedly unfavorable. Could be used to accuse someone of using cheating&#x2f;hacking&#x2f;some sort of trickery to accomplish something, usually jokingly.","time":1444257719068},"livid":{"definition":"straight up pissed off.","time":1444257732319},"shore":{"definition":"What people that live in Philadelphia ([philly]) and the suburbs call the South Jersey beach.","time":1444258976245},"smh":{"definition":"Acronym for &apos;shake my head&apos; or &apos;shaking my head.&apos; Usually used when someone finds something so stupid, no words can do it justice. Sometimes it&apos;s modified to &apos;smfh&apos; or &apos;smmfh&apos; by those that prefer profanity in their internet acronyms.","time":1444259441501},"tbf":{"definition":"This means &quot;To be fair&quot;","time":1444259517862},"bamf":{"definition":"Bad ass motherfucker *popularized by [Dane Cook]","time":1444260397892},"spam":{"definition":"spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam ","time":1444260530110},"hand":{"definition":"An alternative to having a girlfriend","time":1444261650864},"girlfriend":{"definition":"mystical creature whose known powers range from clairvoyancy to being able to bleed for a week without dying. a person to have on your side.","time":1444261667070},"getinmybelly":{"definition":"&quot;I want to eat you&quot;. Said in a scotch accent.","time":1444261751574},"abooze":{"definition":"To abuse others when drunk","time":1444262213250},"obnoxious":{"definition":"the kind of people u wanna shoot in the head..","time":1444262255045},"probation":{"definition":"One of the only things that will keep a true stoner from getting high","time":1444262403388},"hoe":{"definition":"1. A skank<br />2. A woman that is too loose in the booty.<br />3. Woman or man that fuck anything with two legs.<br />4. A promiscuous person.[syn: slut]<br />                        ","time":1444262509897},"ite":{"definition":"same as aight, okay, that&apos;s cool, etc.<br />","time":1444262638140},"talor":{"definition":"a very funny yet sarcastic girl who chases boys but RARELY falls for them. she love to party but knows when to be serious. she loves to dance and can be quite good in bed she is beautiful and very curvasiousbut sexy at ehe same time. she is a loyal friend and is very ginuwine to the core. boys beware cause she will reel you in and youll fall for her but she wont fall back. usually a brunett those are the hottest and the most sweet. if you get a chance to meet a TALOR then keep them close they are truly one of a kind.","time":1444262688060},"nbd":{"definition":"Stands for &quot;No Big Deal&quot;.","time":1444262699037},"lionking":{"definition":"When having sex, you pull out right before you ejaculate.  Go in your own hand.  Get the girl to face you and before she realizes it, use your thumb to smear some sperm across her forehead and say &quot;Simba&quot;.","time":1444262910426},"puns":{"definition":"A play on words, usually for a comic reception.","time":1444263244095},"tybg":{"definition":"TYBG is an abbreviation of &apos;Thank You Based God&apos;.  It&apos;s a way of showing your thankfulness to Bay Area rapper Lil B The Based God.","time":1444263624950},"mfw":{"definition":"Abbreviation for &quot;my face when","time":1444263698793},"js":{"definition":"short for jordans (shoes worn by michael jordan)","time":1444263725900},"nappy":{"definition":"Tightly coiled &#x2f; curled unaltered hair. Coiled hair in its natural state","time":1444264007715},"wtw":{"definition":"Generally stands for &apos;What the what&apos; use instead of wtf: &apos;What the fuck&apos;. Most people use a question mark afterwards to get the point through. People who choose not to use curse word may prefer this.","time":1444264012961},"jason":{"definition":"the only name that can be spelled through 5 months of the year.","time":1444264105179},"ys":{"definition":"&apos;Young sluts&apos;<br />Generally between the ages of 13 and 17.<br />These sexual predators may look cute but one touch sends you directly to jail.","time":1444264188962},"siri":{"definition":"Refering to the coolest girl in the world. Super talented, beautiful, wonderful singer&#x2f;dancer&#x2f;actress, and a grand friend to everyone. If you know her you must be cool.","time":1444264278844},"on":{"definition":"to be high or drunk<br />basically under the influence","time":1444265059734},"mmo":{"definition":"Short for [MMORPG] (Massively-Multiplayer Online Role-Playing Game)","time":1444265363323},"johncena":{"definition":"Right as you cum while getting a blowjob, pull out of her mouth and blow your load right into her eyes. <br /><br />Proceed to wave your hand in front of your face and go &quot;YOU CAN&apos;T SEE ME!&quot;","time":1444265403870},"cena":{"definition":"to overcome the odds","time":1444265429957},"john":{"definition":"a very extreamly confusing guy. shows that he has feelings for you sometimes, but then might just randomly stop talking to you at any time. veryy flirtatious. manwhore. willll lead you on. halarious. full of charisma. you have to love him. boys are jealous of him. girls are jealous of the girl he is flirting with at the time..<br />not persistant.<br />changes moods easily; moody.<br />greatest, most annoying person on the face of this earth..yet i still want to be with him..<br />","time":1444265573358},"queef":{"definition":"an expulsion of wind from the vulva during coitus; a vaginal fart.","time":1444265765263},"fuck":{"definition":"1. The universally recognized &quot;F word&quot;<br />2. N. Implying complete and utter confusion<br />3. N. a really stupid person<br />4. V. To procreate<br />5. adj. Can be used to modify any word for more passion<br />6. Int. Expresses disgust<br />7. Int. Expresses complete suprise and joy<br />8. adv. Can be used to make a command more urgent","time":1444266295311},"pingas":{"definition":"Dr. Ivo Robotnik&apos;s infamous subliminal messages. As of 4&#x2f;10&#x2f;08, there have been 4 sightings of him saying this word. This subliminal message is commonly the butt of a joke in a [Youtube Poop], most commonly in the AoSTH genre.","time":1444266477860},"polymorph":{"definition":"A spell used in World of Warcraft by mages as a use of Crowd Control. It generelly turns the target into a sheep, however through Glyphs can be changed to other critters.","time":1444266571472},"john'd":{"definition":"John&apos;d<br />The act of getting intoxicated, using various methods which include but are not limited to:  - drinking alcohol<br />- smoking pot  This is mainly used in western Canada and you may hear your own mother using this term, then laughing like a school girl after the fact.","time":1444266894808},"nojohns":{"definition":"&quot;No johns&quot; means that you can&apos;t make excuses. It is the perfect counter argument to anyone who is making any type of excuse whatever. When someone makes excuses or tries to make excuses, they are &quot;johning&quot;. If this occurs, tell them &quot;NO JOHHNZZ&quot;.","time":1444267012688},"aosth":{"definition":"Adventures of Sonic the Hedgehog, an old TV show from the mid-90&apos;s. Now almost only to be found on the internet","time":1444267168458},"youtubepoop":{"definition":"YouTube Poop is a name used for videos posted on YouTube which are usually nonsensical and random. They are simply just randomly chosen clips from things such as cartoons, clipped, looped and remixed to make it sound really strange. The most commonly used clips include scenes from the CD-i game of The Legend of Zelda, and a Mario game called Hotel Mario. These particular YouTube Poop videos (or YTP) are popular among the internet-savvy people and are a major source of internet culture. Some of YTP is inspired by media shown on YTMND.com, such as the public service message given by Sonic the Hedgehog about being touched in uncomfortable places. The most popular source of clips would be from the Super Mario Bros. cartoon, episode called &quot;[Mama Luigi]&quot;. The most used phrase from this episode would be &quot;That&apos;s MAMA Luigi to you, Mario!&quot; ","time":1444267188638},"lisaann":{"definition":"My most favorite pornstar.","time":1444267303829},"rachelstarr":{"definition":"1 of the best looking chicks in the porn industry. From Dallas Texas. Has done 100s of videos for top names suck as Brazzers, Naughty America, Bangbros Etc. has never done gangbang&#x2f; double penetration.  Gorgeous, buxom, and shapely brunette stunner Rachel Starr was born Brandy Hargrove on November 26, 1983 in Burleson, Texas. Starr first began having sex with girls at age thirteen and had sex with a man for the first time one week prior to her fifteenth birthday. Rachel was discovered by adult film actor Jack Venice working as a stripper in California. Starr started performing in explicit hardcore movies at age 23 in 2007; she has appeared in X-rated features for such notable companies as Brazzers, Bang Productions, Jules Jordan Video, and Red Light District. Rachel has several tattoos as well as piercings in her navel, tongue, clitoris, and both nostrils. Moreover, Starr was nominated for AVN Awards for Best Group Sex Scene in 2009 and Best Three-Way Sex Scene in 2011.  Best known for her round butt, perfect tits, tattoos on her feet and a star tattoo just above her pussy, and a kinky attitude.","time":1444267310148},"scissoring":{"definition":"A Lesbian sex act where two partners interlock their spread legs (like two pairs of [scissors]) and grind their [vulvae] together to stimulate each other&apos;s clitoris to orgasm. Also called [tribadism], the practice has many colloquialisms. In some Central American countries it is called &quot;making tortillas,&quot; and the Chinese refer to the act as &quot;polishing mirrors&quot;.<br />","time":1444267703840},"pbbt":{"definition":"the sound used to describe the action of a person sticking out their tongue and blowing hard making a farting noise. Used to express disappointment.","time":1444268510831},"makeout":{"definition":"the act of swapping spit with your significant other... or perhaps just some hottie you met at a party, but anyway, you just sit there sucking at eachother&apos;s faces for an extended period of time and if you&apos;re lucky there might even be a little romming around of the hands if ya get my drift :p","time":1444268825436},"sian":{"definition":"Perfection. Total Perfection.","time":1444268939203},"bomb":{"definition":"1. (before 1997) Something really bad; a failure<br /><br />2. (after 1997) Something considered excellent and&#x2f;or the best (uses modifier &quot;the&quot;)","time":1444269000930},"vaginalcord":{"definition":"Medical term for the nerve connecting the vagina to the heart which prevents women from having meaningless sex.","time":1444269082692},"twat":{"definition":"1) A great word to shout out.<br />2) A woman&apos;s vagina.<br />3) A blow to the face or genitalia.<br />4) Used by Tweety.<br />5) An offensive term for a person.<br />6) Acronym for The War Against Terrorism.","time":1444269741621},"kevingates":{"definition":"best rapper in br today","time":1444269802628},"ner":{"definition":"Non-Existent Relationship  1. The transition period between singlehood&#x2f;&quot;just friends&quot; and a committed relationship  2. More than a hookup, but not quite a relationship  3. For people in [friends with benefits] relationships who want to deny it  4. The relationship status &quot;it&apos;s complicated&quot; on Facebook","time":1444270128233},"ren":{"definition":"ren is the best a person can be and the closest the can come to becomeing a gentleman, one who respects his brothers and remain&apos;s unrecognised while is free of resentment. Ren is used by Confucius in his book the, The Analects.","time":1444270262110},"rwby":{"definition":"An acronym for four characters in the show RWBY. Made by Rooster Teeth productions. The characters names are Ruby Rose, Weiss Schnee, Blake Belladonna, Yang Xio Long.","time":1444270344223},"xio":{"definition":"A very talented skinner for doom 3. His skinpack made &quot;Gamestar magazine&quot; in the September 2004 issue. Possibly one of the best Revamper&#x2f;Reskinner there is.","time":1444270387906},"blackhole":{"definition":"An area of space-time with a quantum singularity at its center.  The singularity has a theoretically infinite mass, making it impossible for even light to escape.  Around the singularity is an Event-Horizon.  This is also known as the point of no return because it is the critical area that light can no longer escape from, and time itself comes to an end, or is at the same time ad-infinitum.  Much work has been done on this subject by Stephen Hawking.","time":1444270400222},"xiao":{"definition":"Small in Chinese Mandarin","time":1444270414702},"weegee":{"definition":"a slightly disturbing version of Luigi with a distinct creepy, unsettling stare.He usually appears in random pictures videos,and most notably infecting random people with his &quot;weegee virus&quot; that causes the victim to become a replica of himself. Not to be confused with his older brother Malleo. ","time":1444270861000},"malleo":{"definition":"A version of Mario introduced in Youtube videos. He is also Canadian, talking like Terrance and Philip of south park. But, all he can say is fire flower. But, when he says it, he turns things into fire flowers. He is also Weegees older brother.","time":1444270878755},"inap":{"definition":"What happens when you have been working at your computer for too long, nod off and wake to find yourself nose down on the keyboard.","time":1444271585607},"marcia":{"definition":"someone who is beautiful, sensual, exciting, and smart. smells like flowers!!","time":1444271964133},"dbz":{"definition":"The acronym for Dragonball Z, it is the only anime whose viewing audience does not primarily consist of nerds and losers.  A large portion of its viewers are actually &quot;cool&quot; (by meaning of social standards).  As a matter of fact, quite a few fans of the series are unfamiliar with the term &quot;[anime]&quot;.","time":1444272049567},"dragonball":{"definition":"Bulma is a girl in search of the 7 mystical dragonballs that when brought together grant any wish. In her search she bumps into the owner of one of these balls, a strange boy named Goku. The two then set off together, Bulma in search of the dragonballs and Goku on a quest to become stronger. Along the way, they meet and befriend a plethora of martial artists. Goku also undergoes rigorous training regimes and educational programs in order to fight in the World Martial Arts Tournament, a competition involving the most powerful fighters- in the world. Outside the tournaments, Goku faces diverse villains such as Emperor Pilaf, the Red Ribbon Army, the demon Piccolo Daimao (King Piccolo) and his offspring Piccolo Jr., who eventually becomes Goku&apos;s ally.","time":1444272062347},"bien":{"definition":"TRUE: the Spanish word for [well]<br />FALSE: the Spanish word for [good]<br />","time":1444272096307},"gogeta":{"definition":"when Goku and Vageta from DGT combine using a fusion technique","time":1444272110531},"dgt":{"definition":"a skateboard gang formed in dothan alabama to piss off faculty members at a local school but got to serious when a bunch of pussy niggas started shit<br /><br />D.G.T is also a skateboard team formed by the same group of people and is the abbreviation for Durty Greengo Team<br /><br />the colors worn by D.G.T members are green and orange...orange is worn by senior members and green is worn by new members","time":1444272118676},"dragonballgt":{"definition":"Complete and utter shit.","time":1444272138833},"dragonballz":{"definition":"1) Story that is VERY slow at progressing.  One example had the planet blowing up.  They had about 4 minutes to get off it or they&apos;d all die, however it didn&apos;t blow up until about 10-15 30 minute episodes later.<br /><br />2) Story about a bunch of &quot;heros&quot; that try to save the world but fail spectacularily and must watch the world get blown up.  Then they just make a wish for the world to be restored and then they have &quot;saved the world.&quot;<br /><br />3)A story with a plot that doesn&apos;t go much beyond &quot;the most powerful warrior in the universe&quot; trying to destroy the universe only to be defeated.  Then some guy that is stronger and also impossible to beat shows up and is beaten.  Repeat this proccess and you have Dragonball Z.<br /><br />4) Show about Dragonballs, not sure what the &quot;z&quot; is for.<br /><br />5) Anime in which a bunch of guys fight, valiantly die, and then come back to life so they can die again when the next invincible guy comes","time":1444272160016},"supersaiyan":{"definition":"A saiyan who has gone through a transformation which multiplies his current power and turns his hair blonde and his eyes green&#x2f;light blue","time":1444272218877},"supersaiyan2":{"definition":"As if the Super Saiyan level itself was not advanced enough, the Saiyan can still extend his or her power more and more as they progress in the Super Saiyan levels.This level of a Saiyan (S.S.2) is far more powerful than the Super Saiyan, and has grown longer hair.The hair is not much longer, but it&apos;s a noticeable difference.The muscles are not as buldged out as the full power of a Super Saiyan, and this enables the fighter to be faster, and stronger when necessary. The known fighters to reach this advanced level of Super Saiyan 2 are Gohan during the Cell battle, Vegeta when under the influence of Babidi, Goku when fighting Vegeta, when Goku and Vegeta fuse for the first time into Gogeta, and when Goku and Vegeta fuse for the second time to form Vegeto","time":1444272252542},"supersaiyan3":{"definition":"A level achieved by Goku during the majin buu saga and gotenks as well. It&apos;s the second strongest form a saiyan can ever achieve in power. A super saiyan 3&apos;s physical attributes are of long golden hair, no eyebrows, a more mean looking face, and golden electrical aura that surroundes them. They say it takes 7 super saiyan 2&apos;s to defeat one super saiyan 3!","time":1444272275374},"supersaiyan4":{"definition":"This is one of the two Super Saiyan levels that do not appear in the original manga. The Super Saiyan 4 form can only be reached after transforming into a Golden Oozaru and then gaining conscious control over the form. In order to become an Oozaru the Saiyan tail must be fully extended. This form was first achieved by Goku when battling Bebi.<br /><br />In this form the Saiyan&apos;s hair changes color (in Goku&apos;s case it turned black again, and Vegeta&apos;s orignal hair color has a tint of brown in it), the tail is present (due to the necessity of transforming into an Oozaru before taking this form) and the body and tail are covered in some shade of red fur. A Saiyan in this form also possesses a red shadow trim around the eyes and over the eye lids. The hair is lengthened and grows wild and untamed. This form, like Super Saiyan 3, can only be maintained for short periods of time. Only Elder Kai knew of Super Saiyan 4 and its abilities.<br /><br />This form has the characteristics of a basic humanoid Saiyan and the &quot;Ape&quot;&apos;s characteristics. This is why this form has natural color hair with Ape&apos;s fur and tail. This form harnesses the brute power of the Oozaru in the conscious hands of a Saiyan. Super Saiyan 4 is only possible for pure-blood Saiyans. This means Gohan, Trunks and any other half-breeds cannot reach this form. Vegeta, who was missing his tail, used a Blutz Wave emitting device made by Bulma (Bruits Waves in the Japanese version, a pun on &apos;brute&apos; and &apos;fruits&apos;) to aid his first transformation.","time":1444272295835},"supersaiyangod":{"definition":"The new super saiyan transformation that&apos;s going to appear in the new Dragon Ball Z movie. Goku will be the one that achieves it (much to the disappointment of Vegeta fan boys.)","time":1444272331712},"vegeta":{"definition":"A character in the DBZ series. Most famous for his phrases such as &quot;Un-beleivable&quot; and &quot;impossible&quot; and &quot;In conceivable&quot;. These phrases are like the only things he says in 75% of the frieza saga.","time":1444272372268},"pokemon":{"definition":"A disease that started in Tokyo.  It first infected Gameboys in Japan in 1995.  Then in 1998 the disease infected Gameboys in America.  Soon channel WB11 was infected too, and now Cartoon Network.  The ever-so-popular &quot;Gameboy Advance&quot; systems got infected in 2002, and still is.  In 1999 the disease started spreading via cardboard aka &quot;Pokemon Trading Card Game&quot;.  &quot;Nintendo 64&quot; and &quot;Nintendo Gamecube&quot; are infected too.  The disease is also spreading via plastic and metal in the toy isles at Wal-Mart, K-mart, toys-r-us, and every other toy store.  It is now July 2004, almost 10 years after the start of this addicting, argument instigating disease and it is still out there, but not as bad as its most powerful years(1999-2001).","time":1444272393008},"hoenn":{"definition":"a place with to much water.","time":1444272427095},"johto":{"definition":"The second of the main regions of the Pokemon franchise. It is home to Pokemon #152-251 in the National Pokedex, and is geographically adjacent to the Kanto region. It is the setting of the games Pokemon Gold, Pokemon Silver, Pokemon Crystal, Pokemon HeartGold, and Pokemon SoulSilver. The starters in the Johto region are Chikorita, Totodile, and Cyndaquil, and its legendaries are Entei, Raikou, Suicune, Celebi, Ho-Oh, and Lugia. The antagonists generally associated with the Johto region are Team Rocket.","time":1444272437759},"unova":{"definition":"A region in the world of pokemon, its starters include Tepig, Oshawott, and Snivy, home to the legendary Kyurem, her champion was Alder succeeded by Iris; it is playable in both black and white series of the pokemon franchise and is the stage of the fifth pokemon generation","time":1444272474865},"kalos":{"definition":"player, pimp, master, owner","time":1444272530648},"basic":{"definition":"An adjective used to describe any person, place, activity involving obscenely obvious behavior, dress, action.<br /><br />Unsophisticated.<br /><br />Transparent motives.","time":1444272827565},"bully":{"definition":"A young hoodlum who revels in making peoples lives a misery during school years. Happily though, when they grow up they will have nothing more to look forward to than getting anally penetrated every day by fellow prisoners in the shower, or, by the prison wardens truncheon ;D","time":1444273497424},"bullying":{"definition":"See [abuse]<br />&apos;Nuff said<br />The simple fact is, ladies and gentleman, bullying is abuse, no matter how much you deny it.<br />I can stand here... well, sit here, all day and say that murder is not permentant - it doesn&apos;t make it true.","time":1444273504948},"bae":{"definition":"Bæ&#x2f;bae is a Danish word for poop. Also used by people on the internet who think it means baby, sweetie etc.","time":1444273871234},"taskforce":{"definition":"The task force is a group of dedicated [Lil B] (aka [The Based God]) fans who are assigned to protect Lil B at all costs by any means necessary. It is also the name of one of Lil B&apos;s albums.","time":1444273877103},"lilb":{"definition":"The Based God himself. The most swagged up person on the planet. A Pretty ass bitch. Looks like Jesus, Paris Hilton, Mel Gibson, a martian, and anything you could think of. He will fuck all your bitches, and most likely your mom. You can only understand his teachings if you based yourself.","time":1444273897071},"ignorance":{"definition":"Together with prejudice, the currency of the modern world","time":1444274108175},"elchapo":{"definition":"Joaquín Archivaldo Guzmán Loera, born either 25 December 1954 or 4 April 1957 is a Mexican drug lord who heads the Sinaloa Cartel, a criminal organization named after the Mexican Pacific coast state of Sinaloa where it was formed. Known as &quot;El Chapo Guzmán&quot; for his 5 ft 6 in stature, he became Mexico&apos;s top drug kingpin in 2003 after the arrest of his rival Osiel Cárdenas of the Gulf Cartel, and is considered the &quot;most powerful drug trafficker in the world&quot; by the United States Department of the Treasury.","time":1444275485270},"yapo":{"definition":"Yet Another Box﻿ Opening&#x2f; Yet Another Packet Opening","time":1444275510284},"chappo":{"definition":"A sturdy, legend of a man with indestructible brain cells. Impervious to pain, he will melt in tropical weather. When naked, is easily confused for having three legs. Can often be found in the bathroom surrounded by haze. Prefers elegant women with firm breasts and an even firmer attitude.","time":1444275523913},"hue":{"definition":"A word (used primarily by Brazilian gamers or those parodying them) similar to &quot;haha&quot; or &quot;lol&quot;.","time":1444275547797},"w.e":{"definition":"1337 for &quot;whatever&quot; or &quot;w&#x2f;e&quot;; primarily used by those too lazy to move their finger one more key over and press &quot;&#x2f;&quot;","time":1444275606710},"b":{"definition":"A greeting to one of your homies","time":1444277545011},"muscle":{"definition":"Someone paid or in service to protect and&#x2f;or do the physical hardships of another.","time":1444277561360},"wotm8":{"definition":"“U WOT M8” is a shorthand for “You what, mate?” which is a colloquialism used by English speakers in the United Kingdom, Australia and New Zealand. It is typically used in response to an incoherent proposition put forth by someone else, along the similar lines of “what did you just say?” or wat or what is this. Alternatively, the phrase can be used devoid of any context to confuse anyone that is unfamiliar with the expression.","time":1444277733341},"tyrant":{"definition":"(1) ruler who has unlimited power over other people, and uses it unfairly and cruelly<br /><br />also see [word]bush[&#x2f;bush]","time":1444278405876},"ash":{"definition":"That gay ass prick from pokemon.","time":1444278932401},"ajf":{"definition":"word that describes a guy that is any of the following: asshole, jacker, fuckface","time":1444278972759},"shit":{"definition":"1. One of the most popular swear&#x2f;cuss&#x2f;curse words&#x2f;profanities<br /><br />2. another word Feces. Poop. Dookie. Scheisse. Poo Poo. Brownies.<br /><br />The Shit List:<br /><br />The Ghost Shit <br />The kind where you feel shit come out, see shit on the toilet paper, but there&apos;s no shit in the bowl. <br /><br />The Clean Shit <br />The kind where you feel shit come out, see shit in the bowl, but there&apos;s no shit on the toilet paper. <br /><br />The Wet Shit <br />You wipe your ass fifty times and it still feels unwiped. So you end up putting toilet paper between your ass and your underwear so you don&apos;t ruin them with those dreadful skid marks. <br /><br />The Second Wave Shit <br />This shit happens when you&apos;ve finished, your pants are up to your knees, and you suddenly realize you have to shit some more. <br /><br />The Brain Hemorrahage Through Your Nose Shit <br />Also known as &quot;Pop a Vein in Your Forehead Shit&quot;. You have to strain so much to get it out that you turn purple and practically have a stroke. <br /><br />The Corn Shit <br />No explanation necessary. <br /><br />The Lincoln Log Shit <br />The kind of shit that&apos;s so enormous you&apos;re afraid to flush it down without first breaking it up into little pieces with the toilet brush. <br /><br />The Nororius Drinker Shit <br />The kind of shit you have the morning after a long night of drinking. It&apos;s most noticeable trait is the tread mark left on the bottom of the toilet bowl after you flush. <br /><br />The &quot;Gee, I Really Wish I Could Shit&quot; Shit <br />The kind where you want to shit, but even after straining your guts out, all you can do is sit on the toilet, cramped and farting. <br /><br />The Wet Cheeks Shit <br />Also known as the &quot;Power Dump&quot;. That&apos;s the kind that comes out of your ass so fast that your butt cheeks get splashed with the toilet water. <br /><br />The Liquid Shit <br />That&apos;s the kind where yellowish-brown liquid shoots out of your butt, splashes all over the side of the toilet bowl and, at the same time, chronically burns your tender poop-chute. <br /><br />The Mexican Food Shit <br />A class all on its own. <br /><br />The Crowd Pleaser <br />This shit is so intriguing in size and&#x2f;or appearance that you have to show it to someone before flushing. <br /><br />The Mood Enhancer <br />This shit occurs after a lengthy period of constipation, thereby allowing you to be your old self again. <br /><br />The Ritual <br />This shit occurs at the same time each day and is accomplished with the aid of a newspaper. <br /><br />The Guinness Book Of Records Shit <br />A shit so noteworthy it should be recorded for future generations. <br /><br />The Aftershock Shit <br />This shit has an odour so powerful than anyone entering the vicinity within the next seven hours is affected. <br /><br />The &quot;Honeymoon&apos;s Over&quot; Shit <br />This is any shit created in the presence of another person. <br /><br />The Groaner <br />A shit so huge it cannot exit without vocal assistance. <br /><br />The Floater <br />Characterized by its floatability, this shit has been known to resurface after many flushings. <br /><br />The Ranger <br />A shit which refuses to let go. It is usually necessary to engage in a rocking or bouncing motion, but quite often the only solution is to push it away with a small piece of toilet paper. <br /><br />The Phantom Shit <br />This appears in the toilet mysteriously and no one will admit to putting it there. <br /><br />The Peek-A-Boo Shit <br />Now you see it, now you don&apos;t. This shit is playing games with you. Requires patience and muscle control. <br /><br />The Bombshell <br />A shit that comes as a complete surprise at a time that is either inappropriate to shit (i.e. during lovemaking or a root canal) or you are nowhere near shitting facilities. <br /><br />The Snake Charmer <br />A long skinny shit which has managed to coil itself into a frightening position - usually harmless. <br /><br />The Olympic Shit <br />This shit occurs exactly one hour prior to the start of any competitive event in which you are entered and bears a close resemblance to the Drinker&apos;s Shit. <br /><br />The Back-To-Nature Shit <br />This shit may be of any variety but is always deposited either in the woods or while hiding behind the passenger side of your car. <br /><br />The Pebbles-From-Heaven Shit <br />An adorable collection of small turds in a cluster, often a gift from God when you actually can&apos;t shit. <br /><br />Premeditated Shit <br />Laxative induced. Doesn&apos;t count. <br /><br />Shitzopherenia <br />Fear of shitting - can be fatal! <br /><br />Energizer Vs. Duracell Shit <br />Also known as a &quot;Still Going&quot; shit. <br /><br />The Power Dump Shit <br />The kind that comes out so fast, you barely get your pants down when you&apos;re done. <br /><br />The Liquid Plumber Shit <br />This kind of shit is so big it plugs up the toilet and it overflows all over the floor. (You should have followed the advice from the Lincoln Log Shit.) <br /><br />The Spinal Tap Shit <br />The kind of shit that hurts so much coming out, you&apos;d swear it&apos;s got to be coming out sideways. <br /><br />The &quot;I Think I&apos;m Giving Birth Through My Asshole&quot; Shit <br />Similar to the Lincoln Log and The Spinal Tap Shits. The shape and size of the turd resembles a tall boy beer can. Vacuous air space remains in the rectum for some time afterwards. <br /><br />The Porridge Shit <br />The type that comes out like toothpaste, and just keeps on coming. You have two choices: a) flush and keep going, or b) risk it piling up to your butt while you sit there helpless. <br /><br />The &quot;I&apos;m Going To Chew My Food Better&quot; Shit <br />When the bag of Doritos you ate last night lacerates the insides of your rectum on the way out in the morning. <br /><br />The &quot;I Think I&apos;m Turning Into A Bunny&quot; Shit <br />When you drop lots of cute, little round ones that look like marbles and make tiny splashing sounds when they hit the water. <br /><br />The &quot;What The Hell Died In Here?&quot; Shit <br />Also sometimes referred to as &quot;The Toxic Dump&quot;. Of course you don&apos;t warn anyone of the poisonous bathroom odour. Instead, you stand innocently near the door and enjoy the show as they run out gagging and gasping for air. <br /><br />The &quot;I Just Know There&apos;s A Turd Still Dangling There&quot; Shit <br />Where you just sit there patiently and wait for the last cling-on to drop off because if you wipe now, it&apos;s going to smear all over the place. ","time":1444279776225},"yes":{"definition":"1) An affirmative answer to a question, the opposite of no.<br />2) An expletive shouted out during an orgasm.<br />3) A British [progressive rock] (or [art rock]) group known for their hits &quot;Roundabout&quot; and &quot;Owner of a Lonely Heart&quot;.<br />4) A brand of laundry detergent in the US.","time":1444280687163},"no":{"definition":"The word that makes sex rape.","time":1444280700116},"maybe":{"definition":"You can use this word for anything, it can mean yes or no or just an answer because you cannot be bothered making up anytbing more elaborate. It can piss people off, it can amke them happy all in all it seems to be a pretty great word.","time":1444280705986},"maura":{"definition":"The most wonderful or beautiful girl you have ever seen; one of a kind","time":1444280723556},"cookie":{"definition":"a food that is fun to eat, but also used as a sarcastic reward.","time":1444280815715},"cookies":{"definition":"a woman&apos;s wet vagina","time":1444280842381},"herro":{"definition":"The standard greeting of Engrish.","time":1444282055683},"aussie":{"definition":"A cobber from the awsome race we call Australians.  He or she is likely to excell in all kinds of sports, drinking beer, talking the ear of a grasshopper or just being a plain old funny prick. ","time":1444282375480},"jamaican":{"definition":"1.pertaining to or of Jamaica in origin. <br />2.person who is likely to have aunts or uncles younger than he is. <br />I AM JAMAICAN <br /><br />WA GWAN... <br />I am not a druggist, ganja dealer, or any variation of a drug dealer. <br />I dont live in a hut, under a palm tree, or on the beach. <br />and I dont know Bob Marley (R.I.P), Sam the Jerk man, or the Fudgie man from KINGSTON, although I&apos;m sure they are irie people. <br /><br />I have a DON not a Prime Minister! <br />I speak ENGLISH not JAMAICAN! <br />AND ITS PRONOUCED MAN, NOT MON, MAN! <br /><br />I proudly wear my flag on a REGGAE BOYZ shirt! <br />I believe in riots, not protests! <br />I eat pear, not avocado! <br />Its called FOOTBALL, not SOCCER! <br />And I never take responsibility for my actions! <br /><br />Jamaica is the First Nation of weed, <br />The largest english-speaking caribbean Island, <br />and the BIRTH-PLACE OF REGGAE! <br /><br />MY NAME IS NATTY, AND I AM JAMAICAN! <br /><br /><br /><br />","time":1444282477732},"beasto":{"definition":"Someone that has sex with animals in the ass with no lube.","time":1444282599807},"dvd":{"definition":"Digital Versatile Disc<br />Digital Video Disc<br /><br />A type of storage device, shaped like a CD (compact-disc), but more powerful and rife with storage space, and useful for countless applications, such as movies.","time":1444285657882},"blueray":{"definition":"Blue Ray: Also known as Blue Rape is a company that makes High Definition DVD&apos;s.<br /><br />They charge an unheard of amount of money for the &quot;better picture&quot; which isn&apos;t that much better from the standard DVD&apos;s of today.<br /><br />They get you buy charging (on average) 30-35 dollars a dvd. Then you have to buy an HD DVD player. Then for the full effect you have to buy an HD Tv. All this so some asshole can think he is seeing a better picture which isn&apos;t really that nice. It&apos;s a never ending circle of rape. In some electronic stores, when you buy Blue Ray, they save you the wait of a car trip and just stick a dildo in your ass right there at the register.<br /><br />Blue Ray is also the single handed downfall to Sony and the PS3.<br /><br />","time":1444285746603},"sorry":{"definition":"A word commonly used to make a yelling person shut the fuck up.","time":1444287192070},"kkk":{"definition":"A bunch of racist morons, who think that they are superior only because they are to stupid to obeserve their low position amongst the scum of society. In fact so stupid they burn their own religion to show faith!? The word stupidty doesnt begin to explain the moronic logic and manupulative ways in which they scheme only to discoer the abomination to mankind that they are.","time":1444287822435},"fighting":{"definition":"In some countries such as South Korea, &quot;Fighting&quot; is used as words of cheer.<br />The meaning of &quot;Fighting&quot; is similar to the meaning of &quot;Let&apos;s go&quot; or &quot;Do your best&quot; or &quot;Good luck&quot;","time":1444290453112},"trollface":{"definition":"A rather deformed face meant to display the expression that trolls have whilst angering people.  It was formed by a man who calls himself &quot;Whynne&quot; on a whim; it was a short comic displaying the fantasy and reality of trolling on the web...  In other words, faggotry is the result of an uneducated opinion being surpressed by people with actual brains, and thus, the idiot decides to troll, rather than the troll making, and I quote: &quot;Intentional logical fallacies.&quot;","time":1444293874344},"alex":{"definition":"noun.<br />Someone that is of extreme greatness. Often considered as a god in some religions. Also means cool.","time":1444294486824},"arana":{"definition":"spider","time":1444294585770},"cana":{"definition":"A type of deep, lesbian love. ","time":1444294589058},"torpid":{"definition":"Slow.","time":1444294605226},"alexander":{"definition":"Usually a very very very goodlooking straight gentleman that has great taste in women. He has a crazy side to him but only shows it infront of true friends. Has great style, is hilarious, amazing, caring, sweet and will make you smile. You will always have a good time with an Alexander, so if you got a friend named Alexander count yourself one of the luckiest people in the world!","time":1444294907986},"hooters":{"definition":"what you have to look at when a girl is talking to you","time":1444296130469},"6ix":{"definition":"Toronto. Derived from telephone area code (416). Popularized by Drake. Usually receded by &quot;the&quot;. Popularized by Drake","time":1444296813623},"derivatives":{"definition":"1. In calculus, the slope of a function at a point. It is found by taking the limit of (f(x + h) - f(x)) &#x2f; ((x + h) - x) where h (also seen as delta x) approaches 0.<br /><br />Notations for a derivative include dy&#x2f;dx and f&apos;(x) (f prime of x)<br /><br />2. The mathematical incarnation of Satan Himself","time":1444298365499},"amber":{"definition":"An exceptionally attractive pale young woman with beautiful freckles and a divine rack. She is hot beyond this world and is also a fantastic lover.","time":1444298545964},"jennifer":{"definition":"A female name that people of america name their children.","time":1444298551169},"nightmare":{"definition":"A figment of your imagination.<br /><br />Similar to dreams, but explains something terrible.","time":1444298898500},"dood":{"definition":"The superior way to spell &quot;dude.&quot;","time":1444298942262},"dude":{"definition":"A word that americans use to address each other. Particularly stoners, surfers and skaters.","time":1444298949488},":3":{"definition":"A symbol meant to represent the cat face made by anime characters when they say something clever, or sarcastic, or are commenting on something cute.    ","time":1444299020278},"wallace":{"definition":"WALLACE : verb (to WALLACE, Wallaced, Wallacing)  ON THE RIVER Wallace takes three forms:  1) Upwards Wallace - where the boat is flipped and dumps the entire crew (rafting)  2) Downward Wallace - where the swimmer(s) take an especially nasty deep swim (rafting)  3) Baby Wallace - A dirtbag lost his or her seat, paddle, or maybe a custy or two (rafting)  kayakers and C-1ers are Wallaced when they get worked in a hole, run over by a rubber pusher, get an epic beat down, and of course anytime they swim.  OFF THE RIVER:<br />Dirtbags are well known by their frequent slapping of beers and other precious articles (such as paperwork) from each other&apos;s hands. They take the same form as on the river, Downward: off the feet. Upward: off the face. The Baby Wallace is a slight bump of the arm that results in slight spillage, kind of like a warning shot... &quot;Hey Dirtbag, pay attention!&quot; with the added caveat that one must properly declare the Wallace by yelling &quot;Wallace&quot; during the act. (IF YOU DON&apos;T DECLARE WALLACE WHILE BEGINNING THE ACT, YOU ARE AN ASSHOLE AND SUBJECT TO A PUNCH IN THE NOSE!)<br />And no crying or getting angry watching your Wallaced drink soak into the earth! Grab it and pound it out!!!<br />NOTE: highly frowned upon to WALLACE a full beverage. Large stack of paperwork... BONUS POINTS  WALLACE may also be used in lieu of the word BURN!, in it&apos;s declarative form.","time":1444299094119},":s":{"definition":"Confusion","time":1444299345098},"xd":{"definition":"A laughing face. Hey, it&apos;s better than lol.","time":1444299953384},":x":{"definition":"Used when someone has nothing to say&#x2f;doesn&apos;t want to reply. Also used when someone has a comment, but doesn&apos;t want to say anything.","time":1444299973321},":o":{"definition":"The act &#x2f; face of being surprised.","time":1444300063628},"werewolf":{"definition":"The question asked for the answer, &quot;There, wolf.&quot;","time":1444300071342},":/":{"definition":"Hard one to define imo.. I guess it&apos;s<br />1. This sucks.<br />2. Whatever<br />3. Greeeeeeeat (sarcasticly)","time":1444301002280},"charmander":{"definition":"Even the newborns have flaming tails. Unfamiliar with fire, babies are said to accidentally burn themselves.  The flame on its tail show the strength of its life force. If it is weak, the flame also burns weakly.   If it is healthy, the flame burns brightly.  Obviously prefers hot places. When it rains, steam is said to spout from the tip of its tail.","time":1444302101376},"charmeleon":{"definition":"The most disgraceful mid-evolved starter pokemon.Crappy moves.Also is the name for hatians with funny head shapes.","time":1444302128268},"charizard":{"definition":"While having sex with a girl with pubic hair, light her pubes on fire as you ejaculate.  Your semen will put out half of the burning hair, and afterwards while she is flapping her arms about wildly, scream: &quot;YOU DON&apos;T HAVE ENOUGH BADGES TO TRAIN ME!&quot; and run out of the room.","time":1444302178149},"bulbasaur":{"definition":"A grass type pokemon. Evolves into Ivysaur, and then Venusaur. Attacks include Leech Seed, Vine Whip, Razor Leaf, and Solar Beam. Walks on all fours, and has a blub on its back. Weak against fire and flying pokemon.","time":1444302208854},"ivysaur":{"definition":"Pokemon #002<br /><br />Type: Seed<br /><br />Elements: Grass, Poison<br /><br />Height: 3&apos;03<br /><br />Weight: 28.7 lbs.<br /><br />When the bud on it&apos;s back starts swelling,<br />a sweet aroma wafts to indicate the flower&apos;s coming bloom!","time":1444302227757},"venusaur":{"definition":"A bigass dinosaur [Pokemon].","time":1444302244186},"squirtle":{"definition":"This pokemon will rape you with bubbles.<br />With a smile on its face.","time":1444302297536},"wartortle":{"definition":"A medium quantity of female ejaculation.","time":1444302325595},"blastoise":{"definition":"One of the great water pokémon, fully equipted with a duel hydro pump.  He must have a HUUUGE BLUE COCK!","time":1444302342323},"cyndaquil":{"definition":"A small, fire type pokemon. It looks similar to an echidna","time":1444302379273},"typhlosion":{"definition":"A pokemon who kicks everyone&apos;s ass","time":1444302426716},"chikorita":{"definition":"An [grass type], [chikoria] [pokemon] with an small leaf on his head.","time":1444302454185},"meganium":{"definition":"The last evolution of the grass type starter Pokemon in Pokemon Gold&#x2f;Silver&#x2f;Crystal&#x2f;HeartGold&#x2f;SoulSilver. Evolved from Bayleef, which was evolved from Chikorita. It can revive dead plants back to life with its breath.","time":1444302497440},"totodile":{"definition":"An [water type], crocodile&#x2f;[alligator] [pokemon] with long teeths.","time":1444302516356},"chimchar":{"definition":"A Pokemon character that has fire coming out it&apos;s butt.","time":1444302619833},"humper":{"definition":"[Hump]er is deragotory slang for a person seen as a [square].  Similar usage to [looser], [pud] or [wad].  Ocasionally used in a more general greeting amongst friends, as with terms [Dude] or [coach].","time":1444302774389},"hawk":{"definition":"knife","time":1444302835415},"doom":{"definition":"A classic first-person shooter ([FPS]) made by ID Software, the same folks who made quality games like [Wolfenstein] and [Quake].","time":1444302980479},"mew":{"definition":"Cat-Like and sweet Pink Pokemon.<br /><br />Sound that cat Make.<br /><br />Furry happiness Sound.","time":1444303222047},"mega":{"definition":"v. very, really, extremely.  Sometimes used for more emphasis.","time":1444303258841},"gengar":{"definition":"1. A word meaning something very exciting, interesting, entertaining, or will lead to a drunken stupor. Similar to the word [clutch] or [radical].<br /><br />2. A Pokemon, number 94. This pokemon is of the ghost type, it evolves from Haunter (the final evolution of Ghastly) only through the use of a Gameboy cable link. Sidenote: Pokemon is still for fags.","time":1444303313647},"alakazam":{"definition":"When you do a girl doggy style , then take it out and spit on her back to make her think you jizzed on it, then when she turns around, you jack off and cum in har face and say &quot;ALAKAZAM BITCH&quot;","time":1444303352291},"wigglytuff":{"definition":"1. A pokemon<br />2. A geeky male","time":1444303470546},"heatran":{"definition":"Heatran has a 50-50 chance of being male or female. It is avaliable in both the Diamond and Pearl versions of Pokemon after you beat the pokemon league. It is found in Stark Mountain. It dwells in volcanic caves. It digs in with its cross-shaped feet to crawl on ceilings and walls.","time":1444303472292},"machamp":{"definition":"The most muscular pokemon ever! People often this it&apos;s homosecual because it wears a speedo. It and pikachu are tied for &quot;the gayest pokemon award&quot;.","time":1444303501144},"red":{"definition":"Flavor of kool-aid to a black person.","time":1444303514134},"trainerred":{"definition":"The most BADASS pokemon trainer or person ever. He has a hot girlfreind named yellow, and is assisted by his partner pika.","time":1444303527302},"pokemonmaster":{"definition":"The best of real life pokemon trainers. They host tournaments in their garages to find worthy opponents. &apos;Pokemon&apos; they use include &apos;dogs&apos; and &apos;chickens&apos;","time":1444303573843},"lance":{"definition":"Lance&apos;s are the most incredibly rare creatures 8) they have  phenomenal personalities ;D If you find one make sure you lock him up in your closet and swallow the key, cause they are people who will always be faithful and loyal :) when you need them, they&apos;ll always be there for you. They are easy to get along with :3 Through any bad situation, they can always make you smile with their funny sense of humor. If you let a Lance into your life they&apos;ll brighten up your world ^^ Lances have immense beauty and are extremely talented in the arts. :) They are passionate and can triumph through any obstacle in life no matter how hard the situation may be in, and some how are are always able to have a smile on their face and willing to help others :]. They&apos;ll be the best friend you&apos;ll ever have :)) And as a lover, you are lucky with out a doubt, they are prefect in every way, for they are very caring and thoughtful, though others may see &quot;faults&quot;, you see perfection, you are not blinded but gifted to see who and what they are. so never let these people out of your life, for they are the most amazing people you could possibly meet. Lances will change your life forever.","time":1444303598498},"n":{"definition":"Arguably the best free Flash game ever created.  The game is a platformer by genre, with a few puzzle elements that come from the stunts you must pull involving jumps.  N stands for Ninja, as you play a small stick figure ninja who is capable of running at very high speed, wall jumping, and jumping very long distances.  The game has staying power due to the users&apos; ability to make their own maps as well as play the levels other people create, though it could be months before you get through all the normal game&apos;s levels.<br /><br />You must avoid a variety of enemies, all of which kill you brutally and violently (though it couldn&apos;t be called disturbing, he&apos;s only a stick figure) which is made extra entertaining due to the game&apos;s physics engine.","time":1444303643789},"yellow":{"definition":"[Yellow] is the colour that divides edible [snow] from non-edible snow","time":1444303666203},"gold":{"definition":"An [element] found on the [periodic table] under<br />[atomic number]: 79<br />[symbol]: [Au]<br />[atomic weight]&#x2f;[atomic mass]: 196.96655g<br />[group name]: [Coinage] metal<br />[group]: 11<br />[period]: 6<br />[block]: d-block<br />[CAS Registry ID]: 7440-57-5<br />Standard [state]: [solid] at 298 [K] <br />[Colour]: gold <br />[Classification]: [Metallic] <br />[Availability]: gold is available in many forms including wire, foil, and bars.<br /><br /><br />Gold is usually [alloyed] in [jewellery] to give it more strength, and the term [carat] describes the amount of gold present (24 carats is pure gold). It is estimated that all the gold in the world, so far [refined], could be placed in a single cube 60 ft. on a side. It is [metallic], with a yellow colour when in a mass, but when finely divided it may be black, ruby, or purple. <br /><br />It is the most [malleable] and [ductile] metal; 1 ounce (28 g) of gold can be beaten out to 300 square feet. It is a soft [metal] and is usually alloyed to give it more strength. It is a good [conductor] of heat and [electricity], and is unaffected by air and most [reagents].<br /><br />The most common gold [compounds] are auric chloride (AuCl3) and chlorauric acid (HAuCl4). A mixture of one part nitric acid with three of hydrochloric acid is called aqua regia (because it dissolved gold, the King of Metals). It is unaffected by air and most reagents. It is found free in nature and associated with [quartz], [pyrite] and other [minerals]. Two thirds of the world&apos;s supply comes from [South Africa], and 2&#x2f;3 of [USA] production is from [South Dakota] and [Nevada]. Gold is found in sea water, but no effective [economic] process has been designed (yet) to extract it from this source.<br /><br />It would not normally be necessary to make gold in the laboratory as it is readily available commercially. The most romantic way to extract gold is by panning it out from a stream in some pleasant valley but most such sources are now [depleted]. Panning relies upon the [density] of gold (which is very high) being much greater than that of the sand and other [particulates]. It therefore settles to the bottom of the pan. <br /><br />Today, more often than not, gold is [extracted] from ores. These ores often contain relatively little gold. Some of these processes cause [environmental] concern. The ore is crushed to a powder so as to expose the small gold particles. These are dissolved by treatment of the [rock] with cyanide solution in air. The result of this is a gold cyanide complex. Addition of zinc powder to the resulting solution [precipitates] out the gold.<br /><br />4Au + 8NaCN + O2 + 2H2O  4Na[Au(CN)2] + 4NaOH<br /><br />2Na[Au(CN)2] + Zn  2NaCN + Zn(CN)2 + Au (s)","time":1444303694059},"dragonite":{"definition":"In the game: A really good pokemon that can learn a wide variety of attacks with good stats all-around, especially attack.<br /><br />In the anime: A really shitty pokemon that lost to a yellow piece of shit called pikachu.","time":1444304113204},"soz":{"definition":"Nonsensical internet slang term for &quot;sorry&quot;, used by illiterate morons who for some reason substitute a “z” for “rry”, the latter of which would take an entire quarter of a second to type out.","time":1444305540384},"mojojojo":{"definition":"The public enemy #1 who terrorises the City of Townsville in Powerpuff Girls Cartoon. This clever monkey is always plotting against the Powerpuff Girls by inventing new machines and is very snobbish too. Now used in everyday English:  <br />1. To describe a person who disregards others&apos; personal space, especially during commute.<br />2. A bossy person<br />3. To make fun of your friend who suddenly use very profound words or concepts.","time":1444305651281},"pikachu":{"definition":"fat-assed yellow wombat","time":1444305665461},"snorlax":{"definition":"1. A massive pokemon<br />2. A massive human usaully a hurtful nickname","time":1444305674495},"cancer":{"definition":"A disease lacking a sense of humor.","time":1444305843931},"inb4":{"definition":"Generally used on internet forums, inb4 refers to a user posting a reply to a message&#x2f;topic &quot;before&quot; another user posts an obvious response. When used appropriately, inb4 is followed by a word or short phrase that the user knows will eventually appear in the topic conversation.  ","time":1444305915646},"oreo":{"definition":"what black kids at my school are called if they aren&apos;t intolerant and disrespectful trolls who hold up the hallway everyday in between class pushing pot and cutting the entire lunch line.","time":1444307018308},"scurred":{"definition":"Different way to say &quot;scared&quot;","time":1444307205227},"hatians":{"definition":"A dark skinned person who usualy immigates to the U.S in seach of money,shampoo,soap,shoes,edable food. You may comonly find them working at Pollo Tropical like i have recently discovered there race is usless and not functionl in our world.<br /><br />Oh yea and they speak french of shitty spanish i mean WTF, even niggers dont like them.","time":1444307350844},"raichu":{"definition":"Pokémon #26. The evolved form of Pikachu.","time":1444307498639},"suicune":{"definition":"Surf&#x2f;Roar&#x2f;Rest&#x2f;CalmMind<br /><br />Also has no weak, but this rumor was proven false numerous times.","time":1444307836397},"raikou":{"definition":"Raikou is the 243rd pokemon.<br />Raikou belongs to a trio of legendary pokemon, the other two being [Entei] and [Suicune].  Raikou is said to be the embodiment of lightning&#x2f;thunder, and unlike Entei and Suicune, is not in his own movie, though he does have a one hour special episode called &quot;Raikou: The Legend of Thunder!&quot;  Raikou also has a Giant Pokemon Center edition Plush, along with the other two beasts.<br />Raikou is available to catch in pokemon Colosseum (from the third boss, Ein) and in fire red and leaf green, when you pick Squirtle as your starter and beat the elite four. (appears at random)<br />Also one of the best pokemon out there.","time":1444307853891},"entei":{"definition":"(en-tay)<br /><br />A legendary fire type beast pokemon. Like [Raikou] and [Suicune], it never stays in one place for long. In the third pokemon movie, Entei posessed the power to speak to humans (just like [Mewtwo] in the first pokemon movie and [Lugia] in the second pokemon movie).","time":1444307879588},"death":{"definition":"the cure for life","time":1444308104977},"define":{"definition":"Verb. 1. To explain the meaning of a word or concept.<br />2. To impart greater clarity or resolution to. ","time":1444308114023},"mewtwo":{"definition":"Probably the only Pokemon that&apos;s actually cool. The only Pokemon who seeks world domination and plots for him and his clones to inherit the world. He is the most powerful of all Pokemon and can withstand anything that comes his way.","time":1444308962244},"moltres":{"definition":"Moltres takes the form of a large bird with flame-colored plumage, resembling a phoenix. Its dazzling wings and elaborate head crest appear to be covered with flames. It has a straight, pointed brown break, which is the same color as its feet. Compared to the other legendary birds ([Zapdos] and [Articuno], it has the smallest feet and legs. However, it is the largest of the legendary birds, but its feathers make up a good portion of its bulk. When Moltres flaps its wings, it creates a brilliant flash of flames. It is also one of the few Pokémon known to naturally wield the very powerful Flying-type move Sky Attack.  Moltres is one of the legendary birds of Kanto, and is a poorly understood species, believed by many to be pure myth. Its behavior is largely clandestine, but it appears to migrate to the south during the springtime. There are many folktales surrounding this species, but perhaps the most popular is that its appearance will bring about an early spring. When Moltres flaps its wings, it sheds hundreds of tiny embers. It is believed that these embers have healing properties. If injured, it will immerse itself in lava to heal. Moltres appear to live in hot regions, particularly active volcanoes. They are spectacularly rare. Moltres have been sighted on Victory Road and near the Sevii Islands. One has been recently sighted, roaming Sinnoh.","time":1444308982179},"zapdos":{"definition":"The most badass pokemon that ever lived. Is very hard to amuse.","time":1444309012344},"articuno":{"definition":"Ice Birdie Queen Pimpstress the Pokémon. <br /><br />The coolest. The hottest. The iciest.","time":1444309024721},"rayquaza":{"definition":"Rayquaza is the English name for a Pokémon originally named &quot;Rekkuzza&quot; in Japan. The English name was assigned by Nintendo of America.<br />   In Hoenn, an island region in the Pokémon world, legend states that this creature, the &quot;Master of the Skies,&quot; once descended from the clouds to end a cataclysmic battle between the Earth Titan &quot;Groudon&quot; and the Sea Titan &quot;Kyogre.&quot; Occording to legend, the battle almost destroyed the earth. Had Rayquaza not ended the fight, all would be lost.<br />   Thousands of years later, Rayquaza laid to rest atop a tall tower built long ago known as &quot;Sky Pillar.&quot; It slept for years until a young child came and awoke it once more, as the evil organizations Team Magma and Team Aqua had called forth the Titans of Earth and Sea once more, not knowing if the consequences.<br />   Upon being awakened, Rayquaza immediately flew to Sootopolis Mountain, modernly hollowed into a city and named Sootopolis City. This was where the Titans were clashing, much to the awe and fear of the local residents. Rayquaza repeated history and sent them back into their hidden caves, where they were to sleep peacefully forever more.<br />   Rayquaza has since been captured and exact statistics on this respectable beast have been recorded in the Pocket Monsters Index, or the PokéDex.<br />   Rayquaza measures in at a hight of 23 feet exactly, but only when sitting in a snake-like curl. Its long body from nose to tail has not yet been recorded, but is estimated to be about 60 feet or more. It weighs in at 455.2 lbs. It has the ability to pressurize the atmosphere around it, and nullifies all weather effects such as rain or intense sunrays. How it does this is yet to be explored. It is classified as Pokémon number 384 in the National PokéDex. It goes by the number of 200 amongst the Hoenn Region PokéDex. It has been dubbed the &quot;Sky High Pokémon,&quot; for its ability to live in altitudes as high as the ozone layer.<br /><br />A truely magnificent and rare beast indeed. There is only one in existance, but scientists in the Cinnibar Genetic Research Association are trying to clone it, so we may see more of this magnificent creature before the only one in existance dies.","time":1444309290985},"groudon":{"definition":"The most legitimate ground Pokemon of all time. It has an array of different attacks that all rape you. It starts every battle by pissing on the clouds so that the sun shines brightly in the sky. Then it can anally rape any pokemon with a [solarbeam] without even having to gather sunlight. If that doesn&apos;t make the Pokemon faint, Groudon will simply rape the ground with an earthquake, inciting mass chaos and pain within the colon of any nearby Pokemon. In a two vs. two battle, Groudon will rape all of the other participants, including his own partner.<br />Also used to refer to BAMFs who get action from everyone and their mother, simultaneously.","time":1444309316905},"kyogre":{"definition":"Kyogre, the Sea Basin Pokemon. Kyogre has the power to create massive rain clouds that cover the entire sky and bring about torrential downpours. This Pokémon saved people who were suffering from droughts. After long years of feuding with Groudon, it took to sleep at the bottom of the sea. Through Primal Reversion and with nature’s full power, it will take back its true form. It can summon storms that cause the sea levels to rise. Kyogre is said to be the personification of the sea itself. Legends tell of its many clashes against [Groudon], as each sought to gain the power of nature.  Also, it almost beat [Team Aqua] leader Archie. Key word there being almost.","time":1444309359320},"wingeddragonofra":{"definition":"A big shiny flying dragon bird thing who noone knows what the fuck it is from the yu gi oh television series, it&apos;s also the god card noone gives a fuck about because slifer and Obelisk are just better. this also means to paint your dick gold , flap your arms as if they were wings while your woman sucks your golden cock. commonly used with Obelisk the Tormentor","time":1444309478643},"slifertheskydragon":{"definition":"When a male with a dick of 12-15 inches paints it red and the wraps it around a females neck while snahing it tighter to simulate a serpent wraping around building.","time":1444309514708},"obeliskthetormentor":{"definition":"When you paint your dick blue and use it to cockslap a girl.","time":1444309537664},"iry":{"definition":"Iry comes from the Jamaican contraction of the English word [Alright]. Similar to the way [them] has been contracted to [dem] in [Ebonics].","time":1444310361835},"boo":{"definition":"1. Boyfriend or girlfriend<br />2. Word used to scare people","time":1444312801626},"milk":{"definition":"The most tasty shit EVER.","time":1444313849334},"mik":{"definition":"the champion of all men, he rules, there is nothing more to say, he is the fucking man!","time":1444313855462},"mikhail":{"definition":"A wonderful, smart and nice person. An overall perfect human being.","time":1444313905928},"omega":{"definition":"1. The 24th and last letter of the Greek alphabet.  2. The extreme or final part.  3.a. A negatively charged elementary particle that has a mass 3270 times the mass of an electron.  3.b. A very short-lived unstable meson with mass 1532 times the mass of an electron.  4. A luxury watchmaker based in Switzerland. Their watches have famously been worn by James Bond 007 since 1995.  5. A Hungarian rock band formed in 1962. As of this definition they have released 16 Hungarian studio albums encompassing different musical genres: folk rock, hard rock, space rock, progressive rock, and synthrock. They have released some English and German albums and singles over the years but these are hard to find. They have had the same lineup for over 30 years: Kóbor János, Molnár György, Benkő László, Mihály Tamás, and Debreczeni Ferenc. Their greatest album is probably 10000 Lépés released in 1969.","time":1444314006236},"richard":{"definition":"Tall, almost towering, large features, arms, legs. Beautiful heart. Kind, usually reserved about sharing his feelings. Although he is able to communicate well, he feels much more deeply than he speaks. Only those that are close to him will ever really know him. Will see &apos;it&apos; through even if he is unhappy, his commitment unwavering. Will make many mistakes believing he has made a &apos;wise&apos; choice. Realizes logic does not bring happiness. Falls in love only once, usually shocking (completely different upbringings) to him. When he does find her, he is relentless in his pursuit. However, it is not calculating, unconsciously he maneuvers his actions to allow himself to be with her. A strong, powerful force, a positive energy, other men are always questioning, &quot;what&apos;s so great about Richard?&quot;. Spiritual leader. Excellent lover, very good with his entire body, making women fantasize about him regularly. A very thick, yummy kisser. Richard is a kind, good, lovely, beautiful, sweet, aggressive, sensitive man with a consecrated heart. Richard is super sexxy!","time":1444314295817},"sean":{"definition":"used to define huge sarcastic assholes, that end up becoming amazingly sweet. Seans know exactly how to piss you off and then five seconds later have you cracking up. Huge jerks, but gotta love &apos;em. ","time":1444314333486},"so":{"definition":"n., Acronym - &apos;Significant Other&apos;.","time":1444314584408},"shadow":{"definition":"The ultimate life form who is cloned by some weird shaped scientist","time":1444314635384},"wwb":{"definition":"Walking While Black","time":1444316164080},"cupcake":{"definition":"When a muffin is consumed by magic.","time":1444316517863},"muffin":{"definition":"A girls vagina - Many different kinds like blueberry (shaved), buttered (with cum), and many more.","time":1444316524803},"immortal":{"definition":"A very great Black Metal band. Formed in 1990 in Norway by Abbath (Olve Eikemo). Lyrical themes include: Winter, Grimness, Darkness, Blashyrkh. Recently Disbanded. Long live the kings.<br /><br />Last cd: Sons of Northern Darkness","time":1444316842553},"vote":{"definition":"The best way you have of voicing your opinion in a way that can matter.  Nothing&apos;s perfect, and there&apos;s always going to be mistakes, but there is simply no excuse for not casting a ballot for what you believe in.  Take the time to understand the issues and then take the time to vote.  Don&apos;t let people who aren&apos;t going to be around four years from now decide your future. Complaining without voting is worse than any hanging chad.","time":1444317948235},"gaylesbian":{"definition":"1. Something to call your friend when you are unsure of their sexuality.  2. A secret group for you and your friends containing all the answers to the world.  3. A synonym for &quot;White Trash&quot;.","time":1444319457592},"fawk":{"definition":"fawk (noun); fawked, fawker, fawkin <br /><br />1. used to address someone<br /><br />2. da asian pronunciation to the word [fuck] (how my old man would say it...)","time":1444319471505},"six":{"definition":"this is any car in Mercedes&apos; top-of-the-line 600 series...no matter what anyone tells you, it is not a car with a V6 engine. rappers rap about driving sixes; my grandmother&apos;s Buick has a V6...which makes more sense here?","time":1444319498174},"ksa":{"definition":"Kingdom of Saudi Arabia","time":1444320247580},"uae":{"definition":"United Arab Emirates is called UAE","time":1444320263450},"india":{"definition":"Where every company outsources our jobs to.","time":1444320290906},"head":{"definition":"When a girl wants to pleasure you by licking, sucking your penis. Often times, teens dont know how to do this, so they practice a lot. They often times forget to be moving her hand up and down on the part of the penis her mouth cant reach, which will help the ejactulation process. Some girls enjoy, some dont, luckily, my girl doesnt mind it at all. <br /><br />Advice to all guys: while getting head, make sure to stay very &quot;focused&quot; and into it, and think about how fucking awesome it is while its happening, and just how good it feels, it will make it even better, and during the orgasm, enjoy! It is the best, but, you might not feel the best right after, like, you will feel a little &quot;unhorny&quot;, but thats normal. Make sure to love your girl, because she definately cares enough to do this to you. My advice: go down on her too, if she wants it.","time":1444321899707},"fapping":{"definition":"To jack off or masturbate.","time":1444322677721},"jackoff":{"definition":"stimulating your penis with your hand to cause orgasm and ejaculation.  Male masturbation.","time":1444322682811},"orgasm":{"definition":"The meaning of life.","time":1444322687215},"life":{"definition":"A sexually-transmitted, terminal disease.","time":1444322691229},"terminal":{"definition":"adj. something that is incredibly cool; more than sick or ill","time":1444322708112},"sick":{"definition":"1)crazy, cool, insane<br />2)what one is on a test day","time":1444322719519},"day":{"definition":"The thing that exists when a yellow&#x2f;orange ball is visible in the sky.  Quite unlike night strangely.","time":1444322724462},"ball":{"definition":"1. A man&apos;s testicles where [sperm] is produced.<br />2. Courage or bravery.<br />3. Manliness.<br />4. Something yelled to shock people.","time":1444322731455},"shock":{"definition":"A term expressing the ability to fight well, often coupled with the modifier &apos;mad&apos;.","time":1444322739636},"ability":{"definition":"the quality of being able to do something. attach it to the end of any verb to make up new words!","time":1444322746114},"words":{"definition":"1) well said<br />2)said in a agreement<br />3) can be used as a greeting, hey whats up","time":1444322759564},"as":{"definition":"Nickname for the Oakland Athletics, a kickass baseball team that always gets screwed over by teams with more money.","time":1444322767238},"greeting":{"definition":"common scottish slang for crying","time":1444322769978},"scottish":{"definition":"the standard by which all else is judged.","time":1444322780947},"tru":{"definition":"Essentially, &quot;TRu&quot; is an expression of contentment, satisfaction, goodness, approval, and&#x2f;or of course, agreement. It is generally enunciated in a deep, low voice, with a slightly increasing pitch, and the vowel sound of &quot;u&quot; is elongated without the diphthong.<br /><br />&quot;TRu&quot; can also be used to fill a void in conversation.<br /><br />Note #1: There is no &quot;e&quot; at the end of &quot;TRu&quot;, and the &quot;R&quot; is always<br />capitalized.<br /><br />Note #2: When &quot;TRu&quot; is followed by exclamation point(s), an optional space<br />can precede each exclamation point to express additional emphasis:<br />Exciting: TRu!!!!<br />Extremely exciting: TRu ! ! !","time":1444322788014},"goodra":{"definition":"A [Pokemon] from the 6th generation that looks like a Poison type but actually is a Dragon type. When it gives someone a hug, it leaves that being covered in goo. Goodra is also very affectionate towards people.","time":1444322800159},"jizz":{"definition":"is an organic fluid known as semen that usually contains spermatozoa. It is secreted by the gonads (sexual glands) and other sexual organs of male or hermaphroditic animals, including slugs, for fertilization of female ova. The process of discharge is called ejaculation.","time":1444323119520},"sabrina":{"definition":"a special crazy girl who is a brown haired fire ball who can be shy at times and is drop dead beautiful she is fun and can be a flirt but guys stare but cant get the guts to talk to her she loves music she has big brown eyes that sparkle when she talkes she has a odd but hot clothing style she is very unique and amazingly talented she dreams of being better which is hard to imagine for her she is loyal and truly a fun person she has unique food taste and likes all sorts of music she has a ghetto ass and big boobs she has a tall nice shape and wavy&#x2f;curly hair.","time":1444323670520},"abby":{"definition":"The girl who always has a good time. The girl who is always making people laugh, and who is easily loved. The girl who is beatiful on the inside and the outside. The girl has slammin hips. The girl whose dedicated, and has a rockin family. The girl who is the best best friend ever, amazing all around!!","time":1444323702142},"uselesscunt":{"definition":"A term to describe someone who is completely useless.<br /><br />Derived from the terms &quot;useless - anything that has little or no use&quot; and &quot;cunt - usually a derogatory term for a woman&quot;.<br /><br />Used together the term is not gender specific, applies both to the male or female sex.  Generally not applied as a anatomical term. ","time":1444323717129},"cy":{"definition":"A handsome, amazing, one-of-a-kind man that gives the love of his life everything she could possibly want and then some. Kind, caring, loving, pleasing, athletic, beyond attractive, and perfect are only a tiny few adjectives to describe him. The woman who has his heart is the luckiest woman on the earth.","time":1444323876550},"fml":{"definition":"means Fix My Lighthouse. Back in the 17th Century, lighthouse keepers were tthe butt of everyone&apos;s jokes. When a lighthouse keeper was made fun of, his retort would be &quot;why dont you fix my lighthouse!&quot; which was shortened over time to FML. This term was made famous in the great battle of the Sole Bay in 1902 where 14 peolpe died and 1 person broke their glasses.","time":1444325818748},"cock":{"definition":"The male reproductive organ.  Used as a secondairy brain at times.","time":1444325896309},"bokunopico":{"definition":"During summer vacation, Tamotsu is on break from work happens to visit a particular café. It is at this café that Tamotsu meets Pico, who works there for his grandfather. Tamotsu instantly falls for Pico, believing that Pico is a girl because of his feminine appearance. However, to his disbelief, Pico claims he actually is a guy. Undeterred, Tamotsu pursues a sexual relationship with Pico, to an extent where he even persuades Pico into wearing girl clothes. When Pico asks what is he to Tamotsu, he finds himself unable to answer...","time":1444326563771},"supper":{"definition":"An old-fashioned term for a meal eaten late in the day, usually reffered to nowadays as dinner.","time":1444327338604},"rotan":{"definition":"the place where steven ritchie came and messed up. the place where the loser (steven ritchie) made an annoying place to live. the place where the band sucked because of steven ritchie. the place where steven ritchie got wedgies everyday and no one cared about him because he was a loser and a liar and couldn&apos;t understand that he was a man whore. the place where he left and now it&apos;s not like that anymore.","time":1444327442403},"bukkake":{"definition":"1. noun Variety of fetish that involves repeated ejaculation on a female by many (8 will do) men.<br /><br />2. verb  To ejaculate on something, especially repeatedly","time":1444327584040},"gayporn":{"definition":"The best damn porn ever!","time":1444327598843},"nigger":{"definition":"A fully grown niglet","time":1444327611478},"teletubby":{"definition":"Four uh... things that live in Teletubbyland, a beautiful astro-turf consisting of green trees, gossipy flowers, and large, brown rabbits. The four teletubbies&apos; names are Tinky-Winky, Dipsy, Laa-Laa, and Po. They all live in futuristic domehouse with a vacuum cleaner named Noo-Noo, and all of the tubby custard and tubby toast they could ever want.<br /><br />Tinky-Winky: Tinky-Winky is a male teletubby and is purple in color. He is the largest of all of them. He has an upside-down triangle antenna on his head and carries around a cute little red clutch purse. Tinky-Winky may or may not be homosexual. His song goes &apos;Tinkle Winkle, Tinky-Winky, Woo woo woo woo woo...&apos;<br /><br />Dipsy: Dipsy is a male teletubby and is lime green in color. He is second largest of them all. His antenna is straight (like a dipstick... get it?) and he normally wears a [rad] cow-spotted top hat. He hates cute shit. His song goes &apos;bum tre bum bum tre bum&apos;<br /><br />Laa-Laa: Laa-Laa is a female teletubby and is yellow in color. She is second smallest of them all. Her antenna is curly and plays with an orange ball she has absolutely no control over. She is a total girly-girl and a total chatter box. She is always giggling and never sad. Her song goes &apos;la la la la la la la la&apos;<br /><br />Po: Po is a female teletubby and is red in color. She is smallest of them all. Her antenna is a circle and likes taking ride on a scooter. Po is shy and may or may not be a communist. Her song goes &apos;po po po po po po po&apos;<br /><br />Noo-Noo: Noo-Noo is a genderless vacuum cleaner with a mind of its own. Noo-Noo is normally found in the tubby&apos;s house cleaning up after them.<br /><br />The Sun: The sun is just that... a sun. The only catch? The sun has a baby&apos;s face! The baby sun likes to look down on the teletubbies and laugh at them.","time":1444327613594},"sex":{"definition":"What kind of moron are you that you look up sex in the urban dictionary?","time":1444327627432},"bacca":{"definition":"rolling tobacco (UK). Used as [baccy], in the same context, interchangeably.","time":1444327628965},"echo":{"definition":"A copy of something. Unorginal. A joke that goes on and on and on and on and well u get the point. It is a needless excess in the world and adds nothing but obnoxious repeate. You want to be different so you name your kid Echo.","time":1444328936617},"serotonin":{"definition":"A neurotransmitter believed to regulate mood. [SSRI]&apos;s inhibit the reuptake of serotonin in the brain (leading there to be more serotonin left as a result), hopefully improving the mood.<br /><br />Personally, a good blast on the Codeine cheers me up more than any SSRI.<br />Perhaps it&apos;s my endorphine system rather than my serotoninergic system that is fucked.","time":1444329088733},"zeus":{"definition":"Zeus (Jupiter&#x2f;Jove), supreme ruler of the universe, originally god of thunder and the thunderbolt.","time":1444329412160},"lap":{"definition":"(n) A person&apos;s lap is defined as the tops of their thighs.<br /><br />When a person is sitting down, their lap is in a form such that another person can sit on it.<br /><br />When a person stands up, their lap still exists but is not in a usable form.","time":1444329464295},"encrypted":{"definition":"To describe a person that is confusing or difficult to work out or understand.","time":1444329524532},"rekt":{"definition":"Text for &quot;Wrecked&quot;, as sooo drunk you&apos;ve forgotten your name but can just about type a text to your mate whose missed called you","time":1444329534331},"methane":{"definition":"The stuff that comes out of your ass when you fart","time":1444330332928},"nb":{"definition":"abbreviation for nota bene: used to mark something as particularly important.","time":1444330472978},"desu":{"definition":"japanese for &apos;it is&apos;, often said at the end of sentences to seem cute or unwitting.","time":1444330928903},"jay":{"definition":"Someone who is a beast at everything he&#x2f;she does. Such as running barefoot on a muddy [cross country] course-or being beyond hot. ","time":1444331035282},"phantom":{"definition":"When a man has anal&#x2f;doggystyle sex with a chick facing a window then trades places with his buddy who is hiding in the room without the chick realizing. The guy then proceeds to go outside and wave at the chick who is looking out the window. She then asks herself &quot;If he&apos;s out there, who is fucking me?&quot;","time":1444331049944},"theta":{"definition":"the eighth letter of the Greek alphabet that looks like an easter egg","time":1444331054070},"tupid":{"definition":"A shortened version of stupid.","time":1444331087520},"hurrythefuckup":{"definition":"What one says to make someone work faster.","time":1444331172941},"patience":{"definition":"beautiful, amazing, the best person in the world, hot. Apparently yummy!","time":1444331187084},"fuckthat":{"definition":"A definite and unmistakeable &apos;No&apos;","time":1444331319903},"nm":{"definition":"Quite Possibly the most useless internet&#x2f;chat abbreviation known to man. &apos;nm&apos; can be short for one of two things, &apos;Never mind&apos; and &apos;Nothing much&apos;.<br />Commonly misinterpreted by users, the abbreviation can be harmful, even fatal.","time":1444331376767},"ay":{"definition":"A term used to catch someone attention when you don&apos;t know their name","time":1444331412903},"aye":{"definition":"Scottish way of saying yes.","time":1444331425662},"eye":{"definition":"If you need help figuring this out you need help.","time":1444331446133},"sadfaces":{"definition":"Something bad went your way","time":1444331652424},"men":{"definition":"Things With Penises who tell women anything just to get intercorse","time":1444331672718},"absolutelynothing":{"definition":"A phrase used by famous Youtuber [SwiftKarateChop] frequently; it has become his subscription headline and it is used in most of his videos.","time":1444331679208},"amazing!!":{"definition":"Something that is so wonderful, it is hard to find the words to match.  Something that makes your heart beat faster or your heart melt. Something that tops everything else, and always crosses your mind.","time":1444331854933},"mf":{"definition":"mf has 2 meanings, often used as:<br /><br />(i) Mother Fucker<br />(ii) My Friend<br /><br />definition (i) is more commonly seen in chatrooms; whereas definition (ii) seen in multiplayer games.<br /><br />if someone uses mf towards you, it&apos;s best to pretend you dont understand, so they will explain - either (i) or (ii). Since you dont want to just start insulting them.","time":1444331868099},"thefuck":{"definition":"Short for &quot;what the fuck?&quot;. Usually followed by question mark.","time":1444332162305},"scurvy":{"definition":"A dude with black gums whose teeth is falling out and has spots on his back. He might need Vitamin C, particularly from a lemon tree. Also written S ~ (S + curvy).","time":1444332208558},"ded":{"definition":"adj.  Ded is when you are dead from joy, hilarity, sexiness, or other great feelings as such.<br /><br />There is a large difference between ded and [dead].  Do not confuse the two.<br /><br />The verb form is &apos;deds&apos; or &apos;dedded.&apos;<br />","time":1444332275985},"troll":{"definition":"One who posts a deliberately provocative message to a [newsgroup] or [message board] with the intention of causing maximum disruption and argument","time":1444332292304},"nah":{"definition":"No.  &quot;Nah&quot; and &quot;no&quot; mean the same thing.  &quot;Nah&quot; is often followed by &quot;man.&quot;  As in &quot;nah, man.&quot;","time":1444332296911},"sike":{"definition":"The immediately preceding statement is false and was told to mislead.","time":1444332324496},"syke":{"definition":"Basicly street slang for pretending, used in place of &quot;playin&quot; or &quot;jokin&quot;","time":1444332332938},"=/=":{"definition":"1. ‘is\\are\\am not equal to’<br /><br />or<br /><br />2. ‘is\\are\\am not the same as’<br /><br /><br /><br />(See also: [&lt;], [&gt;], [=], [^])","time":1444332438671},"mewlingquim":{"definition":"An insult used by Loki in the Avengers movie which roughly translates into modern English as &apos;Whining Cunt&apos;.","time":1444332440578},"die":{"definition":"the process of no longer being alive.","time":1444332496551},"barnes":{"definition":"A gracious human bieng with big heart and thick skin. A brave warrior on or off a battle ground. A man complete for existence or a man too never forget.","time":1444332564785},"antwerp":{"definition":"a place where people walk slower than the rest of europe, talk funny dutch, and eat waffles. Best and prettiest trainstation in the world. Be sure to leave your high heels at home...deasly cobblestone roads","time":1444332571238},"minuterice":{"definition":"A reference to a car that is riced out enough that it may or looks like it may run a 60 second quarter mile.","time":1444332779339},"endoftheline":{"definition":"The place God sends people who want for nothing and are still cruel.  Not to be confused with the Last as in the last shall be first.  No, they want for nothing and care for nothing and that is what they are and what they will get.  Jesus is tired when he gets to them and says, &quot;some other time&quot;.","time":1444333158222},"wang":{"definition":"a) A very common Chinese surname<br />b) An ancient brand of computer systems<br />b) Penis, see [dong], [schlong], [dork], [johnson], [cock], [prick], [dick]","time":1444333180488},"spooderman":{"definition":"The meme based version of &quot;Spiderman&quot;, which follows closely to the dolan and gooby memes. Silly hijinks ensue whenever Spooderman is about.","time":1444333267339},"wew":{"definition":"A way to say wow in Filipino, common in online games.","time":1444333672891},"sanic":{"definition":"Sanic usually refers to ear rape or other forms of extremely loud spam. Derives from the YouTube video &quot;HOW 2 DRAW SANIC HEGEHOG&quot; in which the uploader draws an extremely mediocre Sonic the Hedgehog while a messed up version of music from the Green Hill Zone stage.<br />Spinoffs include &quot;HOW 2 DRAW MAREO BROTER&quot;, &quot;HOW 2 DRAW: HOMRE SIMSON&quot;, and &quot;HOW 2 DRAW LEFEND ZEDLA&quot;","time":1444333684602},"speculating":{"definition":"Assuming something before really knowing.<br /><br />","time":1444334967438},"slimshady":{"definition":"Eminem&apos;s alternate name....kinda, more like the &quot;evil&quot; side of Marshall. He blames Slim for everything that happens, with his family, and work, that happens that is bad. And in one of his most recent songs &quot;When I&apos;m Gone&quot; he &quot;kills&quot; Slim.","time":1444335665426},"madeout":{"definition":"How females refer to having sex with a guy the night before when they don&apos;t really want to admit it.","time":1444336186759},"makingout":{"definition":"open mouth kissing usually with tongue, and occasionally groping between 2 individuals.","time":1444336193124},"waddup":{"definition":"What is up?","time":1444337083566},"dxd":{"definition":"Vampire, [Goth], [Forum Whore], God type being from [deviantart]<br /><br />Manipulates pretty girls to looked fucked up. Abuses people via the forums and IRC but is generally harmless and friendly.","time":1444337101295},"blackbullet":{"definition":"Can of Rockstar Cola","time":1444337119246},"sao":{"definition":"Stands for an anime series known as Sword Art Online which was originally a Light novel written by Reki Kawahara.","time":1444337123235},"swordartonline":{"definition":"A japanese show, defined as Anime. A show where the characters (Some how are ALL from Japan) enter a game, known as Sword Art Online. When entering the game, shortly after, the creator of the game, Heathcliff, or whatever his actual name is, alarms them that if they die in the game, they die in real life.. The Game version of Freddy Krueger.","time":1444337128771},"lgi":{"definition":"Lets Get It!","time":1444337866299},"technician":{"definition":"Hardcore fan of Tech N9ne.","time":1444338069984},"nonk":{"definition":"this can mean anything you want it can be used as an insult or as a silly name to call someone<br /><br />nonk or nonkette","time":1444338076430},"booty":{"definition":"1. pirate treasure, plunder or other ill-gotten gains<br /><br />2. butt, ass, specifically female posterior<br /><br />3. sex, screwing<br /><br />4. crap","time":1444338701114},"alpha":{"definition":"The head animal in a pack, and by extension, an unofficial leader.  Often used sarcastically of someone who wants to lead a group.","time":1444338740346},"shofu":{"definition":"A real Nigger","time":1444338763002},"scp":{"definition":"Secure Contain Protect . SCP is a large organization created to keep &apos;creatures&apos; from affecting human life. The current location of SCP Foundation is currently unknown and is said to be in Area 51. Safe (non-harmful), Euclid (unknown species and hard to classify), and Keeter (harmful to human life) &apos;beings&apos; exist and are said to not leave anyone of the organization camps around the world. There are said to be currently 5000 SCP Creatures around the world and have yet to be found.","time":1444338826154},"scp173":{"definition":"Commonly known as the first SCP, SCP-173 is a Euclid class living statue made of concrete, rebar, and traces of Krylon brand spray paint. No, the object does not copy the Weeping Angels as 173 came out 1 year prior.","time":1444338844464},"french":{"definition":"a language that, if spoken, will get you more pussy than you can imagine","time":1444339004494},"beast":{"definition":"UK Slang- a person who is very good at something","time":1444339005131},"kg":{"definition":"The act of licking the sensitive area between the ball sac and the anus.","time":1444339009551},"english":{"definition":"a language that lurks in dark alleys, beats up other languages and rifles through their pockets for spare vocabulary","time":1444339010120},"void":{"definition":"1.empty<br />2.hollow<br />3.as in 4 dimensional(bigger on the inside than on the outside)","time":1444339015247},"andrewgarfield":{"definition":"Very talented British actor who played a guy called Tom in Sugar Rush (which was well funny btw) VANESSAAAAA!! Will become very popular soon due to him being cast as Peter Parker&#x2f;Spiderman in the new Spiderman re-boot. His other name is THE GRAVIY MAN due to his hair defying gravity (like the song from Wicked). The gravity man is cool!","time":1444339017335},"excusemyfrench":{"definition":"Also &apos;Pardon my French.&apos; Phrase mumbled insincerely immediately after or before one swears a blue streak within earshot of the elderly, the young, or the simply uptight.","time":1444339020533},"ma'am":{"definition":"A shortened version of the word [madam], which was formally used when addressing [women] in the days when etiqute and common curtesy were commonplace.<br /><br />The term Ma&apos;am is often coupled with the word No, to create the phrase &quot;No Ma&apos;am&quot;, which flows off the tounge very well if you have a Southern US accent.","time":1444339772269},"trump":{"definition":"trump is a stupid-ass-haircut that looks like shit.","time":1444340058470},"donaldtrump":{"definition":"Living proof that money can&apos;t buy good hair.","time":1444340064754},"faptastic":{"definition":"Said when you see a hot girl (or even just a picture) that makes you want to [drop and unload]. Can also be used as an adjective for a hot girl. Also see [fap].","time":1444340084316},"fap":{"definition":"The onomatopoeic representation of masturbation.  Often used to suggest that something is attractive.","time":1444340096327},"dropandunload":{"definition":"To drop your pants, masturbate, and end with orgasm.","time":1444340115825},"cynthia":{"definition":"Cynthia&apos;s are often shy people, but once your get to know a Cynthia they are one of the most loyal and friendly type of people you would ever be lucky enough to meet. Cynthia&apos;s love to talk but are often quiet to listen to their friend&apos;s problems. Cynthia&apos;s do not like sports, and are often too worried about life once but once you get to know a Cynthia you will see little by little that they let loose and have fun. Cynthia&apos; s are often known by there sad looking eyes and that gloomy look on there face, often they have dark hair and a pale dead like face because they are after all named after the goddess of the moon, and like the moon you will soon see their pale beauty and mysterious personalty, know as the invisible girl, a Cynthia can be a great leader,but is always ready to be a team player.<br /><br />By Kevin  ","time":1444340142168},"backtoback":{"definition":"consecutive - one after the other - successive","time":1444340188158},"meekmill":{"definition":"best rapper in the world representin philly,hes in his bag right now","time":1444340195368},"chuggaaconroy":{"definition":"A 20 year old Floridan YouTuber who invites people to play games by saying &quot;Let&apos;s Play [game name]&quot; despite the fact that the game can only be played by him as it is a recording. A more approriate name would be Watch&apos;me Play [game name].  He is also the founder of &quot;Nintendo Logic&quot; brought to you by Chuggaaconroy.  His real name is Emiliano Rodolfo Rosales-Birou.","time":1444340264785},"lotus":{"definition":"the sexual position to which both are sitting, facing each other, with legs crossed behind their partner...","time":1444340281397},"onfleek":{"definition":"the quality of being perfect, or [on point] i.e. Zayn Malik","time":1444340320578},"hu":{"definition":"Hu is the abbreviation of hooking up. It was at first used online but now it is said.","time":1444340335494},"slore":{"definition":"The combining of a &quot;slut&quot; and &quot;Whore&quot;. Usually in terms of a real trick ass bitch, who can&apos;t keep dick out her mouth&#x2f;puss&#x2f;rectum.","time":1444340438086},"torii":{"definition":"The most beautiful female you will ever lay eyes up.  A lovely caring person who is amazing in bed, brilliant at [blow-jobs] and loves the taste of [cum]","time":1444340464428},"mindbreak":{"definition":"The point where the receiving end (more often female then male) experiences such a high degree of [sexual pleasure] their mind goes into a state of severe stupor. In this state they would lose the ability to think clearly and register information such as pain. Often those in the &quot;mind-break&quot; state unconsciously make an [ahegaokin] face. It should also be noted that &quot;mind-breaks&quot; happen most frequently during [rape] and [gang-banging] scenes.","time":1444340480846},"jeremy":{"definition":"A named based on the biblical name Jeremiah. Used as a name for children who are blessed with a large brain and&#x2f;or penis. Also used as a replacement for &quot;perfect&quot;.","time":1444340488300},"whori":{"definition":"Whori is a usually a girl named Tori. She&apos;s soo much of a wanna be whore that it&apos;s inevitable she will be one in the future. Even if a girl&apos;s name isn&apos;t Tori, as long as she&apos;s a wanna be whore she can be given the name &quot;Whori&quot;.","time":1444340515904},"pfft":{"definition":"1.An expression of a lack of interest in another persons comment<br />2.Used to look down upon another","time":1444340518222},"jon":{"definition":"Jon Short For [Jonathan] Meaning Gift From [God]....also known as a [sex GOD] ... Jonathan is a nice, well respected person and gets what he wants. Cares for his [Girl friend] and his close friends (they&apos;re basicly family). Jonathan Also Cares For His Family Sooo Much. <br />you can Spell It<br /><br />Jonathan<br />Johnathan (gay Verison)<br />Jon<br />John (gay version)","time":1444340534554},"jerb":{"definition":"A job belonging to a redneck","time":1444340552559},"drix":{"definition":"the act of consuming dextromethorphan, or dxm, (ingredient in cough syrup) for the purposes of tripping.  it comes from Drixoral (now called Dexalone), a pill for coughs that contained only dxm in large doses.","time":1444340563984},"azazel":{"definition":"Angel who alligned with Satan<br /><br />The whole earth has been corrupted through the works that were taught by Azazel: to him ascribe all sin. ” <br />  — 1 Enoch 2:8 <br /><br />According to 1 Enoch (a book of the Apocrypha), Azazel was one of the chief Grigori, a group of fallen angels who married with female humans. This same story (without any mention of Azazel) is told in Genesis 6:2-4:<br /><br />&quot;That the sons of God saw the daughters of men that they were fair; and they took them wives of all which they chose. […] There were giants in the earth in those days; and also afterward, when the sons of God came in unto the daughters of men, and they bore children to them, the same became mighty men which were of old, men of renown&quot;. <br />1 Enoch portrays Azazel as responsible for teaching humans to make weapons and cosmetics, for which he was cast out of heaven. 1 Enoch 2:8 reads:<br /><br />&quot;And Azazel taught men to make swords and knives and shields and breastplates; and made known to them the metals [of the earth] and the art of working them; and bracelets and ornaments; and the use of antimony and the beautifying of the eyelids; and all kinds of costly stones and all colouring tinctures. And there arose much godlessness, and they committed fornication, and they were led astray and became corrupt in all their ways&quot;. <br />The corruption brought on by Azazel and the Grigori degrades the human race, and the four archangels (Michael, Gabriel, Raphael, and Uriel) “saw much blood being shed upon the earth and all lawlessness being wrought upon the earth […] The souls of men [made] their suit, saying, &quot;Bring our cause before the Most High; […] Thou seest what Azazel hath done, who hath taught all unrighteousness on earth and revealed the eternal secrets which were in heaven, which men were striving to learn.&quot;<br /><br />God sees the sin brought about by Azazel and has Raphael “bind Azazel hand and foot and cast him into the darkness: and make an opening in the desert — which is in Dudael — and cast him therein. And place upon him rough and jagged rocks, and cover him with darkness, and let him abide there forever, and cover his face that he may not see light.”<br /><br />Raphael&apos;s binding of Azazel on the desert rocks of Dudael in upper Egypt appears again in the Book of Tobit, which is found in Catholic and Orthodox bibles, but not in Jewish or most Protestant bibles. In that Book (the only place in Christian bibles where Raphael appears) he accompanies the young man Tobias (Tobit) on his perilous journey to marry his cousin Sarah, whose seven previous husbands had been killed on her wedding night by the demon Asmodeus. Raphael saves Tobias from the same fate by showing him how to deal with that demon, too.<br /><br />Azazel’s fate is foretold near the end of 1 Enoch 2:8, where God says, “On the day of the great judgement he shall be cast into the fire. […] The whole earth has been corrupted through the works that were taught by Azazel: to him ascribe all sin.&quot;<br /><br />In 3 Enoch, Azael is one of the three angels (Azza (Shemhazai) and Uzza (Ouza) are the other two) who opposed Enoch&apos;s high rank when he became the angel Metatron. Whilst they were fallen at this time they were still in Heaven, but Metatron held a dislike for them, and had them cast out. They were thenceforth known as the &apos;three who got the most blame&apos; for their involvement in the fall of the angels marrying human women. It should be remembered that Azael and Shemhazai were said to be the leaders of the 200 fallen, and Uzza and Shemhazai were tutelary guardian angels of Egypt with both Shemhazai and Azael and were responsible for teaching the secrets of heaven as well. The other angels dispersed to &apos;every corner of the Earth&apos;.<br /><br />Another strange passage in 3 Enoch states that while the bodies of the angels would burn and die &apos;their souls would be with God&apos; and the water would turn to ice &apos;which would be for their healing&apos; though they did not know it. It should be remembered angels are made of fire.<br /><br />","time":1444340566805},"laid":{"definition":"to be fucked.","time":1444340581634},"commander":{"definition":"The lucky bastard who will be trying  to pickup the hottest girl in a group. Always accompanied by a [wingman] or two who are designated to engage the hot chick&apos;s ugly&#x2f;bitchy&#x2f;annoying friend(s).","time":1444340592139},"brett":{"definition":"An extremely attractive American male who is good at everything.  Often can be found in beautiful women&apos;s beds.","time":1444340605539},"ace":{"definition":"Excellent! Very good!(Australian slang) ","time":1444340652362},"phoenix":{"definition":"The capital of the state of Arizona and 4th largest city in the United States of America.","time":1444340659680},"pink":{"definition":"slang reference to the vagina","time":1444340660890},"insanity":{"definition":"Doing the same thing over and over and expecting a different result.","time":1444340703533},"buzzkill":{"definition":"Something that spoils or ruins an otherwise enjoyable event, esp. when in relation to ruining a drunken or drug-induced high.","time":1444340710273},"jolly":{"definition":"Term refering to one&apos;s pleasure related to a subject.<br /><br />See Example.","time":1444340822328},"pi":{"definition":"The transcendental number which refers to the definition (in which it is multiplied by the radius of a circle) of the area of the circle.  (or if multiplied by the diameter, defines the circumfrence).","time":1444340869351},"oi":{"definition":"Cockney slang for &quot;hey&quot;. Also a british style of music, named so after the band Cockney Rejects who first used it in their lyrics, although Sham 69 was the first Oi! band. (not correct without an exclamation mark!)","time":1444341007067},"jellu":{"definition":"meaning jealous.","time":1444341041419},"jelly":{"definition":"Being jealous, or hating","time":1444341056233},"salt":{"definition":"Acronym for Smiled A Little Then Stopped coined by DeRay Davis","time":1444341219336},"gijoe":{"definition":"The All American Hero.","time":1444341328003},"australia":{"definition":"The best fuckin&apos; country in the world, Australia, is also the only place where Christ could never have been born, as in Australia, you cannot find 3 wisemen and a virgin.","time":1444341365078},"zong":{"definition":"A bong with its tube in the shape of a Z","time":1444341610395},"chingchong":{"definition":"The only word arrogant non-Asians think all Asians say. ","time":1444342174992},"cero":{"definition":"truly elite member of the chan #gtfo on efnet. phear him.","time":1444342516326},"halo":{"definition":"1. without this game most guys would spend most of their time masturbating<br />2. code word: group, all male, masturbating. <br />3. electronic circle jerk, multiguy mission.","time":1444342789931},"halo3":{"definition":"The leading cause of divorce in America.","time":1444342802576},"halo2":{"definition":"A game that is ironically fun to play even though all it takes to win is to be a pussy and camp with the sword, rocket launcher, sniper rifle, or any combination of the two, AND considering alot of people who play online are whiney bitches who make lame-ass excuses everytime they lose","time":1444342806953},"halo1":{"definition":"The man&apos;s version of HALO from back in the good old days before dual SMG&apos;s and cluttered maps ruined the game of the gods.","time":1444342825415},"halo4":{"definition":"The upcoming installment in the famous Halo series. Many never thought they&apos;d see the day this game was announced.  The game is being developed by 343i. A company compiled of ex [Bungie] employees who helped create Halo.  The games first trailer came out on June 6, 2011  feature=inbox","time":1444342841113},"halo5":{"definition":"The 5th installment of the [Halo] series, and the second in the new trilogy. Though it hasn&apos;t been released, probably has not been worked on, or even been officially confirmed, 343 Industries said [Halo 4] would be the first in a new trilogy. Trilogy means 3.","time":1444342856091},"halo6":{"definition":"The 6th installment of the [Halo series] and the 3rd in [343 industries]&apos; new [Halo trilogy]. This game has probably not been worked on, has not really been announced, and is not coming out for at least 3 years (though this is not likely because there are usually 3 years before each new [Halo] game and Halo 4 isn&apos;t even being released this year).","time":1444342866333},"halo7":{"definition":"The 7th and last installment of the Halo trilogy. Set to come out the summer of 2012.","time":1444342868991},"halo8":{"definition":"The eighth installment of a videogame series that keeps gamers from having girlfriends and any sexual urges.","time":1444342878863},"lax":{"definition":"an abbreviation of lacrosse.  also makes you sound l33t.  can also be mistaken for laxative","time":1444342900060},"terrorist":{"definition":"WHITE PEOPLE, who steal other peoples lands and resources and enslave and kill them---mentally and physically. These resources include the Arts of Civilization and include the 9 major areas of people activity: Economics, Education, Entertainment, Labor, Law, Politics, Religion, Sex, and War.","time":1444342945760},"juju":{"definition":"Gypsie word for luck.  More commonly used as &quot;bad juju&quot;.","time":1444342974001},"chrissycostanza":{"definition":"Awesome vocalist of the band named Against the Current.  - Somebody as pretty as a phoenix biting a rose","time":1444343173748},"suckysucky":{"definition":"[Fellatio]. Obtainable in Vietnam for ten dolla, or possibly five dolla if you can haggle it down. The prostitutes love you long time for ten dolla, boom boom long time.*<br /><br /><br />*Not applicable to those deemed muy beaucoup.","time":1444343228864},"afr":{"definition":"AFR = Accidental Fecal Release<br />Term used by lifeguards to refer to floating poop in a pool.","time":1444343680892},"mangle":{"definition":"1. At an angle, a woman&apos;s face looks like a man. Besides the angle(s), she is hot.  2. When looking at a chick from an angle (could be multiple angles), her face resembles those characteristics of a man.","time":1444344009067},"mutilate":{"definition":"To cut down your own parts of your body.","time":1444344015487},"proofs":{"definition":"R.I.P. Proof, friend of Mr Mathers, rapper in D-12, was shot and died in the early hours of Tuesday morning on April 11th 2006. May he rest in peace.","time":1444344809300},"lmwo":{"definition":"Laughing my wazoo off","time":1444345150264},"quick":{"definition":"1. To climax extremely fast. To come in a short period of time.<br />2. A nickname for someone who the above regularly happens to.","time":1444345150442},"aquatic":{"definition":"Hydro-ponically grown marijuana.","time":1444345159587},"wod":{"definition":"An abbreviation of Word Of the Day","time":1444345198852},"eroge":{"definition":"An ergoe, (erochikku gēmu) is a Japanese video or computer game that features erotic content, usually in the form of anime-style artwork.<br /><br />In English, eroge are often called hentai games in keeping with the English slang definition of hentai. This is sometimes shortened to H games.<br /><br />In Japan, eroge are also referred to as 18+ games","time":1444345212107},"tauros":{"definition":"Tauros, a pokemon that is as rare as shit. It appears in the safari zone and other places.","time":1444345592280},"blaziken":{"definition":"A word used to describe the activity of smoking marijuanna. Blaziken was derived from the term the Pokemon character &quot;Blaziken&quot; and inspired by the popular pot smoking slang &quot;blazing&quot;","time":1444345664687},"venusauring":{"definition":"Verb  The act of covering your penis in whatever your lover is allergic to and fucking her. Afterwards, it is customary to slap her face with your dick and scream &quot;You do not have enough badges to train me.","time":1444345677370},"scyther":{"definition":"A bug-flying type [Pokemon] who has a high attack stat. Evolves into [Scizor] when traded while holding the item, &quot;Metal Coat.&quot; It attacks with it&apos;s scythe-like arms.","time":1444345684810},"lucario":{"definition":"A pokemon that was cloned from a fusion clone machine. Lucario is a mix of Chuck Norris and a wolf. It is said that it truly only kicks ass because of his aura. Its aura is a powerful mistic blue crimson explosion of lights expanding through out the skys. Regigigas is its rival for a while they hated each other. Also when in contact with a Pikachu, Lucario tends to kick it in the balls.","time":1444345693424},"eevee":{"definition":"Cute little Normal type [Pokemon] that looks like a puppy. Eevee can evolve into the following five Pokemon by using the methods below:<br />1: [Vaporeon]-water stone<br />2: Jolteon- thunder stone<br />3: Flareon- fire stone<br />4: Espeon- get it to evolve from happiness during the day<br />5: Umbreon- get it to evolve from happiness during the night","time":1444345696011},"beedrill":{"definition":"Beedrill, known as the Poison Bee Pokémon, are fully-developed, hornet-like Pokémon that have hatched from their pupal Kakuna forms. Although they are hornet-like, they only have four legs. The first two are tipped with long stingers. It has veined wings, and another stinger on its abdomen in which it holds its most powerful poison. Beedrill are extremely territorial, and will be set off by anything that approaches a Beedrill nest. When angered, Beedrill attack in a furious swarm, and the sharp ends of their stingers and the poison stored in their abdomens will definitely be put to use.","time":1444345704388},"pandaing":{"definition":"Verb.<br />To cut someones lunch (see[cut lunch]) while they are eating it or after they have eaten it.<br />See [Pandaed]","time":1444345783814},"pandering":{"definition":"A manipulative device used by politicians to agree and support the popular view of a particular group or groups of people in order secure their vote. Although the philosophy or interest of this particular politician is not necessarily in tune with that particular group, he or she will appear as though he or she agrees with a particular group, particularly during the election season, in order to win his&#x2f;her sear.  The interest of particular groups may be somewhat farfetched, including creating Utopia&apos;s for them to live in or to achieve the so called &quot;rainbows&quot; and &quot;butterflies&quot; they so want to have. But, if that is what the educated politician has to agree with in order to win on election day, then he&#x2f;she will do it.","time":1444345791922},"matate":{"definition":"Spanish for &quot;kill your self&quot;","time":1444346005525},"colgate":{"definition":"Small liberal arts college located in Hamilton, New York.  It has NO affiliation with Colgate-Palmolive, it is not a dentistry school.  The general concensus on its academics and athletics is &quot;kick-freakin-ass&quot;.  So many hot girls you&apos;ll want to break down and cry, indeed, many incoming freshmen do.  Downside-Damn near the most expensive education you can get, and no academic scholarships.","time":1444346015448},"pale":{"definition":"The best fucking skin color for white&#x2f;asians in the world, makes a lot of girls a lot more attractive than they normally would be when they have it, providing they&apos;re mildly attractive in the first place. Can also make girls look worse, but the good outweighs the bad.<br /><br />In Hong Kong, China, it&apos;s looked upon as a status symbol to have milky white skin, sometimes in Japan too. Women buy skin whiteners to have their skin whiter, and go to lengths to have white skin. It&apos;s like the opposite of the USA.<br /><br />In the USA, it&apos;s looked down upon for whatever reason, probably the influence of pop culture. A scrawny tanned boy is seen as innocent, where a scrawny pale boy is looked down upon heavily in the USA by some people.<br /><br />Pale skin was also looked upon as beautiful by early cultures, like in the 16th century, and in early Roman cultures.<br /><br />I have seen pale Mexicans, Asians, and Whites. Black women can&apos;t get pale, but they look beautiful with their natural colors anyway.<br /><br />If Sir Mix-A-Lot could make a statement saying how he liked big butts, then people can certainly make a statement about their pale skin, to make it less looked down upon for both males and females. We need less tan lines.<br /><br />If you are someone who makes fun of it, then stop being so ridiculous because you already have a buffet of people that fit your choices anyway. If you have pale skin yourself, then don&apos;t change it and stick up for yourself at all costs. It&apos;s something to be proud of.<br /><br />Get with it, pale skin is in.","time":1444346306350},"tilted":{"definition":"Drunk, buzzed, or faded.","time":1444346421263},"catcall":{"definition":"When a guy gives the [wert whirl] whistle or yells at a [babydoll] for the purpose of getting attention and in hopes of a future [hookup].  This is usually done out of the window of a car.  Typically a Pontiac Firebird, or Camaro.<br /><br />99.9% a [hookup] never arises and it&apos;s just the thrill that keeps these going.","time":1444346602495},"deflower":{"definition":"The act of taking the virginity of a girl. The term comes from the fact that the hymen, before being torn, most frquently looks like an inverted flower.","time":1444347213455},"pegs":{"definition":"A term coined by sex advice columnist Dan Savage that refers to an act of love making that involves a woman with a strap-on dildo anally penetrating her male partner.","time":1444347284110},"raucous":{"definition":"Adj. rude, discusting, unexpectedly so. Highly abrasive in personality or looks. Repulsive.<br />","time":1444347415161},"cyb3r":{"definition":"An [l33t] [ownzorian] counter strike player!","time":1444347802919},"cyber":{"definition":"Online sex that loners engage in if they are too ugly and boring to get a real boyfriend&#x2f;girlfriend.","time":1444347810514},"squirm":{"definition":"The [feeling] a [female] gets when they&apos;re really [turned on]. Not up near their [belly button], but lower. Definitely in the [vagina]. None of this [butterflies] up by the [belly button] business. We&apos;re talking serious, I need it now, no fooling around business. [Wet].  Or, the feeling a guy gets when he&apos;s so [turned on] that he has to [stick it in] or [bop the baloney] before something bad happens. [Sex hungry].","time":1444347937156},"paradox":{"definition":"a statement that appears to be self-contradictory but may actually be true","time":1444348106333},"god":{"definition":"A guy who talked to some Jewish guys, some Christian guys, and some Islam guys, and accidentaly caused more people to die than anyone else in human history.","time":1444348328434},"wreath":{"definition":"A Holiday Term For Marijuana-Pot, The Word Spoken Aloud Sounds Like A Shortened form of Marijuana&apos;s Nickname, Reefer.","time":1444349345574},"exalted":{"definition":"At a state of being undeniably [awesomer] then others.","time":1444349455821},"idgaf":{"definition":"An acronym for &apos;I don&apos;t give a fuck&apos;.<br /><br />-Indifference<br /><br />Used when you don&apos;t care about something, or have no opinion on a matter.<br /><br />Sometimes used without the &apos;i&apos;, ie &quot;I dgaf about her&quot;.","time":1444350230666},"heaven":{"definition":"A place that seems to get further and further away as humans&apos; scientific knowledge improves.","time":1444350434096},"nyet":{"definition":"the word &quot;no&quot; in russian","time":1444350570177},"kinky":{"definition":"Foot-sucking, rubber wearing, pee on me, fruit-fuckin&apos;, candlewax drippin&apos;, long fingernail scrapin&apos;, tossed salad eatin&apos;,multiple partner havin&apos;, she-male, oil-drenched, chocolate sauce, whipped cream covered,vibrator usin&apos;,dress-up,banned in 30 states type of sex.","time":1444351190824},"thep":{"definition":"&quot;The P&quot; is the a mythical place where legends are born&#x2f;raised&#x2f;or created. The population consists of 35% whites, 15% blacks, 25% Hispanics, and 25% ninjas.  The dos equis Most Interesting Man in the World was kicked out of plantation for being boring.  It is said that &quot;The P&quot; was founded after a seven year Seminole War. That is false. Plantation was founded when Chuck Norris punched the ground. A Prandtl–Glauert singularity formed around his mighty arm. The impact was so great it created multiple shock waves in the air and on the ground. The broward mall was formed followed shortly by university Drive. The rest was created 50 years later.  Apparently students from the graduating classes 2002-2006 at St. Thomas Aquinas and South Plantation high schools can trace their linage back to Achilles, King Leonidas, Attila the Hun, Hercules, Helen of Troy, Cleopatra, and Dumbledore.","time":1444351364062},"lowkey":{"definition":"to keep something low key: to not announce it; to have a quiet gathering; opposite of a large party or big group of people; not much emphasis, closely aligned with a normal night out doing the usual stuff.","time":1444352584867},"ronjeremy":{"definition":"a man who gets more ass then a toilet seat","time":1444352674608},"gfy":{"definition":"Could mean either &quot;Go fuck yourself&quot; or &quot;Good for you&quot;. Either one works quite effectivly.","time":1444352788333},"alexistexas":{"definition":"A very hot female [pornstar] with a large, delicious juicy [ass]. She is one of the rare white girls with a true ghetto [booty]. ","time":1444352802728},"nothing":{"definition":"Actually means &quot;something,&quot; but is used when you don&apos;t feel like explaining.","time":1444352908221},"shade":{"definition":"acting in a casual or disrespectful manner towards someone&#x2f;dissing a friend","time":1444353009815},"xanadu":{"definition":"A song about an ice mountain paradise by the band Rush.","time":1444353260014},"ice":{"definition":"1)- Frozen water, used to cool drinks or for medical healing during athletic competition<br /><br />2)- Expensive jewelry, usually in the form of diamonds that is worn in either necklace, ring, chain, or earrings<br /><br />3)- To kill or murder someone<br /><br />4)- Methamphetamines, illicit street drugs","time":1444353645629},"bars":{"definition":"[xanax] bars, prescription pill, makes you feel drunk, tired, and all you can think bout is pussy.","time":1444353884907},"bitches":{"definition":"(1) Word used to describe the act of whining excessively.<br /><br />(2) Person who rides specifically in the middle of a front-seatting only car meant for 2 passengers or less.<br /><br />(3) Modern-day servant; A person who performs tasks for another, usually degrading in status.<br /><br />(4) Term used to exclaim hardship.<br />","time":1444353889013},"fappy":{"definition":"A feeling of emotion; in the mood to [fap], or masturbate.","time":1444353913734},"fapper":{"definition":"Some one who [masturbates] all the time.","time":1444353918699},"fappie":{"definition":"Person who [masturbates] a lot to porn; usu. porn involving tentacles and small children.","time":1444353922674},"hr":{"definition":"Human Resources.  A non-value added component of many large companies.  Human resources is a worthless division in a company that often has power beyond its members&apos; level of intelligence.  Human resources generally spends most of its time justifying its existence.","time":1444354441228},"splatoon":{"definition":"The latest Nintendo IP, &quot;De Blob&quot; meets &quot;Team Fortress 2&quot;. A currently unreleased multiplayer shooter where players control squid-children called Inklings, spraying colorful ink all over a battlefield to control as much territory as possible. Currently has a metric ton of fan art, most of it pornographic in nature. Single-handedly convinced a large number of people to consider buying a Wii U. Also, its art style is so, so 90s.","time":1444354595779},"iirc":{"definition":"abbv for If I Recall Correctly","time":1444354933862},"cesar":{"definition":"Basically the most awesomest guy in the fucking world. Whenever you think about something that has to do with sex, drugs, alcohol or just any kickass thing that ain&apos;t no pussy shit. The first person that comes to mind is Cesar...<br /><br /><br />Theres too much to say about Cesar so the best definition for Cesar is God because he is God!!! no, no, fuck that, he&apos;s way better than God, there is no word that can describe&#x2f;define Cesar... <br /><br />THERE IS NO DEFINiTION FOR CESAR<br /><br />","time":1444355214945},"purge":{"definition":"A massive, often liquid shit which absolutely stinks and leaves the perpetrator with a burning sensation, known as a &apos;ring of fire&apos;, around the anal sphincter.","time":1444355442206},"crikey":{"definition":"An Australian exclamation of surprise or bewilderment. Interchangeable with words such as &quot;Blimey&quot; or &quot;Struth&quot;. Made famous by our champion crocodile hugger, Steve Erwin.","time":1444355775363},"blimey":{"definition":"blimey  Barrère and Leland&apos;s A dictionary of slang<br />by Arthur Morrison  1 exclamation - god blind me. something surprising enough to make one wish they were blind so that they cant see such things.  2 also used as an extra offensive version of [limey]. it&apos;s extra offensive because british are always so down on americans and our love of slang. basically blimey is a thumb in their eye that they have no ground what-so-ever to stand on to justify their inborn doochbaggetry nature.","time":1444355784846},"ffs":{"definition":"Acronym for, for fuck&apos;s sake.","time":1444355982074},"nerd":{"definition":"One whose IQ exceeds his weight.","time":1444356000917},"fu":{"definition":"short for f**k you.","time":1444356261522},"fufu":{"definition":"Fake, not real, not genuine","time":1444356264818},"invaderzim":{"definition":"It was Nick&apos;s last hope.","time":1444356657464},"agk":{"definition":"Short for [Angry German Kid]","time":1444356889742},"gdk":{"definition":"Fuck a bitch ass GD. Means &quot;killa of GD&quot;","time":1444356896244},"bdk":{"definition":"&quot;BDK&quot; (Black Disciple Killers) also known as &quot;GD&quot; (Gangster Disciples) is a gang in Chicago. Rappers such as Lil Jay, P. Rico and Lil JoJo who was shot and killed at the age of just 18 by the Black Disciples, are affiliated with the gang. The gang is also known as BrickSquad, FBG (Fly Boy Gang), and Tooka Gang after fallen member Shondale &quot;Tooka&quot; Gregory  The Black Disciples, also known as GDK for &quot;Gangster Disciple Killers&quot;, are a rival gang to the Gangster Disciples, thats why they call them selves the Black Disciples &quot;KILLERS&quot;!  You probably think you dont know anything about the Black Disciples, but they are a lot more popular then you think.<br />If you listen to rappers such as Chief Keef, FredoSantana, Lil Reese, SD, and Tadoe then you should have some idea of what the Black Disciples are. Chief Keef and his crew are a part of the #300 set of the Black Disciples. Rappers such as RondoNumberNine, Edai and L&apos;A Capone who has also been shot and killed at a very young age for dissing a fallen member of rival gang BrickSquad, Shondale Gregory, are part of the #600 set of the Black Disciples. These two sets have very few beef with each other, if any, and rappers from both sets collaborate with each other to make songs.","time":1444356899637},"e4":{"definition":"the most popular opening move in chess where the pawn immediately in front of the king moves two spaces forward.<br /><br />it immediately gains control of the center and also frees the queen and king&apos;s bishop. at the same time, it places a pawn on an undefended square and weakens d4 and f4.<br /><br />a response of 1...e5 results in an open game.","time":1444357023979},"rmt":{"definition":"noun: Real Money Trading","time":1444357220287},"og":{"definition":"Original gangster","time":1444358023253},"wb":{"definition":"welcome back","time":1444358028195},"flitter":{"definition":"The famale part, labia majora (lips).","time":1444358913732},"flutter":{"definition":"British term for placing a bet on something.","time":1444358941749},"brush":{"definition":"To beat the hell outta someone; to hit, slap, kick; to mess someone up","time":1444359235971},"hi":{"definition":"The word that always appears everytime I open up Editor Chat","time":1444359261886},"docking":{"definition":"The act of placing the head of ones penis inside the foreskin of another&apos;s penis.","time":1444359791009},"onionass":{"definition":"n. an ass so nice it makes you want to cry; see also [onion booty]","time":1444359816826},"applejack":{"definition":"A pony that lives in ponyville,she lives on an apple farm with Granny Applesmith; Applebloom; and Big Macintosh. She is the element of honesty, She has 5 friends, Twilight Sparkle (element of Magic) Rarity (element of generosity) Fluttershy (element of kindness) Rainbow dash (element of loyalty) and Pinkie pie (element of laughter). And She is the best Pony of the Mane 6. Hello and Goodnight Pony Thread.","time":1444359876257},"yourmom":{"definition":"what u say in responce to any question","time":1444359889960},"doggystyle":{"definition":"A man positions himself behind his partner, and inserts his d*ck into his woman&apos;s vagina from behind.  She&apos;s usually bending over something, or on her hands and knees.  The guy can then pull her hair, and use her boobies for handles.","time":1444360039067},"possible":{"definition":"Something that can be done or achieved.","time":1444360340067},"ruh":{"definition":"A word used to describe the [crap] that flows out of the mouth of bullshiters. Used in succession with examples of the [bullshit] in question in between sequences. ","time":1444360383832},"contradict":{"definition":"Inconsistance, to oppose.","time":1444362816266},"omfl":{"definition":"oh my fucking lord!!!<br /><br />(kinda like omfg)<br /><br />*usually said ecstatically!","time":1444364416487},"sip":{"definition":"A magnificent Canadian bastard that makes funny gaming videos on YouTube. Part of the Yogscast; sometimes known as The Real Guy, The Best Guy.","time":1444364999860},"spt":{"definition":"Standard Party Time - from 10:00 to 10:30, the time that most parties start.","time":1444365141715},"romw":{"definition":"Acronym meaning &quot;return on Meals and Wine&quot; (pronounced Row-maw); A financial measure used to calculate the ROI on dating a particular person (typically used when a male courts a female).","time":1444365380853},"tome":{"definition":"good, excellent, cool","time":1444365385668},"persistent":{"definition":"Unrelenting, someone who never gives up. Ceaseless.  Note: in no way related to a certain Erich who in fact notably fails at persistence.","time":1444365574533},"queem":{"definition":"The part of the human body, in between a male&apos;s sexual reproductive organ, and his testicles. This part usually gathers the most sweat, and tends to smell. It can also be a derogatory term used to describe someone.","time":1444366234576},"prob":{"definition":"A shorter version of probably","time":1444366580193}}