{"187":{"definition":"code used by law informent to identify (murder death kill) code used by others on pagers to signify appreciation&#x2f;concern\t\t","time":1441164912022},"413":{"definition":"Main arc number in [Homestuck] canon. According to [Terezi] Pyrope, it is the number of the &quot;BL1ND PROPH3TS.&quot; Not coincidentally, Terezi&apos;s dialect of leetspeak has &quot;A,&quot; &quot;I,&quot; and &quot;E&quot; replaced with 4, 1, and 3, respectively, with no other letters given 133t counterparts. The webcomic began on April 13, 2009, and the entirety of the human protagonists&apos; side of the story takes place on that date, which is also the 13th birthday of [John Egbert], who is one of the four thirteen-year-old human protagonists. The Exiles&apos; story takes place 413 years after those events. Other connections within the comic are too numerous to pack into this definition.","time":1441221947949},"911":{"definition":"Good Lord. Lets finalize this shit.<br />911 - Sports car<br />9-1-1 - Emergency Number<br />September 11 - the day terrorists attacked America. <br /><br />Lets not trivialize the sacrifice our Public Servants paid that day by saying &quot;nine-eleven&quot; &quot;nine one one&quot;.<br /><br />my $.02","time":1441151601113},"1738":{"definition":"A term used by rapper [Fetty Wap] in his song &quot;[Trap Queen]&quot; to represent his squad in New Jersey: the Remy Boyz 1738. The [Remy Boyz] named themselves after a cognac liquor which they claim to be the finest: the Rémy Martin 1738.","time":1441215688439},"teenwolf":{"definition":"Shaking up a beer and biting into the side, puncturing the can with your teeth, spraying beer all over.  <br /><br />Teen wolf does this in the classic movie of the same name while in wolf form.","time":1441149061365},"punani":{"definition":"Function: noun<br />Plural Form: punani<br />Etymology: Mod. Hawaiian punani (lit. heavenly flower) from Old Hawaiian pua (blossom); nani (glory, splendor, heavenly)<br />1: female genitals<br />2: sexually receptive female<br />3: sexual intercourse","time":1441149068880},"admiralackbar":{"definition":". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . _________<br />. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .&#x2f; It&apos;s a trap!\\<br />. . . . . . . . . . . . . . . . _,,,--~~~~~~~~--,_ . . . .\\ ._________&#x2f;<br />. . . . . . . . . . . . . . ,-‘ : : : :::: :::: :: : : : : :º ‘-, . . \\&#x2f;. . . . . . . . . .<br />. . . . . . . . . . . . .,-‘ :: : : :::: :::: :::: :::: : : :o : ‘-, . . . . . . . . . .<br />. . . . . . . . . . . ,-‘ :: ::: :: : : :: :::: :::: :: : : : : :O ‘-, . . . . . . . . .<br />. . . . . . . . . .,-‘ : :: :: :: :: :: : : : : : , : : :º :::: :::: ::’; . . . . . . . .<br />. . . . . . . . .,-‘ &#x2f; &#x2f; : :: :: :: :: : : :::: :::-, ;; ;; ;; ;; ;; ;; ;\\ . . . . . . . .<br />. . . . . . . . &#x2f;,-‘,’ :: : : : : : : : : :: :: :: : ‘-, ;; ;; ;; ;; ;; ;;| . . . . . . .<br />. . . . . . . &#x2f;,’,-‘ :: :: :: :: :: :: :: : ::_,-~~,_’-, ;; ;; ;; ;; | . . . . . . .<br />. . . . . _&#x2f; :,’ :&#x2f; :: :: :: : : :: :: _,-‘&#x2f; : ,-‘;’-‘’’’’~-, ;; ;; ;;,’ . . . . . . . .<br />. . . ,-‘ &#x2f; : : : : : : ,-‘’’ : : :,--‘’ :|| &#x2f;,-‘-‘--‘’’__,’’’ \\ ;; ;,-‘ . . . . . . . .<br />. . . \\ :&#x2f;,, : : : _,-‘ --,,_ : : \\ :\\ ||&#x2f; &#x2f;,-‘-‘x### ::\\ \\ ;;&#x2f; . . . . . . . . . .<br />. . . . \\&#x2f; &#x2f;---‘’’’ : \\ #\\ : :\\ : : \\ :\\ \\| | : (O##º : :&#x2f; &#x2f;-‘’ . . . . . . . . . . .<br />. . . . &#x2f;,’____ : :\\ ‘-#\\ : \\, : :\\ :\\ \\ \\ : ‘-,___,-‘,-`-,, . . . . . . . . . . .<br />. . . . ‘ ) : : : :’’’’--,,--,,,,,,¯ \\ \\ :: ::--,,_’’-,,’’’¯ :’- :’-, . . . . . . . . .<br />. . . . .) : : : : : : ,, : ‘’’’~~~~’ \\ :: :: :: :’’’’’¯ :: ,-‘ :,&#x2f;\\ . . . . . . . . .<br />. . . . .\\,&#x2f; &#x2f;|\\\\| | :&#x2f; &#x2f; : : : : : : : ,’-, :: :: :: :: ::,--‘’ :,-‘ \\ \\ . . . . . . . .<br />. . . . .\\\\’|\\\\ \\|&#x2f; ‘&#x2f; &#x2f; :: :_--,, : , | )’; :: :: :: :,-‘’ : ,-‘ : : :\\ \\, . . . . . . .<br />. . . .&#x2f;¯ :| \\ |\\ : |&#x2f;\\ :: ::----, :\\&#x2f; :|&#x2f; :: :: ,-‘’ : :,-‘ : : : : : : ‘’-,,_ . . . .<br />. . ..| : : :&#x2f; ‘’-(, :: :: :: ‘’’’’~,,,,,’’ :: ,-‘’ : :,-‘ : : : : : : : : :,-‘’’\\\\ . . . .<br />. ,-‘ : : : | : : ‘’) : : :¯’’’’~-,: : ,--‘’’ : :,-‘’ : : : : : : : : : ,-‘ :¯’’’’’-,_ .<br />.&#x2f; : : : : :’-, :: | :: :: :: _,,-‘’’’¯ : ,--‘’ : : : : : : : : : : : &#x2f; : : : : : : :’’-,<br />&#x2f; : : : : : -, :¯’’’’’’’’’’’¯ : : _,,-~’’ : : : : : : : : : : : : : :| : : : : : : : : :<br />: : : : : : : :¯’’~~~~~~’’’ : : : : : : : : : : : : : : : : : : | : : : : : : : : :<br /><br />See [Ackbar]","time":1441149072272},"thisissparta":{"definition":"The greatest cry ever shouted in the history of the universe, only to be shouted directly before delivering a kick to the sternum over a large, seemingly endless pit that has no logical reason for being there but looks really, really, awesome.","time":1441149460416},"yourmom":{"definition":"what u say in responce to any question","time":1441149466056},"honchkrow":{"definition":"Honchkrow, espically when shiny, is more of a pimp than Tyranitar and is the crime boss of pokemon. Even when not shiny they are the biggest pimps in the pokemon world. Honchkrows have Gardevoirs, Medichams, and Misdreavouses walk the street looking for customers. Honchkrows will have other pokemon steal money, kill others, collect payments, etc. Honchkrows are known to have gangwars with other Honchkrows over territory where the result is horrible with many dead Murkrows laying around. Basically, you don&apos;t want to mess with one seeing your prostitute probably belongs to him.","time":1441149473550},"jynx":{"definition":"Jynx: the only Pokemon in Nintendo&apos;s popular game series to be involved in a racism scandal due to the black color of it&apos;s face. A few of the anime episodes were banned and many were edited because of this. Nintendo promptly changed the color to purple. Some people use this word to describe Black women who act very stereotypical. ","time":1441149481732},"obligated":{"definition":"An incorrect synonym for &quot;obliged&quot;, which appears in some dictionaries, but none of the good ones.","time":1441149515073},"mfw":{"definition":"Abbreviation for &quot;my face when","time":1441149524424},"sp00ky":{"definition":"The edgiest, most interesting way of describing something that is deemed as scary by people, but not by you. Usually used in a sarcastic form to something that doesn&apos;t seem too scary, usually done to annoy people who have background experience with the traditions of chatting on the Internet.  Usually used on the Internet by Internet addicts. Similar to the lack of actual laughter when using [lel].","time":1441149615260},"(.y.)":{"definition":"[BOOBIES]. big boobs-( . Y . )<br />small boobs- (.Y.)<br />perky boobs- (*Y*)<br />etc. etc.","time":1441149631109},"senior":{"definition":"The very last year of [high school]. At the end of this school year comes [graduation]. Most kids are relieved that the [hell] of [homework], [drama], [friends], and [boring] shit is over.","time":1441149641305},"boobies":{"definition":"The best damn things since peanut butter.","time":1441149646063},"lgi":{"definition":"Lets Get It!","time":1441149785802},"teens":{"definition":"In online chatrooms it means a man in his 40&apos;s or 50&apos;s with his nob out.","time":1441149933251},"kimjongun":{"definition":"The little fat boy from the movie &quot;up&quot;","time":1441150048253},"deeznuts":{"definition":"1) A sarcastic expression used to denote annoyance or frustration.<br />2) A term used when you just dont give a fuck<br />3) Look, my dick and balls are bigger than yours.","time":1441150069104},"anus":{"definition":"A hole used primarily for the dispensing of fecal matter.  Sometimes the insertion of oblongated objects such as various fruits, vegetables, broomsticks, fingers, penises, etc. are allowed entrance into this sacred area.  The size of the anus can vary depending on the size of fecal matter dispersement, as well as what types of objects are inserted into this area.<br /><br />The anus is also known as the asshole, butthole, chocolate starfish, brown eyed willy and has many other slang terms for it.","time":1441150337712},"ho":{"definition":"A word Santa Clause says three times when he sees your wife, mother and sister together in the same room.","time":1441150662627},"gottem":{"definition":"An exclamation yelled after someone is completely owned by a comeback or statement. ","time":1441150677338},"bored":{"definition":"What you probably are if you&apos;re looking this up.","time":1441150734070},"superhot":{"definition":"a term describing a chick who is so ridiculously good looking that the word hot does not do her justice.  <br /><br />","time":1441150823882},"spam":{"definition":"spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam spam ","time":1441150866940},"ic":{"definition":"In roleplaying, short for In-Character.  If you are IC, that means you are pretending to be someone else (your character) rather than being yourself.  Antonym of [OOC].","time":1441151202228},"doge":{"definition":"wow<br />so urban<br />very informatiev<br />much confuse  wow","time":1441151209625},"bbs":{"definition":"Be back Soon","time":1441151735861},"trunks":{"definition":"n. the ass, butt, booty, gluteus maximus. Called the &quot;trunk&quot; because its posterior position (on the rear of the body) is relative to the location of the &quot;trunk&quot; of a car. duh!","time":1441152727898},"scurred":{"definition":"Different way to say &quot;scared&quot;","time":1441153117928},"cameo":{"definition":"A short appearance by a famous person.","time":1441153182290},"life":{"definition":"A sexually-transmitted, terminal disease.","time":1441153339848},"declare":{"definition":"To pronounce, announce, utter, say, or clearly indicate, as though officially, or with authority, or bearing formality.","time":1441153365026},"asdfghjkl":{"definition":"1) An expression of frustration for IM; Used in desperation when no other words will do.<br /><br />2) A conversation filler, also in IMing, when no one has said anything in a while.<br /><br />*with any of these there can be added letters as well as semi colons. It is usually a personal preference. ","time":1441153483065},"zxcvbnm":{"definition":"people punch these keys on the key board when they get irritated at their computer or have mental problems and believe this is a real word&gt;","time":1441153497175},"qwertyuiopasdfghjklzxcvbnm":{"definition":"A phenomena that happens to a computer&apos;s keyboard when a human being is bored to death...","time":1441153518181},"qwertyuiop":{"definition":"Usually the top line of a keyboard, qwertyuiop was the first word ever sent in an [e-mail].","time":1441153534777},":c":{"definition":"The saddest man in the whole entire world.","time":1441153614909},":(":{"definition":"An emoticon depicting an unhappy or sad face.","time":1441153619180},"remo":{"definition":"A really great thing or person.","time":1441153687286},"remos":{"definition":"A really great thing or person.","time":1441153693844},"karl":{"definition":"A really cool guy, nice once you get to know him. He isn&apos;t the best looking guy in the world but makes a great pal and will take care of his friends and his woman. Dislikes most people upon meeting them. Saves time from hating them later. Falls in love at first sight once a year. Never gets that girl though. Some day he will. Also extremely funny and sarcastic.","time":1441153769388},"fender":{"definition":"Guitar company that creates guitars with a noun prefix attached to a verb.","time":1441153770619},"unison":{"definition":"when you and a friend say the same thing at the same time","time":1441154316681},"curfew":{"definition":"a defined time or restriction.<br />not allowed at a certain time.","time":1441154515226},"estrogen":{"definition":"Estrogen....simply enough....is God&apos;s curse on man","time":1441155111937},"dpp":{"definition":"Double Pussy Penetration.  When two men both have their dicks in one woman&apos;s pussy at the same time.","time":1441155278970},"mr.crowley":{"definition":"Some Asshole Ozzy Ozbourne sung about.<br />Song has a superb riff and lead guitar.","time":1441155302044},"maylene":{"definition":"Maylene is a smart and stong girl with a witty personality. She will always be there for others and put then before herself. She has an amazing heart and her beauty compares to no other. She is an amazing lover who seems like an total angel but get her more comfortable and her fun side will come out. She&apos;s is a one of a kind girl and anyone who is with her is incredibly lucky and she loves then and never wants to let them go.","time":1441155328569},"diaryofamadman":{"definition":"probably the best metal album in this world and any others. featuring the songs:  over the mountain<br />flying high again<br />you cant kill rock and roll<br />believer<br />little dolls<br />tonight<br />S.A.T.O.<br />and of course, DIARY OF A MAD MAN (wich is the best fucking song in the world next to hallowed be thy name by iron maiden. seriously i cant express how awesome this song is. and it has the best lyrics of any song ever written. the sheer genius of this song cant be compared to anything in existence.) any ways this is the best albim ever by ozzy . it is universally recognized as an icon of heavy metal. and anyone who disagrees can suck my balls.","time":1441155348509},"hamza":{"definition":"A person,who is brave,strong,who has a lion&apos;s heart..<br />","time":1441155357002},"nile":{"definition":"1) A huge river in the middle east.<br />2) A really great death-metal band","time":1441155380960},"dethklok":{"definition":"A death metal band of legendary proportions, and the focus of the show Metalocalypse. Led by singer Nathan Explosion, Dethklok is considered to be the world&apos;s greatest cultural force. They held a concert in the Arctic Circle that featured only one song - a tune written for the coffee company Duncan Hills - and over 300,000 fans from around the world showed up for the event. Dethklok&apos;s concerts are so intense that fans have to sign &quot;pain waivers&quot; before they&apos;re allowed to enter. Dethklok is god of all metal bands - past, present, and future.","time":1441155433288},"acidbath":{"definition":"A genuinely talented, listenable, musically diverse and unfortunately, now defunct metal band that put most modern metal bands to shame.<br /><br />Famous for being melodic, heavy and using disturbingly absurd poetic lyrics; Acid Bath created a unique sound for themselves (in no small part assisted by Dax&apos;s varied singing&#x2f;shouting skills).<br /><br />Acid Bath were also notorious for having their album cover art designed by the serial killers John Wayne Gacy and Dr. Jack Kevorkian.<br /><br />Goddamit, they really rock, look up their shit on Amazon and you won&apos;t be sorry.","time":1441155476072},"suave":{"definition":"Smoothly agreeable and courteous; Sweet; pleasant; delightful; gracious or agreeable in manner","time":1441155598275},"mrw":{"definition":"An abbreviation for &quot;My Reaction When&quot;.","time":1441155656911},"trw":{"definition":"An acronym for &quot;Trigger Rob W....&quot;  A TRW is a person who says triggering things, often in a social justice context, with little to no consideration for how their words affect others. This person may attempt to call out their own privilege, but falls short every time. They frequently speak over other people (without acknowledging the privilege that allows them to do so), make safe spaces uncomfortable, and may talk about things of a sexual nature at inappropriate times. They delight in calling people out on their (occasionally just imagined) prejudices, almost as though they were receiving money in return. A TRW seems to particularly enjoy speaking over women of color.","time":1441155666136},"waifu":{"definition":"A term coined by Otaku and Weeaboo alike for their 2D significant others; predominantly anime and video game characters. A Waifu, in contrast to a harem, is the love between one man and his one and only Waifu. You treat your Waifu with the utmost respect and courtesy and most refuse to even fap to their beloved, seeing the act as an insult to the non-existent woman they have committed themselves to.  A spin-off term &quot;Husbando&quot; followed for Fujioshi who feel similarly towards male characters.","time":1441155987891},"kek":{"definition":"Kek literally translates to lol on World of Warcraft. When someone from the Horde side types lol in &#x2f;say, members of the alliance side see kek instead. Not specific to Orcs.","time":1441156427457},"raiseyourdonger":{"definition":"A catchphrase made by [League of Legends] player Michael Santana. The phrase is now spammed by his fans in livechats, after he first used it in a twitter post in June stating, ヽ༼ຈل͜ຈ༽ﾉ raise your dongers","time":1441156809878},"xeno":{"definition":"1) Stranger; foreigner; alien<br /> <br />2) Strange; foreign; exotic; different<br /><br />New Latin, from Greek, from Xenos, -Stranger<br /><br />Feminine = Xena; Masculine = Xeno","time":1441156907109},"rg":{"definition":"An internet chat abbreviation for &quot;retarded giggles&quot;; applicable when reading a message and in stead of &apos;laughing out loud&apos;, you let out a short, obnoxious, manatee-sounding laugh. An &apos;RG&apos; can also be considered such if the person tilts there head back in laughter, appearing to unhinge their jaw from hysteria. ","time":1441157057278},"gijinka":{"definition":"Mostly done in fan-art, it is the name for the humanization of any animal-like character. Most popularly done with [Sonic the Hedgehog] characters, and [Pokemon].","time":1441157084843},"og":{"definition":"Original gangster","time":1441157615264},"pokeman":{"definition":"Something to be shown to others.","time":1441157641859},"transgender":{"definition":"A term referring to when one&apos;s gender and sex are not always or ever equivalent.  Often used as a referrant to the person themself.<br /><br />This is a broad term that includes transexual (pre&#x2f;non or post-op), non-gender, bi (tri &amp; multi) gender, androgynes, etc.<br /><br />The state of being transgendered may or may not have any bearing on sexual preferences.","time":1441157813328},"fify":{"definition":"acronym used in message boards, meaning &quot;Fixed it for ya&quot;. Most often used in quoting another posters work and slightly changing it. ","time":1441157836890},"dude":{"definition":"A word that americans use to address each other. Particularly stoners, surfers and skaters.","time":1441157869445},"bruh":{"definition":"Used by african Americans Males in everyday vocabulary or to greet one another","time":1441157885425},"csl":{"definition":"cock sucking lips. a handy abbreviation which is specially useful when describing someone within cuffing distance who you don&apos;t want to know what you are talking about","time":1441157973882},"weeaboo":{"definition":"Someone who is obsessed with Japan&#x2f;Japanese Culture&#x2f;Anime, etc. and attempts to act as if they were Japanese, even though they&apos;re far from it. They use Japanese words but usually end up pronouncing them wrong and sounding like total assholes. You can find alot of these faggots clogging up the forums of Gaia Online, hanging out in the international aisle of the supermarket, or crowding the manga section of your local bookstore. Synonym of [wapanese].","time":1441158340882},"^~^":{"definition":"mischievous smiley often used in Instant Messenger conversations or texts","time":1441158505851},"dmv":{"definition":"This is the DC metro area. DMV stands for DC,Maryland,Virginia. The whole DMV listens to gogo music which originated in DC. We love northface gear and mambo sauce in chinese carry-outs. We rep our hood to da fullest cuz aint no other place like us anywhere in the US. Our whole swag and slang and music and clothes is different from everybody else. I can go on and on bout us but i&apos;m not.","time":1441159206971},"sia":{"definition":"A suffix used mostly by Singaporeans and Malaysians at the end of sentences or exclamations to add emphasis or gravity.  Mostly used to highlight something and proclaim shock, respect or to garner agreement.  Informal, and used mostly by gangsters, youngsters or the less educated.","time":1441159306592},"weezing":{"definition":"The act of having intercourse with a women after hotboxing the room.","time":1441159557231},"omf":{"definition":"OMF stemming from a typo while typing OMG. Similar in history to the creation of pwn from an own typo. Gennerally taken to have the meaning &quot;oh my fuck&quot;.","time":1441159646164},"lh":{"definition":"laughing hysterically","time":1441159757609},"fgt":{"definition":"Short for faggot, commonly used in [IRC]","time":1441159771291},"jit":{"definition":"a young muthafucka that don&apos;t know shit","time":1441160032532},"futanari":{"definition":"Someone(Usually in a doujinshi, but occasionally in normal fanfics or hentai), who appears to be female, but for some reason has male genatalia.  Used by people who can&apos;t draw&#x2f;write yuri","time":1441160076104},":^)":{"definition":"Usually meaning someone &quot;Trolling&quot; or fucking with you, or being a passive  aggressive douche bag, also known as the &quot;Dorito Face.&quot;  it is mostly used too piss people off honestly and too put at the end of sentences.","time":1441160162626},"yeastinfection":{"definition":"An infection that can be caused by too much of yeast bacteria acumulated in the genitals. Is not sexualy transmitted and can be treated. The infection can accur in both men and women. Accurs mostly in women that are of a child bearing age and is a very commen infection. This infection causes great itching and thick white mucus oozing from the genitals. <br /><br />","time":1441160196226},"tfb":{"definition":"TFB: too fucking bad","time":1441160216793},"vape":{"definition":"To inhale vapor from E-cigarettes. Used because &quot;smoking&quot; an E-cig doesn&apos;t apply as there is no smoke only vapor.","time":1441160328587},"fat":{"definition":"According to Hollywood, What you are if you are a female weighing over 100 lbs.","time":1441160340306},"fuckboi":{"definition":"A guy who tries to get with everyone. A player. A guy who will lie to a girl to make them hook up with them or send pics. They think they are the shit when they aren&apos;t. A guy who will only date a girl for their body. A total ass. A guy that will make a girl cry and laugh, and a guy who lies when they said I love you","time":1441160712848},"whore":{"definition":"A woman that sleeps with everyone but YOU!!!!!<br />SEE: SLUT  - A woman that sleeps with everyone.","time":1441160729026},"slut":{"definition":"a woman with the morals of a man","time":1441160737440},"funy":{"definition":"Pronounced like &quot;fyoonie&quot;.<br /><br />The way retards who can&apos;t spell, and idiots who think [leet speak] is cool, spell the word &quot;funny&quot;.<br /><br />This means that whatever is &quot;funy&quot; is only funny to little immature kiddies who haven&apos;t hit puberty yet, or to retards that do not have an actual sense of humor, so for everyone else, it is not funny at all.","time":1441161019970},"leetspeak":{"definition":"Originating in the early 1980&apos;s, leet speak was first used by hackers as a way to prevent their websites&#x2f;newsgroups from being found by simple keyword searches.<br />Leet speak grew and became popular in online games such as Doom in the early 1990&apos;s as a way of suggesting that you were a hacker (h4x0r), and therefore to be feared. <br />Leet, or 1337, is a short form of &quot;elite,&quot; commonly used by video gamers to suggest that they are skilled.","time":1441161045831},"learnt":{"definition":"British standard English past tense and past participle for &apos;learn&apos;","time":1441161132693},"gameofthrones":{"definition":"An HBO show based on George R. R. Martin&apos;s books. The show&apos;s got a great deal of politics, royal intrigues, incest, murder, warfare, violence and sex. Mediæval genre and features lots of swordplay and riding horses. And a lot of violence and sex. Did I mention the sex? And drinking and a dwarf with an obsession with whoring.","time":1441161187349},"legendoftheseeker":{"definition":"A tv show based on the Sword of Truth series by Terry Goodkind, made by Disney&#x2f;ABC, Filmed in New Zealand, and created by Sam Raimi.  Character include:<br />Bridget Regan as Kahlan Amnell<br />Craig Horner as Richard Cypher<br />Bruce Spence as Zedd","time":1441161202525},"bra":{"definition":"a barrier known to all men, that is almost the only thing between us(males) and the holy mounds known as BOOBS, and if you didn&apos;t know that your a fuckin&apos; moron.","time":1441161330378},"ro":{"definition":"Racial Oppression. Unfair treatment of a specific ethnic group. See the [Holocaust].","time":1441161331574},"bro":{"definition":"Obnoxious partying males who are often seen at college parties. When they aren’t making an ass of themselves they usually just stand around holding a red plastic cup waiting for something exciting to happen so they can scream something that demonstrates how much they enjoy partying. Nearly everyone in a fraternity is a bro but there are also many bros who are not in a fraternity. They often wear a rugby shirt and a baseball cap. It is not uncommon for them to have spiked hair with frosted tips.<br /><br />Bros actually chose this name for themselves as they often refer to each other as &quot;bro&quot; even though they are not related.","time":1441161341560},"lgbtqia":{"definition":"Lesbian, gay, bisexual, transgender, questioning, intersex, and asexual","time":1441161542627},"gangsta.":{"definition":"1.) A group of schoolgirls with guns; commonly correctly compared to those who think handguns can be shot correctly tilted sideways","time":1441161932542},"smg":{"definition":"Acronym for sub-machine gun","time":1441162273702},"clod":{"definition":"A stupid shit.","time":1441162287714},"atlanta":{"definition":"A city with lots of rich people in the north end, and lots of ghetto types in the south end.  Also lots of traffic, new economy jobs, and Coca-cola.","time":1441162310337},"idaho":{"definition":"One of the best conducted hoaxes in history. Idaho does not exist, nor does anyone &quot;from Idaho&quot; exist. It is suspected Idaho is a black hole.<br /><br />Idaho is, in actuality, the final resting place of the B-52&apos;s. When their career began to decline, they left for Idaho and never returned.","time":1441162366041},"iowa":{"definition":"Not the best state in the country, but very far from the worst.  Home to three million people, some really sweet cities, three great univerties, a whole bunch of stellar small private colleges and a ton of true natural beauty in its lush northeast bluff country and statewide river valleys, lakes, and yes, rolling fields.  Iowa is a national leader in education (students in many other states including Texas take the Iowa Test of Basic Skills, and everyone&apos;s heard of the ACT, based in Iowa City) and is leading the way in biofuels to reduce the nation&apos;s dependence on oil.  To dispel the ignorance displayed elsewhere on this post, here&apos;s a state breakdown of cities and topography.  If seventy synonyms for boobs is alright to post, so is this.<br /><br />Central Iowa:  [Des Moines], located at the intersection of I-80 and I-35, is the largest city with a metro of a half million and is the state capital, second only to London for the title of insurance capital of the world.  [Ames] (80,000 metro) is about a half hour north of Des Moines and is home to [Iowa State University], a land grant school of 30,000 respected around the world for its engineering and agricultural programs.  Central Iowa is, outside of river vallies, very flat, and outside of the Des Moines area and Ames is very sparsely populated.<br /><br />Eastern Iowa:  The most densely populated area of the state.  Ethnically diverse [Iowa City] (115,000 metro) was Iowa&apos;s first state capital, was the first city in the world to elect a female mayor, has been named the most cultured city per capita in the nation, is always in the top five cities in the country for education, and is home to the [University of Iowa], 30,000, nationally renowned for its Carver College of Medicine and Iowa Hawkeye athletics.  The music departments of Iowa City&apos;s two large public high schools have won a total of five Grammy awards.  [Cedar Rapids], (200,000 metro) just twenty minutes north of Iowa City in the beautiful Cedar River valley, is the second largest single city, is the economic hub of eastern Iowa, has two private colleges, and is best known for being the place you get any of your Quaker Oats brand ceral from.  [Waterloo&#x2f;Cedar Falls], two conjoined cities (130,000 metro) is where the [Unviersity of Northern Iowa], 18,000, is located.  The [Quad Cities], (375,000 metro) two in Iowa and two in Illinois, straddle the Mississippi and form the largest metro between Des Moines and Chicago.  The largest of the four cities is [Davenport], IA, home to the Bix 7 foot race whose hilly course and large prize attract runners from every part of the globe.  [Dubuque], (90,000 metro) on the Mississippi where Iowa meets Illinois and Wisconsin, is Iowa&apos;s oldest city. It is home to a ton of beautiful architecture, four private colleges, a far-reaching ELCA Lutheran seminary, and the Smithsonion affiliated National Mississippi River Musem and Aquarium.  Eastern Iowa&apos;s topography is for the most part very rolling farmland, with the exception of the hillier Iowa river valley, Cedar river valley, and the bluffs and hills skirting the whole eastern border along the Mississippi.  The northeast corner of the state is all bluffland, home to small town Decorah and reputed Luther College.<br /><br />Western Iowa:  The vast majority of Iowa west of I-35 is flat farmland with the exception of the very westernmost strip.  [Sioux City] on the Missouri river (the western border) is a good sized city with nice amenities and lots of historyt.  [Council Bluffs] is the largest suburb of Omaha, just across the river in Nebraska.  The Iowa Great Lakes region contains many large lakes, most notably lake Okoboji, one of only three blue water lakes in the world.  The Loess Hills state park runs along the whole westernmost strip of the state, and offers lots of hilly hiking and some of the state&apos;s largest forests.<br /><br />Iowa&apos;s motto should be &quot;Iowa: Not as bad as you picture it.&quot;","time":1441162384707},"kentucky":{"definition":"A place where the word holler rightfully  exists; a place of wonder; a place where children can dig their fingers in the dirt, use their imagination, and dream; a place where parents want more for their children and do everything possible for their wishes to come true; a place where most people in the united states like to underestimate and pretend that the only thing that exists there is &apos;inbreds&apos;; a place that a teenage girl tries her whole life to leave and when she settles elsewhere, she can&apos;t wait to see the mountains again;a place that also uses the word hick, but in a slightly different way everyone else does; a slightly poor place; a place where,yes, horse racing exists and people are actually in touch with nature; home cooked meals are to die for!; a great place to think or write a book; AND its fun to use words without a &apos;g&apos; in the end!","time":1441162410334},"antiguaandbarbuda":{"definition":"little tiny carribean country that used to be under british rule. currently, it consists of a pair of islands that seem to exist soley for american, canadian, and european toruist dollars.","time":1441162432267},"lags":{"definition":"not to be confused with latency (the time it takes to send a packet to and recieve a response packet from a server along a network), lag is impaired computer functionality (slow application responses or reduced&#x2f;choppy framerates) resulting from high latency, packet loss, or low-preformance (generally video) hardware<br /><br />adj. laggy, vi. lag","time":1441162635523},"ab":{"definition":"&quot;Aryan Brotherhood&quot;  A known prison gang consisting of neo-nazis or skinheads.","time":1441162643287},"aby":{"definition":"A super duper hot girl who likes to play video games and eat sandwiches and buffalo wings. She often has lots of amazing friends who love her sense of humor and her adorable short height. She has a rockin&apos; smile and greatly attractive body parts. Usually she has soft, long, silky brown hair and big beautiful brown eyes. She&apos;s shy and plays alot of video games that boys play, like Call of Duty. People may envy her but that never bothers her. Also, she loves cleverbot.","time":1441162645032},"ames":{"definition":"A branch of Methodists formed by Richard Allen a few years after the [Revolutionary War]. [White] methodists no longer wanted to share a church with black Methodists, so we made our own church. A.M.E. stands for African Methodist Episcopalion (or however that&apos;s spelled)","time":1441162833575},"johns":{"definition":"a very extreamly confusing guy. shows that he has feelings for you sometimes, but then might just randomly stop talking to you at any time. veryy flirtatious. manwhore. willll lead you on. halarious. full of charisma. you have to love him. boys are jealous of him. girls are jealous of the girl he is flirting with at the time..<br />not persistant.<br />changes moods easily; moody.<br />greatest, most annoying person on the face of this earth..yet i still want to be with him..<br />","time":1441163295750},"jojo'sbizarreadventure":{"definition":"JoJo&apos;s Bizarre Adventure is a series of Manga that revolves over a family who have have a Jo in the first name and Jo in the last. Craziness ensues. Also, vampires, steamrollers, and magic guardians. ","time":1441163359312},"airtight":{"definition":"Practice of filling all 3 orifices of a female by either penis, or objects.<br />A penis in the ass, pussy and mouth at the same time, or a combination of penis and vibrator&#x2f;dildo.","time":1441163439486},"fugly":{"definition":"shorter word for &quot;fucking ugly&quot;","time":1441163494329},"korewazombiedesuka":{"definition":"A kick-ass [anime] about a zombie and his [harem].","time":1441163724791},"harem":{"definition":"(n.) a [back in the day] term for a [stable] full o&apos; bitches.","time":1441163816039},"gtk":{"definition":"its the acronym for &quot; Good to know&quot;, it can be used in terms of sarcasm or actuality","time":1441164510793},"wavy":{"definition":"the new futuristic way of describing something in a positive connotation, popularized by rapper Max B","time":1441164653645},"quick":{"definition":"1. To climax extremely fast. To come in a short period of time.<br />2. A nickname for someone who the above regularly happens to.","time":1441164672003},"frenchmontana":{"definition":"french montana is a whack rapper who makes money off of dumb people and teen girls who are too stupid to understand that french montana can&apos;t rap at all!","time":1441164693311},"rkelly":{"definition":"The process of pissing all over a girls face who is 14 years of age or younger for sexual arrousal and total domination... Similiar to a golden shower but with girls 14 years or younger.","time":1441164719439},"kobe":{"definition":"something a black man says when they throw a condom into a trashcan after having sex with a white woman in a hotel room","time":1441164735421},"snowy":{"definition":"adj., one who does coke.","time":1441164772224},"pussyboy":{"definition":"Homosexual who likes to be extremly submissive during sex.  He enjoys being used by his sexual partner and often refers to his ass hole as a cunt or pussy.","time":1441164792216},"3am":{"definition":"3am, three total munters who think they&apos;re the girls out of HBO&apos;s Sex and the City but in stend are sad ugmo&apos;s who write a coloum for The Daily Mirror","time":1441164822561},"burr":{"definition":"1. A phrase used to describe something cold.<br />2. When something [goes hard].  Coined by Gucci Mane, referring to how icy his chains are.","time":1441164854235},"genoa":{"definition":"City in the north-west of Italy, hometown of [Christopher Columbus], [Niccolò Paganini], [Giuseppe Mazzini], [Pietro Germi], [Vittorio Gassman], [Fabrizio De André], [Ivano Fossati]. Famous for pesto and blue [jeans] (from &quot;bleu de Gênes&quot;, lit. &quot;blue of Genoa&quot;). Largest port of Italy and home of the first football team in the country, Genoa Football &amp; Cricket Club, founded in 1893. Stunningly beautiful city inhabited by proud, highly unsociable people. The Genovese invented the first bank and the first pawnshop in the Western world.","time":1441164858247},"javy":{"definition":"The coolest motherfucker in the universe","time":1441164896394},"enn":{"definition":"money","time":1441164928586},"savage":{"definition":"Bad ass.  Cool. Violent.","time":1441165094028},"berto":{"definition":"The coolest guy in the world!","time":1441165128521},"daniel":{"definition":"     This is a difficult name to define because it defies many boundaries of human perception, let alone various languages. One of the closest translations that experts give is God or many other variations of that general idea. <br />Other definitions are thought to be: <br />Tao<br />Chi<br />The Great Spirit<br />Chuck Norris<br />Energy<br />Infinity<br />Sublime<br />ect<br />     Despite the fact that various names have been pinned to Daniel, its seems that all of the above examples (including that of God)cannot even withstand the magnitude of Daniel.<br />     The reason this name continues to elude even the brightest of human minds is that the idea of Daniel cannot possibly exist in a dimensional state. Daniel is so powerful, it defies all laws of this or any other universe. Recent studies have shown that people who have attempted to comprehend this name have either disappeared, died spontaneously, or driven themselves into a pertinent state of insanity and&#x2f;or catatonia. One common belief is that Daniel is possibly the grounds on which everything and nothing is based. It seems to surpass the idea of infinity. Quantum physicists report that this Daniel is Everything and Nothing. It or He is said to have unexplainable connections with the String and Superstring Theories as Daniel resonates within every single layer of the multi-dimensional complex and yet still exists beyond that point which is where scientists have lost the trail. Various theologists and spiritual leaders believe that Daniel is one who is, as they say, &quot;The Answer&quot;. All attempts to understand this idea of Daniel have failed.","time":1441165147557},"lactose":{"definition":"dull, boring, stupid","time":1441165514768},"holly":{"definition":"A word used to describe a beautiful and bright being.<br />usally linked to a girl of average height with blonde hair and brown eyes.<br /><br />Symptons of being a Holly:<br />- excessive loudness (no volume control)<br />- sometimes lives in a fantasy world- belives herself to be a princess<br />- Tendency to dress in alot of pastel coloured pink<br />- likes to be liked &amp; loves the people closest to her dearly<br /><br />Other attributes of hollys:<br />- Hardworking, motivated and ambitious<br />- Creative, artistic and emotive<br />- romantic, confident and passionate<br /><br />Some may refer to as Slag&#x2f;Whore&#x2f;Loose&#x2f;&apos;cock on the brain&apos;, this infact can be rather incorrect as it is down to a &apos;holly&apos; being nothing more than a kinky being!<br /><br />Most importantly;Holly is another way to explain a &apos;blonde moment&apos;","time":1441165940571},"richard":{"definition":"Tall, almost towering, large features, arms, legs. Beautiful heart. Kind, usually reserved about sharing his feelings. Although he is able to communicate well, he feels much more deeply than he speaks. Only those that are close to him will ever really know him. Will see &apos;it&apos; through even if he is unhappy, his commitment unwavering. Will make many mistakes believing he has made a &apos;wise&apos; choice. Realizes logic does not bring happiness. Falls in love only once, usually shocking (completely different upbringings) to him. When he does find her, he is relentless in his pursuit. However, it is not calculating, unconsciously he maneuvers his actions to allow himself to be with her. A strong, powerful force, a positive energy, other men are always questioning, &quot;what&apos;s so great about Richard?&quot;. Spiritual leader. Excellent lover, very good with his entire body, making women fantasize about him regularly. A very thick, yummy kisser. Richard is a kind, good, lovely, beautiful, sweet, aggressive, sensitive man with a consecrated heart. Richard is super sexxy!","time":1441166012174},"dick":{"definition":"1.The male genitals<br />2.An abrasive man<br />3.Short-form for &quot;Richard&quot;<br />","time":1441166027803},"blastoise":{"definition":"One of the great water pokémon, fully equipted with a duel hydro pump.  He must have a HUUUGE BLUE COCK!","time":1441166047869},"fts":{"definition":"Abv. Fuck That Shit","time":1441166557930},"edc":{"definition":"Electric Daisy Carnival<br /><br />the biggest rave of the year usually held at the USC colliseum in downtown","time":1441166654692},"edu":{"definition":"The sickest nickname for [weed] ever... You can use it in casual converstaion at school, in front of your parents... WHATEVER! ... invented by the amazing [stoners] from the [International Secondary School Eindhoven], btw.","time":1441166664161},"edi":{"definition":"Usually a surname origins are from the Greek Ages.<br />The Edis&apos; have largely died out, however a few small families remail in Western Europe and in the Greek Islands.<br />The Edis&apos; were renouned Spiritualists and deep-thinkers and it is this combination that made them highly respected members of society.<br />The female members of the Edis&apos; are known to be fiercely independant and staunch believers in what is right and just.<br />The male members of the Edis&apos; are known to be hard workers and great providers of their family.","time":1441166674731},"euc":{"definition":"excellent used condition","time":1441166685820},"eac":{"definition":"Eatin&apos; Ain&apos;t Cheatin&apos;","time":1441166708959},"ecd":{"definition":"Excessive Compulsive Disorder  The overwhelming itch to post what you are doing, feeling, experiencing every second of the day and in turn, letting people know useless information. Usually in the form of status updates, mobile uploads, tweets, posts, location and messages.","time":1441166713764},"eoc":{"definition":"acronym meaning &quot;extrememly out of control&quot;","time":1441166726727},"exc":{"definition":"(Ecks see) , &#x2f;adj.&#x2f;<br />Personality trait that is the polar opposite of &quot;emo&quot;. Derived from &quot;excite&quot;, exc means to be full of energy, social, carefree, and confident.","time":1441166734773},"esc":{"definition":"The &quot;escape&quot; key. It, like, closes windows, or programs, or something like that. Often used in vain by [computer illiterate] school teachers to somehow fix a frozen computer.","time":1441166739238},"dc":{"definition":"abbreviation for &apos;don&apos;t care&apos;","time":1441166746081},"ec":{"definition":"Abbreviation for eye candy","time":1441166749424},"ecu":{"definition":"East Carolina University, home of the P.D. the Pirate. ECU has a reputation for being a party school. Not a particularly good athletic school, but they made it to a tournament this year!","time":1441166759572},"eci":{"definition":"An abbreviation for an Ecuadorian native, who receives that nickname out of respect.","time":1441166769367},"pleb":{"definition":"Actually defined as a member of a despised social class, a commoner, a member of the plebs of ancient Rome.  Also low-born, undisinguished, vulgar, and my personal favourite: vulgar-looking.  <br /><br />Other words with similar meaning: Scrut, Townie, Kappa-Slapper, Rude-Boi, Scum, Greb, Scav, &amp;c.","time":1441166821753},"edp":{"definition":"Emotional Disturbed Person. Used by NYC EMS and NYPD to describe nature of call or diagnosis of patient","time":1441166888576},"epc":{"definition":"1.a group of 4  sexi mofos<br />2. an elephants ass with grafiti marked upon it","time":1441166899609},"roundabout":{"definition":"A form of sexual activity, more specificly handjob, where the female places the males penis in the palm of her left hand. The female then proceeds to violently bash the top of the penis with her right elbow, until the male orgasms.","time":1441167175726},"yes":{"definition":"1) An affirmative answer to a question, the opposite of no.<br />2) An expletive shouted out during an orgasm.<br />3) A British [progressive rock] (or [art rock]) group known for their hits &quot;Roundabout&quot; and &quot;Owner of a Lonely Heart&quot;.<br />4) A brand of laundry detergent in the US.","time":1441167181393},"no":{"definition":"The word that makes sex rape.","time":1441167183696},"lube":{"definition":"Short for &quot;lubricant.&quot;  Commercial product used to lubricate sexual intercourse, often anal sex between two men.  Lube allows the penis to enter the anus without pulling or tearing of the anal tissue.  It also allows time for the anus to expand and accept the incoming phallus.","time":1441167233106},"imperialism":{"definition":"The domination by country of the political, economic, or cultural life of another country or region.","time":1441169183958},"burmese":{"definition":"1. This is referring to a person from Burma(Myanmar). Burma is diverse within its borders. Many Burmese are mixed with Chinese, Thai,Indian, Bangladeshi, Nepali, etc. There are also many different ethnicities within the country. About 75% of the people are Buddhist(Theravada) but exist peacefully with other religious minorities (Christians, Hindus, etc.). Burmese people are extremely kind, friendly and always smiling. ","time":1441169222094},"raj":{"definition":"See [Rule] or [Royalty]<br /><br />Ruler and&#x2f;or King. In modern terms, pretty much meaning the leader.","time":1441169503418},"erroneous":{"definition":"Uncalled for, Mistaken, Wrong.","time":1441169719834},"zooweemama":{"definition":"an expression used to express surprise or excitement.","time":1441169777597},"keahi":{"definition":"keahi is a very modest hawaiian name it was refered to be the most powerful hawaiian name that is why only the brave is named keahi. people named keahi are very legit and layed back. but beware even though he is a very nice person he can blow up if provoked","time":1441170044049},"pso2":{"definition":"PSO2 is short for Phantasy Star Online 2, the most recent, free-to-play Japanese MMO created by Sega.  The game, as all previous games of the Phantasy Star series have done so in the past, is being updated weakly from weekly maintenance, as new content is usually fresh. It is similar to other popular MMO&apos;s as it is, &apos;grindy&apos;, somewhat sluggish, and a matter of time consumption to gain levels. PSO2 seems to be most popular in Japan, and North &amp; South America. However, people from all around the world play the game, regardless of Sega&apos;s refusals to localize the game, as well as the ToS (Terms of Service) specifically claiming non-JP IP&apos;s are not to be playing their game. It has been noted that Sega was at first lethally active at removing foreign players, but now has the &apos;rule&apos; mostly relaxed. Sega still seems to occasionally ban foreign players. It is clear that Sega favors the Japanese players in favor of certain rules, as this is who they purely cater to, in the original release of the game.  You may download PSO2 from www.pso2.jp","time":1441170460265},"pso":{"definition":"1. Short for Phantasy Star Online<br />2. An addicting drug that is taken through the eyes, highly addictive in large doses, smaller doses cause intrigue","time":1441170488374},"e.e":{"definition":"A chat face used for feelings like disgusted, wincing, and even sometimes a happy grin. Meant to look like a face with squinted eyes, so however and whenever you would do that. An apostrophe is sometimes used for apprehension&#x2f;nervousness. (e.e&apos;)","time":1441170537743},"race":{"definition":"A competition.","time":1441170651068},"rave":{"definition":"1) n. any gathering of people centered around listening to and dancing to electronic music, as played by a set of live djs.  Originated in 1989 in the UK as underground, often illegal gatherings in abandoned warehouses.  Often characterized by the positive, psychedelic atmosphere, influnced often (but not always) by drugs and casual sex.<br /><br />2) v. to dance in a style characteristic of dancers at raves, synonymous with fluid, liquid","time":1441170918343},"idefk":{"definition":"I Don&apos;t Even Fucking Know.<br /><br />Usually said when your really do not fucking know.<br /><br />xD.","time":1441172306926},"racist":{"definition":"If you&apos;re a white man, this is what you are. It doesn&apos;t even matter if your wife is black and you have an adopted child from India, or how many black friends you have, somehow you&apos;re going to end up being a racist according to how the media portrays the white man as &quot;racist whities&quot;.<br /><br />All of this is funny because the white man is the one that is stereotyped as being racist, which is hypocrisy at its best. It&apos;s racist to assume that white men are racists.<br /><br />If you don&apos;t get offended by racial insults, then you&apos;re apparently racist too, but an actual racist would get offended by it. When you hear a certain word too much (I&apos;m sure we&apos;ve all heard &quot;cracka&quot; hundreds of times thanks to standup comedy) then you become desensitized to it.<br /><br />Well, that and the words white people get called sound stupid or non-offending. &quot;cracker&quot; came from cracking whips. Indiana Jones cracked whips too, and he was a badass. &quot;honkey&quot; sounds like some kind of gigantic sandwich, and &quot;white boy&quot; makes you seem like the lone white kid in breakdance movies that stands out amongst the other races and white kids. Most people only really think of rednecks when they think of &quot;white trash&quot; so they don&apos;t get offended by it if they&apos;re not rednecks.","time":1441172320980},"superior":{"definition":"The feeling of being better than others.","time":1441172709482},"imao":{"definition":"In My Arrogant Opinion","time":1441172907238},"left":{"definition":"The hand that never gets laid.","time":1441173327599},"right":{"definition":"perfect, good, flawless","time":1441173332242},"police":{"definition":"The biggest gang in the world.","time":1441173727467},"gril":{"definition":"A poorly spelled version of &quot;girl&quot;.","time":1441174027127},"girl":{"definition":"A younger form of a woman. If you tried to have sex with a girl, you&apos;d be arrested, you damn pedophile.","time":1441174028821},"woman":{"definition":"  Beings not seen or touched by 98% of the men who have posted on this subject thus far.  <br />  Highly attracted to males of the species who are reasonable to look at, have jobs, are relatively kind, sometimes take out trash, and treat them like equals (not superiors, not inferiors -- equals.)  Happily give [blowjob]s in return.   <br />  Prefer large [dick]s.  Secretly laugh at guys who convince themselves that size doesn&apos;t matter.  <br />  Are paid seventy five cents for every dollar a man makes in the exact same job, same demographic, and same education level.<br />  To those men who cannot procure them (because said men are too mean, stupid, sexist, ugly, and unaccomplished) they cause intense feelings of failure, hatred, prejudice, violence, and need to post on boards stereotyping all women with one narrow, negative definition.  Said men then jack off alone.    <br />  When said beings reject such specimens of men or express an intelligent opinion, they are [bitches].   <br />  When they don&apos;t put out, they are also [bitches].  When they do, they are [sluts].        ","time":1441174036428},"spoopy":{"definition":"Something that is funny and spooky at the same time.","time":1441174172934},"freehugs":{"definition":"The act and art of Rape and or Raping.","time":1441175593098},"pepe":{"definition":"The Most Powerfull being in the whloe universe after Chuck Norris, he&apos;s indestructible and invincible, some people think he is only a myth, but he&apos;s 100% Real","time":1441175628338},"yee":{"definition":"You say Yee if you&apos;re hella hyped off what you do..For instance, IN THE BAY AREA! It&apos;s poppin pills of the block, it&apos;s like you&apos;re hella hot off something you&apos;re not even on.","time":1441175663785},"caucasian":{"definition":"1- The incorrect term used to label a &quot;white&quot; man or woman. The word Caucasian refers to a person who is from the region of Caucasus, which is in Europe bordering Turkey and Iran. Therefore, I am not a Cauasian being that I am not from Caucasus. I am, in general, European. Also I am not &quot;white&quot; being that I do not blend in with white paint, or white paper. I prefer to think that I have some amount pigmentation in my skin, thank you very much. ","time":1441175944399},"asian":{"definition":"the race with the hottest girls. ","time":1441176020587},"femboy":{"definition":"A young boy who presents extensive feminine mannerisms and actions often blurring the line between a boy and a girl.  Can be confused with a cross dresser, but it usually refers to boys at very young age or in their teens.  Commonly used to define gay boys who dress like girls, but some can be straight too.","time":1441177273647},"sd":{"definition":"San Diego","time":1441178076853},"sd'd":{"definition":"Serious Deep Dicking.","time":1441178079977},"dicking":{"definition":"This is a term used to describe the act of hardcore sex or fucking.","time":1441178094043},"apex":{"definition":"Located in North Carolina; home of the Cougars, the Cougar Crazies, &amp; Bojangles. The high school hosts mostly rednecks,jocks, stoners, &amp; hot cheerleaders but with some miscellaneous bmw&#x2f;mercedes drivers because of it&apos;s close border with [Cary]. The guys are mostly jerks with the ultimate goal of trying to sleep with every hot girl (with the exception of a few actually chill guys) and the girls know how to have [fun] and [party] hard. This is not to be TOO confused with [freak]. Also, it&apos;s the &quot;Peak of Good Living.&quot;","time":1441178600205},"ddos":{"definition":"Killing Anonops.","time":1441178984582},"dank":{"definition":"Also an expression requently used by stoners and hippies for something of high quality.","time":1441181224826},"engrish":{"definition":"A form of English characterized by bad translation from Japanese by someone who is decent at translating vocabulary but has a poor grasp of English grammar. Tends to be a word-by-word literal translation with humorous results for native English speakers. Engrish is most common in old video games and anime subtitles.<br /><br />The term &quot;Engrish&quot; comes from the fact that the Japanese language does not have distinct L and R sounds. They do have a consonant that is roughly somewhere in between these two sounds, but whether this translates to L or R in English depends on the situation (and therefore can be interpreted wrong.)","time":1441182645203},"clutch":{"definition":"to perform under pressure","time":1441189518161},"sat":{"definition":"Stupidity Assesment Test. A test given in high school that judges your worth as a human being. the lower the score, the more expendable you are to the government.","time":1441189857628},"american":{"definition":"Technically, an American is someone from the Americas - i.e. North or South America. However, it is so commonly referring to people from the USA that we&apos;ll just ignore that point for now.<br /><br />An American is someone who lives in the USA. Not all americans are overweight, ignorant pricks with an addiction to burgers and flag waving. Some of them are actually friendly, intelligent people!<br /><br />Remember, kids: just because meet or hear one person from a certain place doesn&apos;t mean that everyone from there is like it. Oh, and did I mention that the actions of the US government don&apos;t ALWAYS speak unanimously for every last citizen of the USA? Just wanted to clear that up.<br /><br />They do think some wierd things, though.. They call football soccer, American football football, aluminium aloominum, jam jelly and so on. But belittling them for differences like that would be a bit petty of me, wouldn&apos;t it?","time":1441190043673},"america":{"definition":"A country that claims the name of an entire continent to itself alone for no compelling reason.","time":1441190046617},"usa":{"definition":"The only country keeping penguins from coquering the Earth","time":1441190056420},"indian":{"definition":"A person of country India","time":1441190072672},"india":{"definition":"Where every company outsources our jobs to.","time":1441190075200},"philippines":{"definition":"The Philippines IS an ASIAN country.Most people who visit the country dont get a chance to see the beauty in it.You have to live there to actually appreciate this country. Also known to have the most beautiful beaches in the world.  ","time":1441190083202},"pnoy":{"definition":"Another word for a philipino person","time":1441190086235},"pinoy":{"definition":"Slang for Filipino male.","time":1441190092710},"pinay":{"definition":"the best kind of looking girl out there in the world","time":1441190097288},"us":{"definition":"Who all your base are belong to","time":1441190127032},"unitedstates":{"definition":"If you don&apos;t like it, go live in Canada mother fuckers.","time":1441190322783},"unitedstatesofamerica":{"definition":"[The World&apos;s Scapegoat]. <br /><br />America&apos;s a pretty big place, and its full of all different kinds of people everywhere you go. <br /><br />We&apos;re just a bunch of normal people living in a counrty with a messed up reputation and a mighty big spotlight for a mighty small man.","time":1441190331245},"canada":{"definition":"Here are some reasons to be proud to be Canadian:<br /><br />1. Smarties <br />2. Crispy Crunch, Coffee Crisp  <br />3. The size of our footballs fields and one less down <br />4. Baseball is Canadian <br />5. Lacrosse is Canadian <br />6. Hockey is Canadian <br />7. Basketball is Canadian <br />8. Apple pie is Canadian <br />9. Mr. Dress-up kicks Mr. Rogers ass <br />10. Tim Hortons kicks Dunkin&apos; Donuts ass <br />11. In the war of 1812, started by America, Canadians pushed <br />the Americans back...past their &apos;White House&apos;. Then we burned it...and most of Washington, under the command of William Lyon McKenzie who was insane and hammered all the time. We got bored because they ran away, so we came home and partied...Go figure.. <br />12. Canada has the largest French population that never surrendered to <br />Germany. <br />13. We have the largest English population that never ever surrendered or withdrew during any war to anyone, anywhere. <br />14. Our civil war was a bar fight that lasted a little over an hour.<br />15. The only person who was arrested in our civil war was an American <br />mercenary, who slept in and missed the whole thing... but showed up just in time to get caught. <br />16. We knew plaid was cool far before Seattle caught on. <br />17. The Hudsons Bay Company once owned over 10% of the earth&apos;s surface and is still around as the worlds oldest company. <br />18. The average dog sled team can kill and devour a full grown human in under 3 minutes. <br />19. We still know what to do with all the parts of a buffalo. <br />20. We don&apos;t marry our kin-folk. <br />21. We invented ski-doos, jet-skis, velcro, zippers, insulin, penicillin, zambonis, the telephone and short wave radios that save countless lives each year. <br />22. We ALL have frozen our tongues to something metal and lived to tell about it. <br />23. A Canadian invented Superman.<br /><br />BUT MOST IMPORTANT! <br />24. The handles on our beer cases are big enough to fit your hands with mitts on. OOOoohhhhh Canada!! <br /><br />Oh yeah... and our elections only take one day.","time":1441190334877},"communism":{"definition":"Communism is the final stage of the political reform started witha  revolution, according to Marx. First masses of workers will rebel in a industrialezed country; they will implant a socialist government in order to adapt the country for later changes. After private property is banished, and the people possess everything, thenthere will be no need for government, thus the state will be destroyed, to form a society with no social classes. It important to remember that Marx knew that the mentality of man needed to change in order of this to work. He believe in the concept of the &quot;new man&quot; who was humble and just. It is also important to remeber did not believe in a country alone with this structure, but he believed that the whole world adapt to this change. Given this, it is safe to say that no country has ever achieved communism, and anyone who has a sense of equality do agree with this utopia.","time":1441190350273},"europe":{"definition":"A place that from the beginning of time has only practiced the worse of Human behavior...Murder,Theft,enslavement homosexuality devil worship..ect..Europe since it&apos;s existence has stolen culture from other countries&#x2f;continents..Europe is the main reason the world is in the position it is in at the present time.","time":1441190355640},"pope":{"definition":"A holy dude witha cool hat and bullet-proff golf cart","time":1441190360707},"vaticancity":{"definition":"The smallest country in the world. It is where the pope lives. It is within the city of Rome.","time":1441190364360},"fracne":{"definition":"(noun) the condition of the skin in which there is an equal distribution of freckles and acne.","time":1441190381951},"france":{"definition":"France is a country that fought side by side with Americans on American soil during the American war of independence. Also, the counrty that built and gave as a gift the greatest symbol of America, the Statue of Liberty.","time":1441190385835},"britain":{"definition":"The only culture alive that can use the word &quot;cunt&quot; as any available part-of-speech.","time":1441190393427},"tyrant":{"definition":"(1) ruler who has unlimited power over other people, and uses it unfairly and cruelly<br /><br />also see [word]bush[&#x2f;bush]","time":1441190476042},"bush":{"definition":"The only presendent of the United States of America to be all most assassinated by a pretzil.","time":1441190481422},"castrate":{"definition":"The process of cutting off a male&apos;s genitals.","time":1441190993716},"uranus":{"definition":"The butt end (no pun intended) of every joke about planets in the 5th grade.","time":1441191034068},"kronos":{"definition":"Greek Titan of the universe. Son of Oranos, Father of Zeus. A prophecy wads foretold that Oranos would be defeated by his son (Kronos), who would be in turn defeated by his son (Zeus). Scared the prophecy might be true, Kronos swallowed every child alive who he and Gaia (his wife) gave birth too. Gaia, after having Zeus, feared for him and hid him on Earth. Eventually, Zeus and Gaia tricked Kronos into puking out their children (Poseidon, Hera, Hades,etc.) and Zeus declared war on Kronos. Kronos then gathered all the titans for battle. Zeus, however, called the gods and the thousand handed ones to his aid. The thousand handed ones then threw rocks and killed the titans. The survivos (including Kronos) and all of Kronos&apos;s minions were put in the hellish prison Tartarus where they would spend the rest of their days.","time":1441191149517},"percyjackson":{"definition":"A series of books written by Rick Riordan. The best fiction and Greek Mythology books.","time":1441191204818},"annabeth":{"definition":"Super cool name. Very unique like the girl who owns it. She is true to herself and never lets anyone bring her down.","time":1441191209718},"grover":{"definition":"noun,  One thousand dollars, from the portrait of Grover Cleveland on the no longer circulated one thousand dollar bill. First used in the 1984 novel Life Its Ownself by Dan Jenkins.","time":1441191217110},"desus":{"definition":"japanese for &apos;it is&apos;, often said at the end of sentences to seem cute or unwitting.","time":1441191220635},"chiron":{"definition":"There are several meanings.<br />1) A Centaur in Greek Mythology<br />2) The name of a planetoid discovered in 1977.<br />3) A small secret society of which very little is known, possibly originating within the medical profession.","time":1441191228226},"karma":{"definition":"The Buddhist belief that whatever you do comes back to you, e.g. if you do something good, something good will happen to you, and vice versa.","time":1441191239405},"poseidon":{"definition":"2nd most badass of greek gods and lord of the sea. Caused Hurricane Katrina.","time":1441191241987},"hades":{"definition":"Hades (Pluto), brother of Zeus.","time":1441191257288},"zeus":{"definition":"Zeus (Jupiter&#x2f;Jove), supreme ruler of the universe, originally god of thunder and the thunderbolt.","time":1441191263790},"jupiter":{"definition":"The biggest ball near Uranus","time":1441191283284},"jove":{"definition":"A fat joint that consists of half weed and half clove mixed together to create one amazing smoking experience. The name &quot;jove&quot; was created one night after rolling and then proceeding to smoke the jove on top of the Harvard University Arts Center. The jove&apos;s high hits you very hard and very fast, however it doesn&apos;t last as long as other highs.","time":1441191289100},"torpid":{"definition":"Slow.","time":1441191441453},"robo":{"definition":"robitussin or other cough medicines condaining DXM, which drank in large uinatities makes you trip balls and feel itchy.","time":1441191452861},"shovelknight":{"definition":"A shovel knight is a poorly armed player in survival roleplay situations, who usually defends him or herself with unrealistically powerful melee weaponry, usually a shovel.","time":1441191551417},"johncena":{"definition":"Right as you cum while getting a blowjob, pull out of her mouth and blow your load right into her eyes. <br /><br />Proceed to wave your hand in front of your face and go &quot;YOU CAN&apos;T SEE ME!&quot;","time":1441191559547},"idgi":{"definition":"I Don&apos;t Get It - see also [ris]","time":1441193031110},"ris":{"definition":"I don&apos;t get it. Just type RIS whenever you don&apos;t get something, and no-one else will get it too.","time":1441193034605},"how":{"definition":"a breed between a horse and a cow","time":1441193738400},"rum":{"definition":"(n) A tasty liquor. Goes great with coke. See Captain Morgan or Bacardi and enjoy.","time":1441193859443},"cum":{"definition":"1. n. Semen<br />2. v. To orgasm<br /><br />Usage Note: the word is spelled with a &apos;u&apos; to differentiate it from &apos;come,&apos; which has a... cleaner definition. ","time":1441193873674},"ede":{"definition":"a pothead","time":1441194819709},"buizel":{"definition":"Cutest [pokemon] ever, and a real badass.<br />Also, one of the main targets of [furfaggotry], besides [Lucario].","time":1441195578109},"squirtle":{"definition":"This pokemon will rape you with bubbles.<br />With a smile on its face.","time":1441195697952},"zard":{"definition":"An annoying person. Especially one who has little self awareness.","time":1441197642327},"geodude":{"definition":"The most gangster pokemon alive. He has no legs, but he doesn&apos;t need them, only arms. One for slappin&apos; bitches, and one for countin&apos; money.","time":1441197876454},"lmao":{"definition":"Laughing My Ass Off. Used online only.","time":1441197973340},"ayylmao":{"definition":"A common phrase spoken by extra terrestrials, the only phrase that does or ever will matter and could mean anything.","time":1441197981443},"ayy":{"definition":"1. A gentle &apos;ayy&apos; symbolises gratitude among friends, and is often used as a general greeting  2. A more agressive &apos;AAAYYYYYYYY&apos;, is used to show anger amongst a close group of friends or family.  EXAMPLES:","time":1441197993451},"aye":{"definition":"Scottish way of saying yes.","time":1441198025204},"pp":{"definition":"the child name for a penis.","time":1441198126360},"poop":{"definition":"Bodily waste of varying color, viscosity, shape, odor and texture. Usually exits the body through your pooper, speed, noise and degree of pain may vary depending on what you ate. ","time":1441198137966},"pewp":{"definition":"Fecal Matter produced by another being.","time":1441198146310},"poo":{"definition":"Poo well, they&apos;re are many types of poo in this universe<br /><br />There is<br /><br />THE SWEETCORN - Poo that has leftover sweetcorn from last night&apos;s dinner<br /><br />THE PELLETS - Little pellets of poo that comes out of your ass like a machine gun<br /><br />THE FIREBALL - A big poo that really hurts and leaving your ass hot, usually happens after a curry<br /><br />THE SLIPPY - A poo that swiftly moves out of your bottom that requires no wiping<br /><br />THE WATERHOSE - When a massive monsoon of shit comes out of your bottom and requires hours of wiping<br /><br />THE NEVERENDING STORY - An amazing acheivment is when a poo goes on and on and on.......<br /><br />THE STEAMY HEAPY - Boy, That is basically ONE MASSIVE SHIT!!!!!!!<br /><br />THE STICKY - When you have a poo stuck onto the hairs of your crack and requires hours of wiping (maybe a pair of scissors)","time":1441198151896},"pwe":{"definition":"Burmese (yeah, yeah, Myanmar): A dance festival, Canival of the Spirit Soul, danced by a Kadaw, who can be a cross dresser. The skilled Pwe dancer can move each buttock independently. The dance is to appease a spirit called a Nat.","time":1441198288315},"pwee":{"definition":"For use when you need a poo and a wee at the same time. also used whn you are sitting on the toilet and your poo and wee slips out at the same time.<br />Also a &apos;suprise pwee&apos; is when you are standing having a wee but you poo yourself.","time":1441198297054},"pweh":{"definition":"In Gamers Terms, It Means...<br />Parky Wants Evil Hat.<br /><br />In Reality...<br />It&apos;s The Cry Of Every Cute Drawing Of A Fluffy Thing Out There.","time":1441198301696},"poyo":{"definition":"1.Most commonly known from the video game character, Kirby. Its a sign of immaturity.<br />2.Many believe it may also be a form of poyopoyo, which is Japanese for toddling, which suits as Kirby is merely a baby.","time":1441198350695},"bayo":{"definition":"any person with this name is obvicusly a bad mother fucker , or AKA (BAMF)","time":1441198361553},"snoopdogg":{"definition":"He does his own laundry.","time":1441198635922},"boruto":{"definition":"The child&#x2f;children&#x2f;spawn of pre-existing fictional characters, sometimes nearly identical to the parents for no reason. Named after the son of [Naruto Uzumaki] and Hinata Hyuga in the [Naruto] manga.","time":1441198798937},"paranoia":{"definition":"No chance I&apos;m gonna give a definition.. What if someone&apos;s watching? :o<br /><br />&#x2f;me dons ninja mask","time":1441199610755},"donger":{"definition":"HEIMERDINGER = HEIMERDONGER","time":1441200305649},"heimerdinger":{"definition":"A high school teacher with large breasts and a ghetto booty.","time":1441200319307},"naughty":{"definition":"An adjective that describes a bad girl who needs to be punished (usually by fucking her), or a lady who wears tight, revealing clothing.  Can also apply to a female who is into [bondage].","time":1441200351076},"voltorb":{"definition":"Voltorb, this pokemon is a giant dick. Your pokemon with own it, but is has the move &apos;Self - Destruct&apos; and can easily wipe out one of your pokemon.","time":1441200691381},"electrode":{"definition":"The sexiest pokemon alive. This motherfucker will blow itself up in your face, attacking your weak point and causing MASSIVE DAMAGE. Trust me. It&apos;ll most likely OHKO you if you&apos;re not a rock or ghost type. I love Electrode because he resembles a male&apos;s testicle.","time":1441200717951},":0":{"definition":"An emoticon used to express shock, or surprise.","time":1441201109391},"cone":{"definition":"1. Metallic cone shaped item in a bong or pipe that the weed is burnt in. Another word for a &apos;bowl&apos;.<br />Really means &apos;cone piece&apos; or CP(abrev.)<br />2. Process of smoking weed from a bong.","time":1441201201450},"bone":{"definition":"1) (v) To have sexual intercourse. &quot;Your aim is to bone&quot; -- Tribe Called Quest (Classic example of a date rape).<br />2) (n) Penis. &quot;You can act like a doggy, and play with my bone&quot; -- Schoolly D. (Another poem [??]). 3) (n) One dollar.<br />3) (n) Core, soul. &quot;I&apos;m a rock hard trooper to the bone&quot; -- Public Enemy (Louder Than A Bomb)<br />4) (v) To bone out, as in leaving. &quot;They all got in the car and boned out&quot; -- Smokey (Friday [1995]).<br />5) (n) A joint. &quot;Smokin&apos; bones in the staircase&quot; -- Wu-Tang Clan (C.R.E.A.M. [1993]). <br />","time":1441201226016},"foo":{"definition":"An term used for unimportant variables in programming when the programmer is too lazy to think of an actual name.  The origin of such word is described in detail in [RFC] 3092.","time":1441201649617},"shu":{"definition":"Shu (Su) was the god of dry air, wind and the atmosphere. He was also related to the sun, possibly as an aspect of sunlight. He was the son of the creator god, father of the twin sky and the earth deities and the one who held the sky off of the earth. He was one of the gods who protected Ra on his journey through the underworld, using magic spells to ward off Ra&apos;s enemy, the snake-demon Apep. As with other protector gods, he had a darker side - he was also a god of punishment in the land of the dead, leading executioners and torturers to kill off the corrupt souls. His name might be derived from the word for dryness - shu, the root of words such as &apos;dry&apos;, &apos;parched&apos;, &apos;withered&apos;, &apos;sunlight&apos; and &apos;empty&apos;. His name could also mean &apos;He who Rises Up&apos;.","time":1441201758031},"lma":{"definition":"leave me alone.<br />Usually used in instant messaging","time":1441202242970},"bby":{"definition":"Abbreviation for [baby].  Is it really so hard to type one extra letter?","time":1441202362900},"tsundere":{"definition":"Tsundere is a slang born on the Internet, and it is a word to describe the nature of female anime or game characters. Tsundere is a word combining two words, &quot;Tsun Tsun&quot; and &quot;Dere Dere&quot;. Both terms describe attitudes of a person. &quot;Tsun Tsun&quot; is used for cold&#x2f;blunt&#x2f;curt attitude, while &quot;Dere Dere&quot; is used when a person becomes [spoony] in front of his&#x2f;her lover. <br />(Definition is from the game &quot; Tsuyokisu Cool×Sweet &quot;)","time":1441202722567},"eon":{"definition":"a long period of time","time":1441203268999},"dumb":{"definition":"1)Inabilty to speak, Mute<br />2)Lacking intelligence, stupid","time":1441203510767},"stupid":{"definition":"Someone who has to look up &quot;stupid&quot; in the dictionary because they don&apos;t know what it means.","time":1441203519749},"gramm":{"definition":"Written in response to a comment which contains serious grammatical errors. The first word of the response is &quot;gramm&quot; (with two m&apos;s) which may be followed by a remark that states that the original comment is either difficult or impossible to understand.","time":1441203678075},"grammy":{"definition":"Short for the word, Grandma.","time":1441203679323},"grammyaward":{"definition":"Used to be an alright system of giving merit to exceptionally good singers.  Now it&apos;s just a rigged [scam]fest where talentless idiots get awarded just for being on [MTV], [VH-1], or [B.E.T.].","time":1441203686867},"mtv":{"definition":"An evil corporation trying to brainwash the youth that nothing except being popular matters, and that you have to look good to be of any value, or else you are worthless. They also try to make kids think that blink 182 is &quot;punk&quot;, even though they play no actual punk music, most of it is just [rap].","time":1441203710438},"otakus":{"definition":"Otaku is the honorific word of Taku (home).<br /><br />Otaku is extremely negative in meaning as it is used to refer to someone who stays at home all the time and doesn&apos;t have a life (no social life, no love life, etc)<br /><br />Usually an otaku person has nothing better to do with their life so they pass the time by watching anime, playing videogames, surfing the internet (otaku is also used to refer to a nerd&#x2f;hacker&#x2f;programmer).<br /><br />In the Western culture, people confuse otaku to be something positive like &quot;Guru&quot;. If you think about it, it&apos;s not really good to be called a guru if it means you are a total loser who can&apos;t socialize with other people except through the Internet.<br /><br />Other Japanese words which have been confused by Westerners also include but not limited to: Anime, Manga, etc","time":1441203810789},"otaku":{"definition":"Otaku is the honorific word of Taku (home).<br /><br />Otaku is extremely negative in meaning as it is used to refer to someone who stays at home all the time and doesn&apos;t have a life (no social life, no love life, etc)<br /><br />Usually an otaku person has nothing better to do with their life so they pass the time by watching anime, playing videogames, surfing the internet (otaku is also used to refer to a nerd&#x2f;hacker&#x2f;programmer).<br /><br />In the Western culture, people confuse otaku to be something positive like &quot;Guru&quot;. If you think about it, it&apos;s not really good to be called a guru if it means you are a total loser who can&apos;t socialize with other people except through the Internet.<br /><br />Other Japanese words which have been confused by Westerners also include but not limited to: Anime, Manga, etc","time":1441203816724},"taylorswift":{"definition":"A twenty one year old pop singer with an average voice &amp; looks but is often wrongly described as a beautiful girl with an amazing voice. Can&apos;t keep eyes open. Is twenty one and a legal adult, but is still mentally fifteen. Is sickly obsessed with men and will date any boy she can get her hands on, no matter their age, just as long as they are a celebrity. The relationship lasts a couple of months at the most, then after they break up, her heart is somehow broken and she gets revenge. Her most common ways of getting revenge are writing shitty pop songs about him and then digitally adding banjoes, guitars, and fiddles so it will classify as a country song; Talking shit on him about him to the media; and making meaningless youtube videos of her playing barbies and reliving the breakup.","time":1441203991002},"iggyazalea":{"definition":"a white pasty female rapper from Australia who puts on a fake urban accent when she raps. She thinks she&apos;s all gangster when in reality she&apos;s a middle class Gussie who sucked dick all the way to the top. Usually Iggy Azalea fans get defensive when logical people criticize her on YouTube. They also claim she&apos;s the best female rapper to ever spit, which is ridiculous since there are much other talented female rappers like MC Lyte , Foxy Brown, etc. some even recognize her as a female Eminem. In reality she has no talent whatsoever.  Iggy Azalea is just an actor. An entertainer. Most of her videos &#x2f; songs rely on sexual appeal, as she&apos;s seen twerking and showing her nipples in some of her music videos. Rapping is just her conduit.  Most of her fans are also 12 year olds who have never heard of great artists like Tupac, Biggie, Nas, Rakim, Big L, etc.  Iggy azalea also cannot drop bars. Her flow is wack and whoever thinks she&apos;s good has a bad taste in music.","time":1441204062081},"stronk":{"definition":"A typo of the word &quot;strong,&quot; originating from competitive play of a game of Heroes of Newerth. Mostly used sarcastically because of it being a mistype.","time":1441204736311},"universe":{"definition":"A unified consciousness experiencing itself subjectively, looking for its reason for absence.<br /><br />We are solving ourselves.<br /><br />Each universe within the multiverse is like an octave of reality. As we understand there are 7 colours and 7 notes in a scale. There are also 7 levels of consciouness. Each octave of thought is a different dimension&#x2f;parrallel universe.<br /><br />We can only see into this reality just like we can only see one octave of light. Higher vibrations are out of view, and so are lower vibrations. The same goes for sound, only because particles are at much lower energy vibrations anyway, we can hear more octaves.<br /><br />Everything is looking to progress from a lower vibration to a higher vibration. At higher vibrations everything is less seperate. E.g. The frequency of T.V&apos;s is roughly 50hz, and so for us it seems smouth and one flowing picture. At lower frequencies we can see each individual frame.<br /><br />The idea is to become more unified. Emotionally, Love and Hate are the spectum of thought. Hate is seperation - lower frequencies of thought, love is unifaction - higher frequencies of thought. When we hate everything, then we suffer, because as we have hated everything, so everything has hated us. When we love everything, we find bliss, because as we have loved everything, so everything loves us. Very simple, yet so far, our species (humanity) has yet to see this obviousness.<br /><br />We have had glimpses into the truth of higher, more perfect, realities (known as heaven - which is only a word, the reality is so much more), but due to our misinterpretation of the truth due to our lack of understanding to begin with we have generated a game of chinese whispers through religions until our realisation that we were being controlled through half truths and misconceptions.<br /><br />Understand that these chinese whispers have passed through the minds of hatful people that wish to control and supress true knowledge from us. E.g. 200 years ago, we were being enslaved by christianity. Now, we broke free from childish interpretations of reality into something much worse. As we developed so did the system.<br /><br />We are now controlled by governments. Much more organised, much more controlling. Setting aside commandments for laws.<br /><br />There is only universal law, everything else is just a guideline. That being said, killing someone isn&apos;t against the universal law, but it is a hateful act and so the universe balances itself by mechanisms described in Buddhism as Karma. It is important to act as loving and compassionate as possible so as to enjoy everything and ascend in consciousness.<br /><br />Heaven is simply a higher vibration of reality, Hell doesn&apos;t exist. Or, we already exist in the lowest vibration of thought there can be. So this is technically Hell.<br /><br />God is Love, because love is unified and God is complete as one. Perfect like a sphere.<br /><br />Aside from all of the above. Most of us forget that we are just beings in a universe, and become so obsessed with our own petty lives we forget the bigger picture.<br /><br />The universe is like the breath of God. Moving from 0 - 1 - 0... The universe shall expand and contract from nothing to nothing. We shall live these lives over and over again.<br /><br />Though, in higher realities, because our frequency is much higher, so time appears slower. Our thoughts are very much more instintaneous because we exist as energy, so our thoughts are as fast as light. Yet, our thoughts now are controlled on a chemical level, and have to travel through nerves at less than 1&#x2f;100 the speed of light (possibly even less).<br /><br />We see things in a linear fashion. We see a begining - the &apos;Big Bang&apos; and so for us, there is an end - the &apos;Big Crunch&apos;. But time is just an illusion. When we develop higher understandings of reality, so shall we understand time in a different way. And so we shall forget the past, forget the future, and live completely in the present. The only thing that exists is the here and now, and so, when we live completely in the here and now, so time has no relevance, and so we find eternity in bliss, through love.","time":1441204956382},"tonguebath":{"definition":"the art of licking the ENTIRE body of your partner.  Not necessarily limited to just the area in between one&apos;s legs...(Boobs, ass, back...as in bathing)","time":1441206048836},"woohoo":{"definition":"A term for &quot;sex&quot; in the Sims 2 simulation game.  In order to keep it rated &quot;T&quot; for teen, Maxis needed to use &quot;woohoo&quot; instead of &quot;sex&quot;","time":1441206185046},"i'mlovingit":{"definition":"a stupid term that is used by mcdonalds, supposably stolen from viagra. mcdonalds has obvuiosly made a mistke in spelling it. fitst they shoulve pu it &quot;i am loving it&quot; then they mispelled it horribly, in which the real prase should be &quot;ailing vomit.&quot;<br />mcdonalds is starting to realize that people are obviosly hating their food, so they put more chemicals in it.","time":1441206226644},"mcdonald's":{"definition":"A place where people eat alot, get fat, and then sue to get money.","time":1441206256045},"sasori":{"definition":"Sasori is a Missing-nin from Sunagakure (Hidden Sand). In first appearance, he is a hideous hunchbacked figure with a poisoned scorpion-like puppet tail attached. He is known as Akasuna no Sasori (Sasori of the Red Sand), the creator of Kankuro­&apos;s puppets and a genius puppeteer himself. His first appearance is during their mission to Sunagakure where Deidara is to capture Gaara. After Gaara&apos;s capture, Kankuro­ attempts to stop the Akatsuki duo, but to no avail. Sasori battles the enraged brother, nearly killing him and destroying his puppets in the process with little to no effort. It is revealed that he left the village 20 years before, but the background on his crimes is unknown at this point. After hearing news of his return, Sasori&apos;s grandmother Chiyo, decides to join Team Kakashi in search of the duo and to rescue Gaara.<br /><br />Sasori and Deidara have quite different views of what art is. Sasori believes art is something that should last, while Deidara believes art is fleeting. Although Deidara respects Sasori&apos;s view, Sasori doesn&apos;t seem to respect Deidara&apos;s.<br /><br />During combat, and possibly all the time, Sasori &quot;wears&quot; his puppets and controls them from inside, thus eliminating the puppeteer&apos;s weakness of being an exposed target. His favorite puppet is named &apos;Hiruko&apos;, according to Chiyo. Hiruko has a mechanical tail extending from the mouth of what appears to be a mask on his back, the left arm is something that appears to be a large studded projectile capable of firing shrapnel, and the clearly artificial mouth opens to reveal a projectile-firing device. What makes him even more frightening, however, was the fact that Sasori makes his puppets out of human bodies, as he stated in the quote. So far, he has a collection of 298 hitokugutsu, (&quot;person puppets&quot;) made out of human bodies. And to show this, after he was forced to abandon Hiruko, he summoned a hitokugutsu of the Sandaime Kazekage. This puppet was made from the living body of the Kazekage, and thus is able to retain some traits and jutsu of the Kazekage while he was alive.<br /><br />The truly frightening aspect of Sasori, however, was that his real body is actually as young as he was, and bishonen too. The secret of his youth is revealed after the Kazekage puppet is destroyed: he had made himself into a puppet. His stomach is now hollow, allowing a thick cable to be coiled and stored inside; the cable can act both as a stinger and a support for his body. On his back, a pair of arms, equipped with five large claws, is mounted, and on top of the spine is a scroll holder holding four scrolls, used to summon the puppets for his Aka Higi: Hyakki no Soen (Red Secret Technique: Performance of a Hundred Puppets). Each of his hands now mounts a flamethrower nozzle. His right chest contains a hidden compartment, which can spin unknown numbers of chakra strings to control one hundred or more puppets. Over his heart is a large talisman that has the kanji (Sasori, &quot;Scorpion&quot;). His puppet body can also be pieced back together after being splintered into multiple pieces; this is because the only part of him which is still &quot;alive&quot; (and thus able to control chakra) is his heart, located under the talisman. He can also easily transfer the talisman, and by extension himself, between puppets. (How he transfers his face&#x2f;facial features, as depicted in the manga, is not explained.)<br /><br />The talisman also proved to be his only weakness, as Chiyo used his mother&apos;s and father&apos;s puppets to stab him through this location in a manner similar to the hug that he desired. In a flashback in the manga, it is reveal that the first puppets Sasori ever made are in his parents&apos; images. Interestingly, Chiyo seemed to believe that, in the end, Sasori allowed himself to be killed (as she believed he saw the attack coming and chose not to react). At the end of the battle, Chiyo, Sasori, and Sakura are all fatally wounded, but Chiyo uses a jutsu she originally developed for Sasori, &quot;to give life to a lifeless puppet,&quot; to save Sakura&apos;s life. The jutsu is meant to take the life of the user, but as Sakura wasn&apos;t dead, Chiyo survived this use of the jutsu.<br /><br />Sasori&apos;s last words (as a reward to Sakura for defeating him) were that he has a spy in Orochimaru&apos;s ranks, whom he was supposed to meet with in Kusagakure in ten days. This spy is revealed to be Yakushi Kabuto. However, Orochimaru had long ago undone the jutsu on Kabuto that kept him (and presumably others, such as Yura) loyal to Akatsuki, and Kabuto remains loyal to Orochimaru.<br /><br />According to the front cover of volume 31, Sasori&apos;s hair is bright red. His eyes have the same color","time":1441206375383},"moan":{"definition":"typically a noise of passion or pleasure spoken or shouted by someone during sex.","time":1441206927596},"ml":{"definition":"&quot;mind laughing&quot;<br />abbreviation used mainly in instant messaging to express laughter to oneself. similar to lol, but without actually producing sound.","time":1441207131791},"enrique":{"definition":"ladies man. conceited. man whore. loves to walk in parks. loves hookups. will call an asian &quot;higga&quot;. wannabe b-ball player. but all around a best friend","time":1441207529823},"ebs":{"definition":"Contraction of &apos;emo bullshit&apos; - is usually extended to &apos;ebsing&apos; and&#x2f;or &apos;ebsed&apos;.  Used to describe the irrational, spontaneous and extremely anti-social and negative behaviour often displayed by &apos;emos&apos; and &apos;scene kids&apos;. Can be extended to people outside this idiom, in which case the inferred intensity of the &apos;emo bullshit&apos; can vary greatly depending on the context. Can also be applied to objects.","time":1441207583887},"tbd":{"definition":"Acronym for &quot;To Be Determined&quot;.  Commonly used in business.","time":1441207607584},"bums":{"definition":"1. A homeless person.<br />2. British&#x2f;Australian equivalent of &quot;[butt]&quot;.<br />3. To [fuck] someone up the [arse].","time":1441207838962},"lenny":{"definition":"a fine, sexy ass, tall guy.  <br />a well rounded individual.<br />intelligent<br />ladies love him","time":1441208748831},"dong":{"definition":"1. The penis.<br />2. The unit of currency of Vietnam.  At press time, 1 US dollar is roughly 15000 Vietnamese dong.","time":1441208797606},";9":{"definition":"Originated from failing to hold shift while typing [:(] , this is the face of someone winking and licking their lips.  Many people like to interpret this differently. I suggest you do the same.","time":1441209105454},"sevendeadlysins":{"definition":"&lt;N, theo.&gt;<br />Also known as the finer things in life. Originally arranged in the 6th century by Pope Gregory, the seven are:<br /><br />1. Pride - An attitude of personal superiority, almost universally accredited as the most useful of the sins.<br /><br />2. Envy - desire for the belongings or traits of others.<br /><br />3. Lust - The craving of &apos;earthly pleasures,&apos; if &apos;earthly pleasures&apos; are defined as sex.<br /><br />4. Avarice - Greed; the desire of riches, [bling], or Nikes(c).<br /><br />5. Wrath - Outpouring of destructive or hurtful behavior of thought.<br /><br />6. Sloth - An animal thats so inert that moss grows on it. The sin itself is easy to piece together from there.<br /><br />7. Gluttony - The urge to intake more than is necessary for day-to-day functions.","time":1441209257633},"gitgud":{"definition":"To get better. To &quot;Get Good&quot;.","time":1441209330548},"gw":{"definition":"Short for the famouse online CORPG, Guild Wars that kicks any other mmo in the balls. (www.guildwars.com)","time":1441209888926},"napoleon":{"definition":"A short dead dude.","time":1441210044054},"hitler":{"definition":"verb, to Hitler someone; ie, smudge poop on their upper lip, creating the illusion of a Hitler-style moustache.  Usually performed while the victim is sleeping.","time":1441210059090},"helix":{"definition":"The outer rim of the upper part of the ear, which curls. When pierced, the piercing is often referred to as a &quot;cartilage piercing&quot;, although the term is no longer specific enough since different ear piercings are gaining popularity which are located in abnormal parts of the ear (all of which are through cartilage... except in the lobe).","time":1441210369265},"fb":{"definition":"Fuck Buddy. A person who are having casual  sex with on a regular basis, but are not involved in a romantic relationship with.","time":1441210552281},"facebook":{"definition":"a stalkers dream come true","time":1441210562327},"instagram":{"definition":"Every hipster&apos;s favorite way to make it look like they take really classy pictures when really they are still using their phones. Yeah, you might look really cute&#x2f;old school&#x2f;vintage&#x2f;retro, but it&apos;s still a cell phone picture.","time":1441210568696},"twitter":{"definition":"A stupid site for stupid people with no friends, who think everyone else gives a shit what they&apos;re doing at any given time.<br />Also lacks the functionality of other social networking sites, not that it matters because just like Twitter all those sites suck anyway. <br /><br />","time":1441210581789},"ty":{"definition":"Net nerd version of &quot;thank you&quot;","time":1441211079706},"coma":{"definition":"Extended nap.","time":1441211947608},"bbl":{"definition":"be back later<br />used in internet chatting.","time":1441212178672},"bloop":{"definition":"When a girl is riding a guys penis and he cums inside of her vagina. She then gets up and the cum drips out of her vagina making a bloop sound.","time":1441212253429},"^^":{"definition":"Face, pretty much derived from the koreans, that signifies happiness or signifies that you just owned somebody.","time":1441212301171},"jk":{"definition":"Just Kidding!","time":1441212321457},"corny":{"definition":"Trying to be cool, but ultimately very uncool indeed, and often even extremely embarrassing","time":1441213089002},"glasscannon":{"definition":"Refers to a person, weapon, or vehicle which has a high output, but a low defense, life, durability, etc.","time":1441213096011},"mascara":{"definition":"an item of makeup that people (usually women) wear to make their eyelashes look longer&#x2f;thicker&#x2f;darker&#x2f;curlier.<br />Can&apos;t be put on with your mouth closed.","time":1441213129255},"pssh":{"definition":"Used in place of &apos;Yeah Right&apos;, &apos;As if&apos;, &apos;Whatever&apos;.<br /><br />It is just way cooler to say it.","time":1441213237812},"dolphing":{"definition":"The act of slapping a female across the face repeatedly with a penis.","time":1441213646941},"graveler":{"definition":"A person who when having sexual intercourse with his partner on pavement creates potholes and crushes it into gravel as a result.  This is possible because during climax, the intensity of the intercourse is so vigorous and forceful.","time":1441213810920},"golem":{"definition":"A Golem is a sort of creature whose name became popular in several [RPG]s such as Dungeons &amp; Dragons, [Pokémon], and [Chrono Trigger].<br />Traditionally, Golems are rocklike creatures whose structure is covered with a near-impenitrable stone.<br />In the case of D&amp;D, there are several variations of Golem that use elements other than Stone, such as Iron and Flesh (which is a nod to [Frankenstein]).<br /><br />There are mixed views as to exactly what a Golem looks like, but the general view is that a Golem is large, perhaps larger than a human, and is covered in a rocky mass. It is not all that pretty, and sometimes features a rather ugly mouth.<br /><br />Golems seem to be submissive creatures, as they never really act on their own, and are controlled by whoever Summons&#x2f;Finds them. Thus, they are not necessarily good or evil in spite of their evil-ish appearance.","time":1441213826877},"tf2":{"definition":"Sequal to the PC hit multiplayer title Team Fortress Class by Valve.  Oringally slated for release in 2001, finally released on October 10, 2007 in the Orange Box along with Half-Life 2 Episode 2 and Portal.  ","time":1441213869611},"bulbasaur":{"definition":"A grass type pokemon. Evolves into Ivysaur, and then Venusaur. Attacks include Leech Seed, Vine Whip, Razor Leaf, and Solar Beam. Walks on all fours, and has a blub on its back. Weak against fire and flying pokemon.","time":1441213871322},"ivysaur":{"definition":"Pokemon #002<br /><br />Type: Seed<br /><br />Elements: Grass, Poison<br /><br />Height: 3&apos;03<br /><br />Weight: 28.7 lbs.<br /><br />When the bud on it&apos;s back starts swelling,<br />a sweet aroma wafts to indicate the flower&apos;s coming bloom!","time":1441213890425},"venusaur":{"definition":"A bigass dinosaur [Pokemon].","time":1441213906181},"rukia":{"definition":"Kuchiki Rukia is the female lead in the hit anime and manga series Bleach. She is 144cm tall with short black hair which has a single strand hanging down the middle of her face. <br /><br />She is a [shinigami], or Death God, but loses her shinigami powers to Kurosaki [Ichigo], the male lead, in the first part of the story. She later regains her powers. <br /><br />The love pairing, [ichiruki], is the pairing that refers to Kurosaki Ichigo and Rukia.","time":1441214115557},"ichigo":{"definition":"Hot, sexy, and badass main character of the hit manga&#x2f;anime Bleach. Bugged by most about his bright orange hair. Inherits shinigami powers from the shinigami Rukia and continues her job of fighting Hollows with his big-ass sword :D","time":1441214118484},"cuckolded":{"definition":"Cheated on. Had your spouse or mate be unfaithful to you.","time":1441215622355},"laggy":{"definition":"the condition that some noob crys about because he connected to a server half way around the world","time":1441215999109},"js":{"definition":"short for jordans (shoes worn by michael jordan)","time":1441216854887},"bobsaget":{"definition":"The lowest card in a Full House.","time":1441216940155},"weeabo":{"definition":"A person who&apos;s totally obsessed with Japanese culture; [Wapanese]; Wanna be Japanese.","time":1441217285818},"fettywap":{"definition":"Handsome young rapper&#x2f;singer from Paterson, NJ known for his song &quot;Trap Queen&quot; and his squad Remy Boyz ... 1738","time":1441217559332},"glomp":{"definition":"v, to glomp<br />NOT sexual, it is the action of one person lovingly (and dramatically) attacking another with a hug.<br />A glomp is often preadatory and lies somewhere in the grey area between a caring embrace, and a flying leap to tackle someone.<br />The term is used extesively in [anime] culture, as well as online in text form (anime because many anime characters do this often, and online because it is short and descriptive).","time":1441217607454},"lamentation":{"definition":"A cry of sorrow or pain","time":1441217888257},"greatmigration":{"definition":"It&apos;s when you put your [anus] up to a girls [vigina] and you [shit] right into it until she&apos;s full.","time":1441218028807},"vampire":{"definition":"Something that does not sparkle.","time":1441218047673},"buzzed":{"definition":"Means that you have begun the process of entering an alcoholic beverage into your system.  You are now ready to begin step two: drowning yourself in booze.  After step two is complete you may feel very happy, and it might be a little hard to walk, you have now completed the process and you are officially drunk.  Congratulations.","time":1441218242701},"shudder":{"definition":"A freaking awesome guy, full of aspirations and dreams. He writes awesome songs, and can play some kick-ass drums. He is quite the lady-killer, and an amazing person to talk to.","time":1441218578991},"bunder":{"definition":"Uk slang, common in private schools.  Bunder is a portmanteau of the words [banter] and [chunder], and used to mean vomit&#x2f;to vomit.  Usually refers to vomiting after a fun night of heavy drinking and partying (hence the inclusion of the word &apos;banter&apos;).","time":1441218711261},"blunder":{"definition":"A grievous mistake that embarrasses (or should embarrass, at least) the committer.","time":1441218738470},"harvard":{"definition":"See &quot;Grade Inflation&quot; [Grade Inflation]","time":1441218929407},"harvarduniversity":{"definition":"A university for the smart? No entirely wrong. A university for white people who have a lot of money and a lot of connections. OR a university for native americans. If you&apos;re a native american, come on in. we need to fill our quota.","time":1441218955334},"fabio":{"definition":"person who girls with no lives obsess over. they have no chance with this person, but will not take this for an answer. instead they continue to fantasize about trips they will take with this person and times they will get to see him.<br /><br />","time":1441218981886},"pootie":{"definition":"A piece of ass. Popularized by the movie &quot;Pootie Tang&quot;.","time":1441219033627},"incest":{"definition":"The way the British royal family keeps itself German.","time":1441219430828},"nan":{"definition":"Nan - a strong, beautiful woman. A survivor. The best big sister, mother, wife, aunt and friend.","time":1441220110493},"b":{"definition":"A greeting to one of your homies","time":1441220135199},"bj":{"definition":"abbreviation of [blow job] or [blowjob]. Occurs when a female puts a man&apos;s penis into her mouth and sucks on it while tonguing the head. Apparently very popular among young teens, equivalent to kissing.","time":1441220137607},"glenquagmire":{"definition":"Sex-addicted character from Family Guy. Is usually compared to Charlie Sheen. Loves to giggidy girls gshmoggus&apos;s","time":1441220179970},"quagmire":{"definition":"Sex crazed neighbor of Peter Griffin in Family guy.  ALL RIGHT.","time":1441220198690},"hmu":{"definition":"Hold my unicorn.","time":1441220326799},"sexc":{"definition":"person sexier then anyone that u can SEE is known as sexC","time":1441220612828},"hoodrat":{"definition":"A girl who sleeps with various men in the neighborhood. Usually noticeable via her slacking standards of personal care. ","time":1441220873962},"obd":{"definition":"Stands for On-board Diagnostic. It is an electronic interface used on cars to gain access to the codes stored in the engine management computer. From the late 1980s until about 1995 or so, OBD was the industry standard. Since then, OBDII has been the common diagnostic interface.","time":1441221224857},"tf":{"definition":"The Fuck. Most commonly used as a shortened WTF. However, TF is used in instances when WTF takes too long to be said. TF is also used in a more exclamatory sort of phrasing.","time":1441221246171},"wutang":{"definition":"The second best Tang in the world.  Next to grape, I mean [poon] of course.  Consists of the RZA, GZA, ODB, Inspectah Deck, Raekwon the Chef, U-God, Ghostface Killah, Masta Killa, and Method Man.  Also a large syndacyte consisting of Cappadonna and Killah Priest to name a few.  Easily the best rap group with sharp lyricism named after the legendary Wu Tang sword of Chinese mythology.  Most songs involve a kung-fu intro followed by great production and outstanding lyrics.  All nine hail from Shaolin (Staten Island) and have produced 4 group albums in addition to MANY solo projects.","time":1441221284019},"yg":{"definition":"Young Gangsta- OG that is young","time":1441221360182},"enriqueiglesias":{"definition":"the greatest latin singer of all time.  Known for his elegance, beauty, dreaminess.","time":1441221377587},"babymomma":{"definition":"Dead beat mothers, of all these nigger babies born out of wedlock, thus are now being supported by Caucasian tax dollars. ","time":1441221387608},"rickymartin":{"definition":"==&gt;  very, very gay.","time":1441221407983},"babydaddy":{"definition":"Usually a broke ass black man; Who you met through a friend and had sex wit when you was upset and confused. Now you don had his baby and he dont pay child support and denies yo son ray ray.","time":1441221473649},"henny":{"definition":"The urban slang word for Hennessy congnac.","time":1441221506328},"gary":{"definition":"A man who is incredibly sexy, but also funny.  He tends to be a girl&apos;s dream guy.  He&apos;s also really good in bed. ","time":1441221559830},"trufflebutter":{"definition":"Truffle butter is when you pull you dick out of the asshole an continue fucking her pussy, and the tan buttery substance around her pussy is truffle butter.","time":1441221613522},"cookies":{"definition":"a woman&apos;s wet vagina","time":1441221650647},"bluewaffles":{"definition":"Go to Google.com type in &quot;Blue waffle&quot; and then click the &quot;I&apos;m feeling lucky&quot; button.<br />Then you&apos;ll know what the fuck it means &gt;.&lt;","time":1441221659641},"rack":{"definition":"set of breasts","time":1441221681122},"pawg":{"definition":"Phat Ass White Girl; girl with a phat ass and is white; commonly said by black males.","time":1441221699211},"pokemon":{"definition":"A disease that started in Tokyo.  It first infected Gameboys in Japan in 1995.  Then in 1998 the disease infected Gameboys in America.  Soon channel WB11 was infected too, and now Cartoon Network.  The ever-so-popular &quot;Gameboy Advance&quot; systems got infected in 2002, and still is.  In 1999 the disease started spreading via cardboard aka &quot;Pokemon Trading Card Game&quot;.  &quot;Nintendo 64&quot; and &quot;Nintendo Gamecube&quot; are infected too.  The disease is also spreading via plastic and metal in the toy isles at Wal-Mart, K-mart, toys-r-us, and every other toy store.  It is now July 2004, almost 10 years after the start of this addicting, argument instigating disease and it is still out there, but not as bad as its most powerful years(1999-2001).","time":1441221719491},"jug":{"definition":"A woman&apos;s breasts. Especially when large and shapely.","time":1441221772909},"sarah":{"definition":"The name &quot;Sarah&quot; is translated from the Hebrew language. It means &quot;Princess&quot;...and rightly so!","time":1441221790250},"kevinhart":{"definition":"A not very funny comedian&lt; I have no idea how this guy has gone anywhere in comedy. Some of his jokes are everyday ordinary silly but nothing really stands out. The only thing he knows how to do is make fun of his family, which isn&apos;t even that funny Ok, Kevin we all know how to make fun of our families, definitely doesn&apos;t take a genius! And quit pulling the poor me card!","time":1441221824685},"beast":{"definition":"UK Slang- a person who is very good at something","time":1441221835213},"swift":{"definition":"Being very quick and stealth like thunder and lightning combined, if you are truely swift when u walk across water you shouldnt even touch it.","time":1441221844153},"beasto":{"definition":"Someone that has sex with animals in the ass with no lube.","time":1441221857126},"nymph":{"definition":"1. a young, usually slim and slightly-built female, considered  sexually desirable;<br />2. if short for [nympho] or [nymphomaniac] : a woman who craves as much good sex as she can get, but for obvious social reasons at least partly on her own terms","time":1441221908648},"the5":{"definition":"The &quot;5&quot; is a common saying from people that live on the eastside of Seattle, specifically East King county. It is a representation of the area code 425.","time":1441221931767},"masshole":{"definition":"What the resident&apos;s of Northern Maine call the people from Southern Maine, most of whom migrated from Massachussetts.","time":1441221980668},"nymphomaniac":{"definition":"Hypersexuality: a female whose sex drive is obsessively high. Considered a mental illness, coloqiually means a horny girl. Not to be confused with slut or skank where one&apos;s sexual dignity is pathetically low, nymphomania is simply related to an abnormally high sex drive.","time":1441222009786},"straight":{"definition":"to be ok with how things are going.","time":1441222026266},"kendra":{"definition":"A most clever but stunning individual. Formally known as the most beautiful woman on the planet. Any man would be lucky to have her even in their dreams.","time":1441222058153},"anthony":{"definition":"Sexy,Cute and all round smooth talker. <br /><br />Anthony has been mentioned as one hunk of a Sex God.<br /><br />Due to this increasingly used term for anyone being good in bed, it has made its self known within the streets!<br />","time":1441222094979},"nickiminaj":{"definition":"a female rapper from the US who is so completely insane that she makes Lady GaGa, look kind of boring","time":1441222110329},"kfc":{"definition":"The [PeTA] said that the main ingredient in KFC chicken is cruelty. Cruelty must taste goddamn good.","time":1441222156965},"mcgangbang":{"definition":"This is a tasty sandwich combination from McDonald&apos;s.  Off the Dollar Menu you order one double cheeseburger and one Spicy McChicken sandwich.  Spit the double cheeseburger between the two patties, and then put the entire Spicy McChicken sandwich inside the double cheeseburger.  This originated from Daytona Beach McDonald&apos;s Restaurants.","time":1441222191734},"buzard":{"definition":"Family ties.. When a family bands together to hold eachother down and take care of business as one when one of the family is in great danger or trouble.","time":1441222216931},"gun":{"definition":"A complex arrangement of metal parts that is capable of discharging a lead peice at very high speeds, high enough to penetrate fleash and thin slabs of wood.  Serves as humankind&apos;s (so far) permanent replacement for spears, staffs, swords, daggars, etc. as most effective weapons.  Most commonly used for self-defense, murder, killing hostiles, recreational shooting, the standard issue weapons for armies, militias, etc.","time":1441222241460},"rosalee":{"definition":"An intelligent girl who is stubborn and likes to get her way. Her spontaneous and gorgeous nature lures guys in. Although sometimes she might act uninterested towards a guy doesn&apos;t necessarily mean she&apos;s not into him. She is a natural flirt who tends to be lustful, and prideful in ocassions. But all in all she&apos;s a very generous person who takes care of others. She is a person who accomodates according to the situation and is good at acting.","time":1441222350580},"mk":{"definition":"Shortened version of umkay, which is slang for okay.","time":1441222423393},";v":{"definition":"Expression used to signify a wink with the addition of the &apos;knick&apos; sound coming from the mouth. To clarify the sound made, sucking air back into your mouth while pressing your tongue against the roof of you mouth (all on one side of your mouth) enables the sound. The expression can be used to convey the &quot;I know&quot; or the &quot;That&apos;s right&quot; statements&apos; emotions. A person may use this same expression daily in those &quot;I told you so&quot; and &quot;that&apos;s what I thought&quot; moments, as well.","time":1441222600638},"niggachu":{"definition":"A lazy black pokemon usually found living in crappy conditions and surviving off of fried chicken. This pokemon can be caught with any kind of ball due to the fact that niggachu is too lazy and stupid to fight back. Also you may lure this pokemon closer to you by using food stamps. some of niggachu&apos;s special abilities include but are not limited to: using rap music to lure enemies to sleep, being able to flee much quicker than other pokemon, and last, using hypnosis to make you think that this pokemon is not lazy and black. When niggachu is given a fried chicken stone it evolves into electronig which can be healed with watermelon and purple drank.","time":1441222732350},"brony":{"definition":"A name typically given to the male viewers&#x2f;fans (whether they are straight, gay, bisexual, etc.) of the My Little Pony show or franchise. They typically do not give in to the hype that males aren&apos;t allowed to enjoy things that may be intended for females.  Other spellings: Bronie<br />Plural spellings: [Bronies]","time":1441222749126},"hon":{"definition":"Short for honey, a term of endearment","time":1441222799951},"stahp":{"definition":"In memes simply stop, usually meaning stop doing something horribly wrong.","time":1441223033202},"lmfaoirl":{"definition":"LMFAO is the meaning of Laughing My F*cking Ass Off which adding the IRL meaning In Real Life. So altogether it would be Laughing My F*cking Ass Off In Real Life.","time":1441223167260},"*o*":{"definition":"[*.*]<br /><br />Text face of meaning greatly confused, shocked, or surprised.","time":1441223247585},"kh":{"definition":"KH is the simplified version of Kingdom Hearts. This is a very popular RPG for the Playstation 2 game console. All you have to know is: Disney characters, Square Enix, and addicting!","time":1441223432847},"killer7":{"definition":"The best game ever created. The player is emmersed in a split reality where terrorism is snuffed out by abolishment of air travel, nuclear power, and the Internet. Unfortunately, terrorism prevails after a UN conference gets bombed by a &quot;Smiling Face,&quot; also reffered to as a Heaven Smile. Players assume the role of assassin Harman Smith and his seven personalities, Con Smith, Coyote Smith, Dan Smith, Garcian Smith, Kaede Smith, Kevin Smith, and Mask de Smith. You try to stop the flow of terrorism caused by the Heaven Smile, humans who are mutated by their leader, Kun Lan, who is also Harman&apos;s friend and rival, as displayed in their chess games. You collect leads for a Christopher Mills, who works for the government. He tells you who is responsable for what part of the terrorist organization, and you fight through hordes of Heaven Smile to save the world.<br /><br />Visually stunning, and illustrated with cel-shading, and an occasional anime cutscene done by the people responsible for such series as D.N. Angel. The game is not unlike taking a scalding hot shower after standing out in -30 degrees weather. You either adjust and enjoy every minute of it, or get right out and try a different temperature. By far the greatest game ever created if you&apos;re open-minded, or looking for something new.","time":1441223446686},"ebat":{"definition":"Russian word means &quot;Fuck&quot;.<br />Any times uses in the same situation like &quot;[Pizdets]&quot;.","time":1441223880260},"tabe":{"definition":"Another word for breasts.<br />Tits","time":1441223975715},"kif":{"definition":"a fine powder created from rubbing the THC crystals off of marijuana buds with a cheese cloth to cheapen the bud and later to be added to your own stash for added potency","time":1441224053388},"fyi":{"definition":"For your information","time":1441224217555},"tif":{"definition":"tif: an acronym for &quot;this is fucked&quot;","time":1441224383558},"tfk":{"definition":"Abbreviation for the Cantonese slang &quot;ta fei kei&quot;, which literally translates to &apos;beating the aeroplane&apos;.<br /><br />A slang for masturbation.","time":1441224453503},"embarass":{"definition":"Old English spelling of &quot;Embarrass&quot;. Commonly used amongst scholars.","time":1441224581791},"shark":{"definition":"this is a move when you have your girl get on her knees doggystyle and you stand across the room naked. then you put your hands together above your head and mimic a shark, all the while your humming the JAWS theme song. you make your way across the room and when you get near her you hump her as hard as you can sending her head crashing into the wall.","time":1441224906535},"metapod":{"definition":"Metapod, a dud pokemon. This pokemon just sits there and all he can do is harden. This pokemon defies the laws of physics to stand up considering its crescent shape.","time":1441224967826},"harden":{"definition":"Yes","time":1441224982530},"gold":{"definition":"An [element] found on the [periodic table] under<br />[atomic number]: 79<br />[symbol]: [Au]<br />[atomic weight]&#x2f;[atomic mass]: 196.96655g<br />[group name]: [Coinage] metal<br />[group]: 11<br />[period]: 6<br />[block]: d-block<br />[CAS Registry ID]: 7440-57-5<br />Standard [state]: [solid] at 298 [K] <br />[Colour]: gold <br />[Classification]: [Metallic] <br />[Availability]: gold is available in many forms including wire, foil, and bars.<br /><br /><br />Gold is usually [alloyed] in [jewellery] to give it more strength, and the term [carat] describes the amount of gold present (24 carats is pure gold). It is estimated that all the gold in the world, so far [refined], could be placed in a single cube 60 ft. on a side. It is [metallic], with a yellow colour when in a mass, but when finely divided it may be black, ruby, or purple. <br /><br />It is the most [malleable] and [ductile] metal; 1 ounce (28 g) of gold can be beaten out to 300 square feet. It is a soft [metal] and is usually alloyed to give it more strength. It is a good [conductor] of heat and [electricity], and is unaffected by air and most [reagents].<br /><br />The most common gold [compounds] are auric chloride (AuCl3) and chlorauric acid (HAuCl4). A mixture of one part nitric acid with three of hydrochloric acid is called aqua regia (because it dissolved gold, the King of Metals). It is unaffected by air and most reagents. It is found free in nature and associated with [quartz], [pyrite] and other [minerals]. Two thirds of the world&apos;s supply comes from [South Africa], and 2&#x2f;3 of [USA] production is from [South Dakota] and [Nevada]. Gold is found in sea water, but no effective [economic] process has been designed (yet) to extract it from this source.<br /><br />It would not normally be necessary to make gold in the laboratory as it is readily available commercially. The most romantic way to extract gold is by panning it out from a stream in some pleasant valley but most such sources are now [depleted]. Panning relies upon the [density] of gold (which is very high) being much greater than that of the sand and other [particulates]. It therefore settles to the bottom of the pan. <br /><br />Today, more often than not, gold is [extracted] from ores. These ores often contain relatively little gold. Some of these processes cause [environmental] concern. The ore is crushed to a powder so as to expose the small gold particles. These are dissolved by treatment of the [rock] with cyanide solution in air. The result of this is a gold cyanide complex. Addition of zinc powder to the resulting solution [precipitates] out the gold.<br /><br />4Au + 8NaCN + O2 + 2H2O  4Na[Au(CN)2] + 4NaOH<br /><br />2Na[Au(CN)2] + Zn  2NaCN + Zn(CN)2 + Au (s)","time":1441225005004},"platinum":{"definition":"when used in the phrase &quot;go platinum&quot;, it means to sell 1 million copies of an album.","time":1441225022446},"aluminum":{"definition":"Can be referred to as an object used to beat someone down with, especially a baseball bat, like the ones used in Major League Baseball.","time":1441225050703},"ded":{"definition":"adj.  Ded is when you are dead from joy, hilarity, sexiness, or other great feelings as such.<br /><br />There is a large difference between ded and [dead].  Do not confuse the two.<br /><br />The verb form is &apos;deds&apos; or &apos;dedded.&apos;<br />","time":1441225148986},"rko":{"definition":"Initials of [WWE] wrestler Randy Orton (Keith is his second name).<br />It is also his signature move.","time":1441225208970},"dickpinch":{"definition":"1. A pinch on the tip of the [dick].<br />2. A person that cannot be defined as anything better.","time":1441225324151},"poring":{"definition":"A sad little jelly-like monster that is amazingly still not on the extinction list due to frequent mass murders done by Novices on Ragnarok Online. But they&apos;re secretly planing, for a day when everyone least suspects it, to gang up on all players and kill everyone!","time":1441225362110},"molar":{"definition":"A half-bowl of ground up [marijuana] mixed with pipe [tobacco] and inserted into the bowl of a bong.  The prospective stonee will [snap] the bowl, pushing it down with his finger and alternating between hard and soft hitting until the everything is smoked and the ash is all sucked into the water, at which point he will clear the bong.  The tobacco will give on the [spins] upon clearing the chamber, and hitting the [weed] in this manner gets you very [fucked up].  ","time":1441225616233},"jb":{"definition":"Jail Bait. A girl or boy who is underage.","time":1441225645817},"gigolo":{"definition":"a male prostitute equivalent to a high-class call girl; gigolos service wealthy women, as opposed to servicing homosexual men like most male prostitutes do","time":1441225861330},"ocd":{"definition":"A.)Obsessive Compulsive Disorder, a mental illness resulting in persistant illogical fears and ideas, and often, particular habits created and followed out so as to avoid the fears and anxiety they cause.<br /><br />B.) Why I suffer.","time":1441226024814},"hi":{"definition":"The word that always appears everytime I open up Editor Chat","time":1441226153635},"beefcake":{"definition":"1. Somebody really ripped and muscular. Usu. male.<br />2. Used ironically to describe somebody extremely overweight. Popularized by an early episode of [South Park] in which [Cartman] drinks weight gain formula and gets really huge.<br />3. A cake made of meat. Almost always beef.","time":1441226299341},"blunt":{"definition":"Cigar hollowed out and filled with marijuana, can be smoked in public (somewhat)inconspicuously.","time":1441226422613},"btr":{"definition":"BTR stands for Big Time Rush, TV show of Nickelodeon channel and same-name boyband. Also name of their first album","time":1441226530585},"1d":{"definition":"The abbreviated name of boyband One Direction. They placed third in the seventh series of The X Factor UK.  Predicted by industry experts as Britain&apos;s next big boyband, they have ignited hysteria across the country. Their book, &quot;Forever Young: Our Official X Factor Story&quot; has reached the number one spot on the Sunday Times Bestseller list.","time":1441226713219},"ransom":{"definition":"1. Holding someone for money, threatening to cause them harm if the money is not paid.<br /><br />2. Someone who really owns &quot;multitheftauto&quot;.","time":1441226896405},"aroop":{"definition":"An indian name usually given to boys, indicating a healthy libido. Strangely, it also means a guy bad at relationships(colloqially) , and good at sports, athletics etc .","time":1441226911719},"obamacare":{"definition":"A bill passed by Barack Obama and his cronies, that under the guise of &quot;liberalism&quot; and &quot;equality&quot; will FORCE all Americans to own health insurance at WHATEVER price the insurers want us to pay.  Synonymous with the BIPARTISAN corruption of the free market that has been going on in America for several decades now.","time":1441227370442},"dongers":{"definition":"HEIMERDINGER = HEIMERDONGER","time":1441227485424},"welcome":{"definition":"Slang used in the South to describe a bad situation or place. Welcome...to hell.","time":1441227738733},"slang":{"definition":"the only reason Urbandictionary.com exists","time":1441227820930},"urbandictionary":{"definition":"A place formerly used to find out about slang, and now a place that teens with no life use as a burn book to whine about celebrities, their friends, etc., let out their sexual frustrations, show off their racist&#x2f;sexist&#x2f;homophobic&#x2f;anti-(insert religion here) opinions, troll, and babble about things they know nothing about.","time":1441227836333},"emergence":{"definition":"When small, seemingly insignificant things come together to form something truly beautiful.","time":1441228179216},"descend":{"definition":"to wrap yourself in a blanket and smother other peoples belongings until they are yours...forever...","time":1441228185401},"goat":{"definition":"Greatest<br />Of<br />All<br />Time<br /><br />(like tight, the best)","time":1441228797713},"y/y":{"definition":"Stands for yes&#x2f;yes, used instead of [y&#x2f;n] (yes&#x2f;no) as a joke that yes is the only answer possible.","time":1441228847104},"y/n":{"definition":"Your Name - usually used in fan fictions so that you are the main character","time":1441228860565},"kmn":{"definition":"Kill Me Now","time":1441228910548},"corn":{"definition":"Something I shitted the other day that I never ate.","time":1441229009025},"tweek":{"definition":"Verb. A side effect of extreme over indulgence in crystal meth or crack cocaine. Tweekers typically perform [OCD]-like activities centered around finding small quantities of drugs that were inadvertently &quot;misplaced&quot;. Tweekers may be seen on all fours, searching in gutters, obsessively looking under various objects and so on. In certain circumstances, extreme tweeking resembles autism or catatonia.","time":1441229603631},"sx":{"definition":"Sex, slang for sex. Usually used when someone doesn&apos;t want to type sex or when there parents or someone they don&apos;t want to have seeing what they are writing is around. Also could be a typo when trying to write sex.","time":1441230213185},"dayumm":{"definition":"Ghettoized way of saying damn.","time":1441230229070},"aaa":{"definition":"The guy who gets the high score in all the arcade games across the country.","time":1441230962663},"bbb":{"definition":"Blackened Baby Back<br /><br />(Sometimes called loin ribs or simply back ribs.)<br /><br />Pork ribs, usually cooked with an assortment of spices and seared until a blackish color. Commonly seen peering in.","time":1441230969314},"ccc":{"definition":"Often referred to as:<br />Triple C <br />Poorman&apos;s X<br /><br />What it is:<br />Coricidin HBP Cough &amp; Cold<br /><br />Whats it for?<br />It has large amounts of DXM(dextromethorphan); sometimes referred to as &quot;dex&quot;  <br /><br />Many of these are ingested for DXM&apos;s reputation of being a psychedelic drug.<br /><br />Make&apos;s you trip out","time":1441230973519},"ddd":{"definition":"Doube Digit Dick is a cock that is ten or more inches long, that is, that has a measurement in inches of double digits.","time":1441230977787},"eee":{"definition":"Typically used while under the influence of marijuana. You bake a cake and eat it, then out of pure joy, EEE","time":1441230988017},"fff":{"definition":"forbidden-fruit factor<br />This is the thing that makes any one of your girlfriend&#x2f;boyfriend&apos;s good friends and best friends 10x more attractive than they&apos;ve ever been before because of the fact that you can never have them.<br />This makes people you&apos;d normally not be attracted to seem even hot at times.","time":1441230996672},"ggg":{"definition":"good giving and game - coined by Dan Savage.","time":1441231013874},"hhh":{"definition":"The large nosed man who according to the internet is single-handedly responsible for all of the world&apos;s misery. HHH crucified Jesus, started both world wars, sunk the titanic, assassinated JFK, destroyed the twin towers and caused the famines in africa! But thanks to his almighty [backstage powers] and his sledgehammer of doom there&apos;s nothing anybody can do to stop his evil doings!","time":1441231023733},"ignorant":{"definition":"adj. lacking knowledge","time":1441231209489},"willferrell":{"definition":"Unbelievably hilarious comic who currently has the ability to say anything and make it funny. <br /><br />Also famous for carrying the show Saturday Night Live on his back for several years.<br /><br />Best skits include: Bad Doctor 1, Bad Doctor 2, Antibacterial Hamburger Helper commercial, Dissing Your Dog, Dog Show, George Bush, the H is O, Crossing Over, Morning Latte, Harry Carey, and of course Inside the Actors Studio with James Lipton.<br /><br />Starred in the movie Old School.","time":1441231298916},"nigeria":{"definition":"African country where my friend Malbota Nwadeyi lives. He has promised to give me 25% of the $3.6 million dollars that he is trying to move to America. However, he needs my help to transfer the money overseas.","time":1441231313280},"com":{"definition":"&quot; Convicts only material&quot; - A girl so ugly only a black toed up convict would give her a fuck. No self respecting man would look at her twice. Only fast food workers and convincts who haven&apos;t gotten ass in 12 years. ","time":1441231356682},"fhq":{"definition":"Short for the word [fhqwhgads] from [homestarrunner.com]","time":1441231365522},"inb4":{"definition":"Generally used on internet forums, inb4 refers to a user posting a reply to a message&#x2f;topic &quot;before&quot; another user posts an obvious response. When used appropriately, inb4 is followed by a word or short phrase that the user knows will eventually appear in the topic conversation.  ","time":1441231442703},"fuck":{"definition":"1. The universally recognized &quot;F word&quot;<br />2. N. Implying complete and utter confusion<br />3. N. a really stupid person<br />4. V. To procreate<br />5. adj. Can be used to modify any word for more passion<br />6. Int. Expresses disgust<br />7. Int. Expresses complete suprise and joy<br />8. adv. Can be used to make a command more urgent","time":1441231449584},"boi":{"definition":"1. in the lesbian community, a young transgendered&#x2f;androgynous&#x2f;masculine person who is biologically female and presents themselves in a young, boyish way; a boidyke; often also identifies as genderqueer.<br /><br />2. in the gay community, a young gay man;<br /><br />3. in the BDSM community, someone who presents themselves in a young, boyish way and is usually a bottom&#x2f;submissive;<br /><br />4. an alternate spelling of boy often used by young teenage boys.","time":1441231463261},"busty":{"definition":"Female with large breasts, usually the cause of car accidents, neck cricks and walking into walls.","time":1441231481356},"horny":{"definition":"i assume that if you&apos;re looking up horny you&apos;re probably horny in some way, hence the first example.<br /><br />what happens to me after reading anything.<br /><br />the state i am in after reading the above definitions.<br /><br />desiring [sex] or a wanting to [masturbate].<br /><br />see [ganting] or [randy]<br />","time":1441231493545},"randy":{"definition":"Overly excited in a sexual manner. See also [horny].","time":1441231520789},"chromedome":{"definition":"a person with a shinny bald head(also a rude term of adress)","time":1441231538554},"fg":{"definition":"Fucking Genius. A title awarded to those whom are intelligent and wish to place emphasis on their natural aptitude in matters of the mind.","time":1441231583887},"bbc":{"definition":"Big Black Cock. Usually found on African-American males. Also found inside slutty white girls.","time":1441231593401},":l":{"definition":"Its obviously someone eating spaghetti and a noodle hanging off the side of his mouth","time":1441231736745},"l:":{"definition":"An internet [smiley] used in chats and on forums to symbolize that something, or someone, is a [loser].  The capital L resembles one making a capital L on their forehead.","time":1441231749338},"chao":{"definition":"The state of disorder and&#x2f;or confusion.  Ravage!  Bedlam!  Havoc! Pandemonium!    ","time":1441231970676},".3.":{"definition":"A [smiley], basically. The two periods are eyes and the three is a pursed mouth, like a kissy face.","time":1441232116829},":)(:":{"definition":"a kiss, 2 smiley faces kisses.Two people are kissing.","time":1441232388322},"fag":{"definition":"1. An extremely annoying, inconsiderate person most commonly associated with Harley riders.<br />2. A person who owns or frequently rides a Harley.","time":1441232454458},"caster":{"definition":"casters(cast&apos;rs), [rockers] [stoners].people who attend concerts and wave their fist in the air as if casting a fishing rod.","time":1441232653327},"mage":{"definition":"A skilled magic user who, unlike wizards and sorcerors, needs no staff as an outlet of his magic, but instead uses his hands.","time":1441232670783},"wildcaster":{"definition":"To get brutally owned in a large PvP Environment&#x2f;World PvP.<br /><br />","time":1441232688605},"nub":{"definition":"one who sucks at a particular video game, they are not new to the game, but possess some determent that prevents them from playing well, no matter how long they practice playing the game.<br />synonyms- a Dan Wood, noob, newbie, newb<br />antonyms- an Alex, elite, 1337, leet","time":1441232817617},"icanhas":{"definition":"1: [Lolcat] slang for &quot;Can I have?&quot; First used in the expression &quot;[i can has cheezburger]?&quot; but obviously applicable to other situations.<br /><br />2: The equivalent of #include in [Lolcode].","time":1441232873177},"bangbang":{"definition":"When you go out to eat, eat a full meal, then go to another place and eat another full meal. Seen on Louis C.K.&apos;s amazing &quot;Louie&quot;.","time":1441233012437},"ns":{"definition":"Older definition: short for &quot;Nice Shot.&quot;<br />Another new def: Natural Selection (The newest MOD for the aging game Half-life)","time":1441233434692},"sama":{"definition":"A suffix to a name of a person with high values (Such as a queen, or a priest); A more formal name than san (see [san])","time":1441233912188},"fruitflies":{"definition":"An attractive female who hangs around gay males. <br />The same as a fag hag but attractive.","time":1441234155593},"blg":{"definition":"the band Boys Like Girls","time":1441234178729},"some":{"definition":"what a guy&#x2f; group of guys is trying to get when he&#x2f; they use cologne before leaving the house.<br /><br />[i]synonyms:  poon, ass, tail, stank, pootyhole, vadger, coont, etc.[&#x2f;i]","time":1441234182623},"faghag":{"definition":"You Are A True Fag Hag If... <br /><br />-You are a straight girl who has a best friend who is gay and spends a lot of time together<br />-You would rather go to a gay club than a straight club<br />-Your fag gave you your own drag name<br />-You know all the gay guys at the local gay bar<br />-You fag takes you shopping for mac makeup and then puts it on you<br />-Your hair and makeup are always flawless<br />-You dress up in his drag gear on saturday night or dress in drag together<br />-You even dance with all the fags on stage when Britney Spears comes on<br />-You learned to vouge from watching your fag<br />-You fall in love with your fag (which is a bad thing)<br />-You try to convert your fag (this will only ruin your relationship with him)<br />And lastly... you find your self not being able to live without him because you have so much fun with him.","time":1441234191555},"pootyhole":{"definition":"Pootyhole is when a bitches bootyhole looks like a inside of a mofuckin mudpit.","time":1441234209625},"wattpad":{"definition":"An amazing website where you share stories that you&apos;ve written, and read and comment on other people&apos;s works. often called &apos;[YouTube] for ebooks&quot;. There is a shuffle button if you don&apos;t know what to read, and if you like a particular author, you can &apos;become a fan&apos; which is basically subscribing to them.","time":1441234211977},"w/e":{"definition":"slang or abbrv. for whatever","time":1441234250378},"afd":{"definition":"Abbreviation for &quot;All Fucking Day&quot;. It describes working a shift from opening to closing hours.","time":1441234345561},"smokey":{"definition":"Chris Tucker&apos;s character in the movie &quot;Friday&quot;.  Where was he in the 2nd &amp; 3rd Fridays???  It was like having a 2nd and 3rd &quot;Major League&quot; without Wesley Snipes, or sequel to &quot;Silence of the Lambs&quot; without Jodie Foster.","time":1441234404277},"moni":{"definition":"Short for Monica. The hottest girl you know. Some have seen her around Rhode Island, but her  original place of origin is in VA- 804 [beyotch]! Her hair is naturally curly, but dont be fooled because occasionally she will straighten it. No one knows the exact color of her eyes but be advised- she is extremely hot and if you ever get the chance to go out with her, just hope she likes you as much as you like her, if its possible....","time":1441234540208},"boobs":{"definition":"things that guys like to play with","time":1441234550491},"melons":{"definition":"big boobs","time":1441234563310},"vagina":{"definition":"The best friend a penis will ever have.","time":1441234583191},"pussy":{"definition":"The box a dick comes in","time":1441234591701},"hoe":{"definition":"1. A skank<br />2. A woman that is too loose in the booty.<br />3. Woman or man that fuck anything with two legs.<br />4. A promiscuous person.[syn: slut]<br />                        ","time":1441234624300},"woe":{"definition":"*New Orleans slang meaning associate or friend.","time":1441234815849},"smh":{"definition":"Acronym for &apos;shake my head&apos; or &apos;shaking my head.&apos; Usually used when someone finds something so stupid, no words can do it justice. Sometimes it&apos;s modified to &apos;smfh&apos; or &apos;smmfh&apos; by those that prefer profanity in their internet acronyms.","time":1441234936064},"splatoon":{"definition":"The latest Nintendo IP, &quot;De Blob&quot; meets &quot;Team Fortress 2&quot;. A currently unreleased multiplayer shooter where players control squid-children called Inklings, spraying colorful ink all over a battlefield to control as much territory as possible. Currently has a metric ton of fan art, most of it pornographic in nature. Single-handedly convinced a large number of people to consider buying a Wii U. Also, its art style is so, so 90s.","time":1441235062865},"opium":{"definition":"Opium is a black sticky tar. The &quot;latex&quot; or &quot;sap&quot; that can be harvested from certain species of Poppy plants. <br /><br />It contains over a dozen drugs. <br />To name a few:<br />-Morphine <br />-Codeine<br />-Thebaine<br />-Papaverine<br /><br />By making a few slight scrapes around the mature seed pod, the white latex will beging to drain.  <br /><br />In a few hours it will have dried into a black tar.  That is the unrefined opium.<br /><br />This process is typically repeated several times.<br /><br />In countries such as Iran, Holland, Romania, and many others, large amounts are harvested for medical purposes.<br /><br />In many other cases it is used for the purpose of creating the illegal substance heroin in mass quantity.","time":1441235146250},"honkytonk":{"definition":"A loud, rowdy bar that plays &apos;honky tonk&apos; country music. Typically full of drunken hillbillies having a good ole&apos; time. To go out &apos;honky tonkin&apos; is to go out on the town to honky tonk bars and get drunk.","time":1441235187336},"king":{"definition":"Someone who doesn&apos;t have shit all over them.","time":1441235237532},"shield":{"definition":"name:  A surname (common: 1 in 5000 families; popularity rank in the U.S.: #580) <br />A kind, loving, generous family. A very friendly family, they will not hesitate to help somebody out.","time":1441235245391},"thot":{"definition":"A Thot is a hoe. Plural: Thotties","time":1441235332843},"jadakiss":{"definition":"The realest rapper out there. He&apos;s one of the only ones who keep it street and doesn&apos;t go mainstream.","time":1441235414724},"swaggerjacker":{"definition":"A person who steals someone elses [flow], lines, jokes, [swagger].","time":1441235428416},"jimjones":{"definition":"a cult leader who killed hundreds, along with taking his own life, by drinking cyanide laced koolaid in guyana in the 70s","time":1441235446720},"graymatter":{"definition":"Popular term for someone&apos;s brain, usually used in terms of killing, death, or stupidity.","time":1441235457426},"greymatter":{"definition":"A very drab person who wears long, dull, grey attire. Their personality suits the wardrobe. ","time":1441235460636},"rickross":{"definition":"black santa claus","time":1441235494675},"dipset":{"definition":"a word to be used when leaving the scene.","time":1441235524865},"thrush":{"definition":"A contagious disease of female genitals caused by a fungus, Candida albicans.","time":1441235577884},"frush":{"definition":"An utterance made by an extremely pompous, respectable, and well bred individual. Often while puffing on a pipe and holding up one finger.  NB- The word itself has a very specific pronounciation, that can only be described as how Sean Connery would sound if he spoke like the Queen of England.","time":1441235595096},"deesnuts":{"definition":"bag fillers, testicles, scrotum fruit","time":1441235632233},"mileycyrus":{"definition":"A clingy whore when in comes to being an ex-girlfriend of The Jonas Brother&apos;s Nick Jonas. She always seems to be singing too loudly for everyone&apos;s taste. All her songs are about herself or her fabulous life as Hannah Montana. If all of your friends  creepily like her music and her show on Disney Channel, you, as a friend, should be deeply disturbed. You should also feel concerned for your friend&apos;s welfare because too much of Miley Cyrus, might turn them into Miley clones and they might start walking around like skinny little sluts with a ratty wig and bad accents. Please take caution when you listen to her music and&#x2f;or watch her show.","time":1441235702156},"gayassbitch":{"definition":"A Person Who wets them self on occasion because he got excited that a guy will be fucking his ass today. ","time":1441236273454},"salty":{"definition":"A word originating in Philadelphia generally meaning that you just got played, or are looking stupid, either because of something you did, or something that was done to you.<br />","time":1441236434860},"pokémon":{"definition":"A disease that started in Tokyo.  It first infected Gameboys in Japan in 1995.  Then in 1998 the disease infected Gameboys in America.  Soon channel WB11 was infected too, and now Cartoon Network.  The ever-so-popular &quot;Gameboy Advance&quot; systems got infected in 2002, and still is.  In 1999 the disease started spreading via cardboard aka &quot;Pokemon Trading Card Game&quot;.  &quot;Nintendo 64&quot; and &quot;Nintendo Gamecube&quot; are infected too.  The disease is also spreading via plastic and metal in the toy isles at Wal-Mart, K-mart, toys-r-us, and every other toy store.  It is now July 2004, almost 10 years after the start of this addicting, argument instigating disease and it is still out there, but not as bad as its most powerful years(1999-2001).","time":1441236516210},"dblock":{"definition":"rap group consisting of Sheek Louch, Jadakiss, Styles P (formerly the LOX) and J-Hood. D block is distributed through Universal Records.","time":1441236529169},"rekt":{"definition":"Text for &quot;Wrecked&quot;, as sooo drunk you&apos;ve forgotten your name but can just about type a text to your mate whose missed called you","time":1441236535540},"yu-gi-oh":{"definition":"an extremely underrated card game that can be fun, but gets old fast. the show, on the other hand, sucks ass. but that&apos;s the american version. for all those people who say &quot;it&apos;s the crappiest show ever&quot;, watch the japanese anime, the original version, on subtitles. it fallows a completely different storylinbe, and they play different games besides the card game. ","time":1441236545022},"tito":{"definition":"The proest name on Earth. Anyone and everyone with that name is amazingly cool and should never ever be disrespected.. Ever.","time":1441236559906},"cocksucker":{"definition":"1. Someone who sucks a man&apos;s [penis].<br />2. A very stupid person.<br />","time":1441236574982},"goosefraba":{"definition":"1. A soothing sound Eskimo mothers would whisper in order to sooth their young.<br /><br />2. A word used in the film &quot;Anger Management&quot; by Buddy Rydell in order to keep his patients from becoming irate.","time":1441236644288},"blueeyeswhitedragon":{"definition":"This legendary dragon is a powerful engine of destruction. Virtually invincible, very few have faced this awesome creature and lived to tell the tale.<br /><br />LIGHT&#x2f;Dragon<br />8&#x2f;3000&#x2f;2500<br />Attack:[Horobi No Burst Stream]","time":1441236702047},"yugioh":{"definition":"an extremely underrated card game that can be fun, but gets old fast. the show, on the other hand, sucks ass. but that&apos;s the american version. for all those people who say &quot;it&apos;s the crappiest show ever&quot;, watch the japanese anime, the original version, on subtitles. it fallows a completely different storylinbe, and they play different games besides the card game. ","time":1441236718627},"lackin":{"definition":"Not having a firearm on you","time":1441236738301},"sugardaddy":{"definition":"Like a genie - he may be a little old, but if a girl rubs his lamp, he&apos;ll grant her wishes.","time":1441236745818},"tsuya":{"definition":"The Japanese slang term a young cheap prostitute.","time":1441236783890},"westaboo":{"definition":"Someone who is obsessed with Europe or America&#x2f;American Culture&#x2f;Cartoons&#x2f;Comics, etc. and assumes anything made in the west is superior to everything else in the world and will disregard any opinions otherwise. You can find them in comics book shops, going to Disney animated films though they have no children, and on the forums of television networks aimed at children, Antonym of [weaboo].","time":1441236800631},"smallcock":{"definition":"to have infant dick syndrome. see also [joe burton]","time":1441236823985},"joeburton":{"definition":"Legend&#x2f;hero based on cult hero from english&#x2f;welsh history, was rumoured to have saved many children from packs of wolves in the ancient town of Alverton.","time":1441236840445},"bitchboy":{"definition":"n. (slang) Any effeminate or feminized biological male who takes on a submissive role in a role reversed relationship with a biological female, becoming in effect a &quot;girlfriend&quot; for the dominant partner.","time":1441236887399},"battiboy":{"definition":"A male who likes to have rectinal intercourse with other males.","time":1441237156856},"cake":{"definition":"This is a lie! Everything you have been told about the cake is a lie, do not listen. ","time":1441237170861},"mlg":{"definition":"An organization in the United States for professional gamers. Is an acronym for &quot;Major League Gaming.&quot; Many great gamers have been professionally signed by MLG. As of now, they mainly focus on Halo 2 tournaments. They also post &apos;official&apos; gametypes for Halo, Halo 2, and other games, so the gametype is fair and perfect. For example, an MLG game for Halo 2 Team Slayer would be battle rifle spawn, human weapons on map (no sword for fairness), etc. Many believe MLG is a lame gametype, though others practice it often in hopes of getting good at it.  By the way, if you&apos;d like to be funny, next time someone wants to play MLG over [Halo 2] over XBL, ask them, &quot;What&apos;s MLG? Does it stand for My Little Gun?&quot;","time":1441237177431},"rape":{"definition":"A crime. Quite terrible in nature. Often causes sever phycological damage to victim. Forced sexual intercourse. Often very violent in more then just a sexual way. No I am not some feminazi either! I am a male solider in the airbourne. So dont be saying its only somthing whiny girls dont like.<br /><br />&quot;That MOFO raped my good friend. So I took my boys out and we beat him into the hospital.&quot;","time":1441237211085},"ins":{"definition":"I.N.S. is short for Itchy Nut-sack Syndrome.<br />Billions of males are affected by this syndrome every day.<br />There are methods to counter-act I.N.S. such as:<br />1. The &quot;pinch-and-pull&quot; method, most likely the most common method, what you do is pinch the sack on the affected area and pull(usually downward)<br />2. The &quot;shoo&quot; method, you curl your fingers (your fingers are together) and your finger nails are resting on the affected area. Then you move your fingers till you have an open palm as if you were going to smack a bitch. this is done on the topside of the sack. If done correctly your finger nails will have scratched your sack where the fingers were, thus reliving the itch<br />3. The &quot;Got Money&quot; method, you put your fingers on the underside of your sack and thumb on top side and pinch. Then you move your thumb across your fingers which will remove the itch. This method can also be finished off with the &quot;pinch-and-pull&quot;.<br />4. The &quot;rake&quot; method, you put your fingers on the underside of your sack and then curl your finger as they scratch the underside of the sack. Its basically a reversed &quot;shoo&quot; method.<br />These are just a few methods to coop with I.N.S. Also a regular scratch can remove the symptoms of I.N.S.","time":1441237271670},"anteater":{"definition":"Ant·eat·er (Ant&quot;-eat`er), n.<br /><br />An uncircumcised man.","time":1441237453110},"cna":{"definition":"poor unfortunate employees who are disrespected constantly by patients and nurses. They are on the front line for a code brown or when someone&apos;s ass needs to be wiped. A.k.a. the most overworked, yet underpaid job in the history of employment :) Our world could not function without the nursing assistants, yet people constantly berate these cursed people.","time":1441237484598},"prawn":{"definition":"To describe a chik that has a mad body, but a bad face.<br />it comes from when you eat a prawn, you eat the body and throw away the head.... (australian)","time":1441237699644},"ahem":{"definition":"The sound made when a person clears his&#x2f;her throat, often interjected when speaking or writing to indicate that the next word or phrase is used ironically or euphemistically, (esp. with regard to sexual euphemisms).  <br /><br />Sometimes used to replace a sexually explicit word or phrase altogether. <br /><br />When used on its own or at the end of a sentence, indicates that the entire previous sentence has been intended ironically or euphemistically.  <br /><br />Similar to the addition of &quot;not&quot;, as in: &quot;Well that TV show was interesting ... not.&quot;  <br /><br />Often written with asterisks.","time":1441237751884},"olympics":{"definition":"An sporting event originating in Greece as an honor to the gods. In more modern times it has become an international sporting contest were most of the world&apos;s countries participate every four years. The athletes selected to participate are their country&apos;s cream of the crop and represent their home nation with unparalleled pride. Being awarded a medal means you are one of the best athletes in the world. A pure and true athletic spectacle that has unfortunately received less popularity in recent years.","time":1441237807668},"pmd":{"definition":"Literally - &quot;Private Messaged&quot; See [PM].<br />Often seen in online communities bulletin board&#x2f;forums or chat rooms such as IRC.","time":1441238165712},"insomnia":{"definition":"The state of sleep loss.  No matter how much you desire dreamland, it refuses you entry.  You stand at the gates, whining, crying, but stuck in the world of buzzing activity.","time":1441238981055},"graphics":{"definition":"Something that looks or is really good and&#x2f;or desirable.  Also implies that the said &apos;thing&apos; is extremely wellmade and engineered with skill or is superior to similar objects.<br /><br />Derived from usage of the word in the context of graphic porn or violence.<br />","time":1441239289811},"linkinpark":{"definition":"Ok since everyone is just posting OPINIONS. Let’s actually get a real definition...free from most OPINIONS<br /><br />Linkin Park is a Sol-Cal band that is often thought of as nu-metal, alt. rock, or something else where-as the band themselves thinks to have their own style of music and has two successful albums, &quot;Hybrid Theory&quot; and Meteora, and two remix albums that not only went high in the charts when they were released(believe it or not), most people seem not to like &quot;Reanimation&quot; nor &quot;Jay-Z Linkin Park: Collision Course&quot;  except people who enjoy hip hop more(they seem to like them a little more than Linkin Park&apos;s albums).<br /><br />The band consists of six members:<br />Chester Bennington (vocals)<br />Rob Bourdon (drums)<br />Brad Delson (guitar)<br />Dave &quot;Phoenix&quot; Farrell (bass guitar)<br />Joseph Hahn &quot;Mr. Hahn&quot; (turntablist, samples)<br />Mike Shinoda (backing vocals, sampling, rap emcee, keyboardist, occasional rhythm guitarist)<br /><br />Before there was Linkin Park there was the band called Hybrid Theory. This was Linkin Park before they were signed onto Warner Bros.<br />And Before Hybrid Theory there was Xero which was more focused on hip-hop music.<br /><br />Most people look to their lyrics as &quot;shitty&quot; and &quot;have no thought in them at all, only made to get emo teens to listen to them&quot; When this is not true at all.<br />Their lyrics are taken from &apos;sappy therapy time&apos; as Mike says, and broken down until they reach a happy medium. On average their lyrics are rewritten at least twice for every song.<br />Where the Lyrics branch from is stuff they have gone through (not from relationship problems most of the time) and as Mike once said &quot;You don&apos;t want to know where the lyrics come from...You wouldn’t know how the hell we got it to become that song.&quot;<br /><br />This band has become loved by many and hated by many as well. They are seen as &apos;untalented&apos; when this is truly wrong. Linkin Park has a sound that, as of now, has not been duplicated (and many have tried). This band is greatly respected in the music business and seems to be one of the most successful bands to mix hip hop and rock. ","time":1441239389631},"hardo":{"definition":"(adj). HAR-dO: a hardo is one who thinks they are incredibly hard or overestimates their hardness.","time":1441240100144},"iirc":{"definition":"abbv for If I Recall Correctly","time":1441240161811},"rwby":{"definition":"An acronym for four characters in the show RWBY. Made by Rooster Teeth productions. The characters names are Ruby Rose, Weiss Schnee, Blake Belladonna, Yang Xio Long.","time":1441240164700},"attackontitan":{"definition":"One of the best anime shows of the year 2013 by production I.G. The graphics and atmosphere will blow your minds out but the theme has raised debates. It&apos;s one of those shows where tons of people die in battles, including your favorite ones, so if you really hate that, you might not want to watch it.  I&apos;m not gonna give out any kind of spoilers, not even the summary, because it&apos;s more fun to watch if you don&apos;t have any idea about what you&apos;re going to see. If you&apos;re that eager for a summary, go read the wikipedia page.","time":1441240170160},"swordartonline":{"definition":"A japanese show, defined as Anime. A show where the characters (Some how are ALL from Japan) enter a game, known as Sword Art Online. When entering the game, shortly after, the creator of the game, Heathcliff, or whatever his actual name is, alarms them that if they die in the game, they die in real life.. The Game version of Freddy Krueger.","time":1441240188484},"asuna":{"definition":"Asuna is a loving girl, who would do anything for the person she loves more than anything. She&apos;s loyal and loving, treasure her at any cost. Because once you&apos;ve lost her its very hard to get her back.","time":1441240194009},"lennyface":{"definition":"A unicode emoticon used when something might be edgy.<br />( ͡° ͜ʖ ͡°)","time":1441240644141},"ykwtd":{"definition":"Short for &apos;you know what to do&apos;.  Mostly used at the end of a sentence to hint something without having to actually spell it out for the reader, whilst adding a solemn, dire, suggestive or perhaps a cheeky tone for either comical or epic purposes.","time":1441240885829},"rof":{"definition":"Acronym for Roll on the floor starving.","time":1441242052414},"mako":{"definition":"After having sex with someone, you punch them in the nose to get them to leave, much like someone would do to a mako shark that is attacking.","time":1441242335294},"luster":{"definition":"The person someone is in [lust] with; there is no desire of a commitment, just purely sexual activities with this other person. They are satisfied knowing there is no strings attached, but just the sex and occasional talking. Sometimes common between friends. Can often become confused with [lover] if situation gets serious for one person and not the other.","time":1441242847916},"lackluster":{"definition":"A funny word that only &quot;sophisticated&quot; people use meaning a lack in energy, enthusiasm, or passion.","time":1441242857620},"glu":{"definition":"Acronym for Guys Like Us. GLU is a gay asian, and friends, social group in San Diego, CA. There are some 200+ active members, with a mailing list that exceeds 500. GLU . Active MySpace page.  GLU serves both a social and a charatable purpose for its members. GLU is usually a top 10 team for AIDSWALK San Diego fundraising. GLU collects canned goods and other staples in front of supermarkets once a month, for Mama&apos;s Pantry. Creaters of GLU juice, a wicked strong drink served at most functions.","time":1441242959272},"id":{"definition":"1) In Freudian theory, the division of the psyche that is totally unconscious and serves as the source of instinctual impulses and demands for immediate satisfaction of primitive needs.<br />2) Short for identification<br />3) The creators of Doom","time":1441243156586},"yh":{"definition":"yh is short for &quot;Yes, my intellegence is equil to the butt of a horse&quot;","time":1441243723498},"mylife":{"definition":"My life. a better&#x2f;cleaner version of our favorite fuck my life or fml...","time":1441243824198},"pokemonshowdown":{"definition":"An awesome website where you can battle pokemon online. How cool is that?","time":1441243853281},"wank":{"definition":"predominantely British term for masturbation<br /><br />","time":1441244026225},"wanker":{"definition":"While &quot;to [wank]&quot; means &quot;to masturbate&quot;, the term &quot;wanker&quot; is seldom if ever used in British slang to denote &quot;one who wanks&quot;.  It is quite wrong to infer from somebody&apos;s being a wanker that they in fact wank (and vice versa), but of course, fair to assume they do in any case.  Herein lies the genius of the insult: if you call someone a wanker, it&apos;s probably true, but only literally.<br /><br />I suppose it all originates from our repressed Victorian sexualities, from back when everybody thought they were the only ones to suffer the secret shame of being an actual wanker.<br /><br />Most children these days learn the word &quot;wanker&quot; long before they learn its literal meaning.","time":1441244028516},"ahoge":{"definition":"Literally, “stupid hair” in japanese. A single (usually short and fat) lock of hair that sticks out of an anime character’s head. The character is usually stupid in some way, but there are enough exceptions that this isn’t a rule. Example characters include Himeko and Me-tan. To be differentiated from antenna hair, which is two or more thin locks of hair as opposed to only one.","time":1441244065349},"ahegao":{"definition":"japanese word for fucked silly","time":1441244078796},"punto":{"definition":"1) quite simply: pussy <br />2) in spanish it means point","time":1441244311817},"punta":{"definition":"Spanish for &quot;end&quot;:<br /><br />1) A point of land extending into a body of water.<br />2) Rude term for the buttocks, usually female.","time":1441244743171},"puta":{"definition":"means whore or bitch in portuguese, spanish, and Filipino","time":1441244777879},"nocturne":{"definition":"The greatest guild in Maplestory ever.","time":1441244796829},"gigapuddi":{"definition":"PUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDI<br />PUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDIPUDDI<br />PUDDIPUDDIPUDDI","time":1441244797862},"jayce":{"definition":"A rare species of &quot;Bestest-best-friend-ever&quot;.<br /><br />Fact!","time":1441244806362},"dickinabox":{"definition":"What to get that special lady in your life for Christmas. It&apos;s not a diamond ring, it&apos;s not a fancy car, and it&apos;s not a house in the hills. It&apos;s a dick in a box.<br /><br />Step 1: cut a hole in a box<br />Step 2: put your junk in that box<br />Step 3: make her open the box","time":1441244897646},"popcorntrick":{"definition":"If one is at the movies with one&apos;s date, proceed to buy a extra large bucket of popcorn and place it on his lap during the movie.  Cut a hole in the bottom of the bucket, and proceed to stick your bare penis in the hole (preferably bonered).  When your date reaches in to grab popcorn, she will be delighted.","time":1441244925071},"ynk":{"definition":"You never know.<br /><br />For example:<br />[irc]: Dude, that can&apos;t be true.<br />[irc]: YNK mate.","time":1441244971816},"emetophobic":{"definition":"the fear of vomiting.","time":1441245029859},"amati":{"definition":"Amati: This word means love in Italian coming from the Latin root Amat. When you add an I at the end of amat you get amati which means love in the Italiano Lanuage.","time":1441245241411},"fighting":{"definition":"In some countries such as South Korea, &quot;Fighting&quot; is used as words of cheer.<br />The meaning of &quot;Fighting&quot; is similar to the meaning of &quot;Let&apos;s go&quot; or &quot;Do your best&quot; or &quot;Good luck&quot;","time":1441245252225},"clit":{"definition":"Bastardization of clitoris.<br /><br />Located at the point where the labia (lips of the vagina) coverge at the top of the vagina.  It usually is hidden beneath what looks to be a large fleshy nub called a hood.  When stimulated or by pushing the pelvic tissue upward, it can be seen. <br /><br />Extremely sensitive organ that produces immense amounts of sexual pleasure for most women.  When properly stimulated, can induce multiple orgasms.<br /><br />Marks women as the only animal on this planet with an organ designated solely for sexual pleasure.<br /><br />Usually a must for most women during sexual intercourse.  Most face to face positions allow for it to be &quot;crushed&quot; by flesh and pushed upward by thrusts via the male hips.  Not suprisingly, most women find it difficult to orgasm in positions that do not allow for the stimulation of the clitoris without some hand to hand help.<br /><br />A reasonable substitute for foreplay. <br /><br />Formed from the same tissue as the head of the male penis.<br /><br />God&apos;s bribe for childbirth.","time":1441245367855},"selenagomez":{"definition":"The only female Disney star under the age of 18 who is a good role model to younger viewers. She is said to &apos;take over&apos; [Miley Cyrus]&apos;s place. Thats completely false. <br />Selena will never be that ugly, untalented, slutty, or fake. Her tv show [Wizards of Waverly Place] is becoming to be a huge hit. Her music career is slowly becoming successful BECAUSE she has talent. The only reason Miley&apos;s music career is doing good is because her hit tv show [Hannah Montana] is based on her poor singing.<br /><br />Sorry miley, but you&apos;re going to fail and watch selena rise to the top.","time":1441245634647},"da":{"definition":"THE for people who are to stupid to string all three letters togather","time":1441246327135},"sweg":{"definition":"instead of using &quot;Swag&quot;, you use &quot;Sweg&quot; to be more hipster&#x2f; indie.","time":1441246448452},"penis":{"definition":"The tool used to wean and convert lesbians and virgins into useful, productive members of society.","time":1441246481865},"semen":{"definition":"ejaculate from the male [penis]; tastes like egg whites mixed with saltwater.Loved by some, hated by others.","time":1441246487811},"sherek":{"definition":"A girl who looks like the female version of Shrek.","time":1441246508544},"shrek":{"definition":"A large green ogre. With a donkey friend.","time":1441246514701},"spongebob":{"definition":"little square dude","time":1441246521372},"patrick":{"definition":"All around perfect man and a sexy beast.  Known to cause even the most loyal of girls to turn on their boyfriends.  Talented with music, words, and kills in any sport he plays.  Strong like bull.  Always competitive, and ALWAYS wins what he competes in.  Some consider to be on the status of not only a god, but THE God.","time":1441246525355},"squidward":{"definition":"The &apos;straight guy&apos; on the comedy known as [spongebob Squarepants]","time":1441246532070},"sandy":{"definition":"One of the only people on this earth that truly cares about life. Does not lie to anyone and especially not to herself. She stays true to herself.<br /><br />Nothing can compare to this person. She is everything.","time":1441246536344},"krabs":{"definition":"Slang name dissing members of the crips usually used by Bloods","time":1441246544857},"mr.krabs":{"definition":"The owner of the Krusty Krab on Spongebob. He is also Jewish.","time":1441246554876},"darkerthanblack":{"definition":"A mature yet entertaining (and [dark] ) anime about people called &quot;Contractors&quot; that have to perform [obsessive compulsive] &quot;payment&quot; in order to use their [super powers]. It&apos;s set in an [alternate] universe where there are 2 places called &quot;hells gate&quot; and &quot;heavens gate&quot; which are supposedly the source of where the contractors come from and hold [supernatural] qualities. &quot;Contractors&quot; are people, hidden from the general public and considered highly dangerous to the government and &quot;not human&quot;(not displaying much human [emotion] and relying on [logical thought]) . While a small number of these contractors work for the [government], most form [underground] society&apos;s or groups that work (or dispute) against each other. Also working with these contractors are [Emotionless] locators called &quot;Dolls&quot; that use certain elements as mediums to locate people or contractors.  The main character, Hei, is a contractor known as the Black [Reaper]. Although [meddling] in more trouble than most contractors could handle, is considered the most [dangerous] while only using his contracted powers for self defense and against [mobsters] and actual [criminals.] Though we do not know very much about the mysterious Hei, we do know that his [sister], Bai, disappeared along with [heavens gate] several years ago. More episodes to come for this [Epic anime]...","time":1441246562869},"vech":{"definition":"A vech is a title for a person that can be used in any situation. For example, it can be used to describe someone who is complaining, bitchy, annoying, boring, etc. <br /><br />It is one of those words that you can label absolutely anyone with. It can be offensive or funny, light hearted or derogatory.<br /><br /><br />","time":1441246563739},"velch":{"definition":"The mixture of lubricant, semen and feces that accumulates on the penis after anal activity.","time":1441246569696},"trr":{"definition":"Think. Relate. Respond.  A person&apos;s ability to converse.","time":1441246700036},"hw":{"definition":"Short for [homework], which is annoying but will prevent you from working behind the counter at your local McDonald&apos;s or Wal-Mart when done.","time":1441246867787},"fae":{"definition":"1)<br />A fae is a humanoid mystical creature that wields great power in magic and elementals, usually have anteneyes and insect like wings, and are short. faes are otherwize known as faries and are commonly used in RPs<br /><br />Shortened definition: FARIE<br />2) A very very gay being<br />3) feild assistance engineer<br />","time":1441247149828},"jane":{"definition":"short term name for marijuana...people who smoke pot often love Jane&apos;s<br /><br />the name of the most beautiful woman in the world, other woman were so jelous of Jane&apos;s that they made up a term for Jane&apos;s calling them plain because it rhymed and made them feel better about themselves cause they were not names jane and they are ugly.<br /><br />janes are always the girls with the sense of humor in any group<br /><br />jane&apos;s can also be that girl that had a crush on you in high school but you never dated, then she shows up at the reunion lookin all hot and successfull, then you kick your self in the ass for not being nicer to her because now she is hot and wont give you the time of day.<br /><br />jane&apos;s are better then everyone, and are usually associated with class and wealth and beauty<br /><br />the hot girl next door that you grew up next too is always named, or should always be named jane","time":1441247177900},"soab":{"definition":"Means son of a bitch","time":1441247344543},"kms":{"definition":"stands for: kill my self","time":1441247438022},"cyber":{"definition":"Online sex that loners engage in if they are too ugly and boring to get a real boyfriend&#x2f;girlfriend.","time":1441247439630},"birdemic":{"definition":"One of the &quot;Unholy Pentagon&quot; of the film industry, the others being Troll 2, The Room, Twilight, and Manos: The Hands of Fate. It is, quite literally, the worst movie ever made. YouTube movies and high school film projects from 10 years ago have better cinematography, sound editing, acting, and CG effects than Birdemic.","time":1441247681127},"ttfn":{"definition":"Ta Ta For Now","time":1441247696322},"epitome":{"definition":"a perfect example of a certain quality. someone or something that &quot;personifies&quot; this said quality.","time":1441247905203},"genderconfusion":{"definition":"The state of being unsure what sex you are.","time":1441248354675},"shinku":{"definition":"A kick ass word to use before a kick ass attack.<br /><br />","time":1441248415646},"hadoken":{"definition":"1. From Japanese Ha Dou (Wave or Surge) and Ken (Fist, Technique, or Attack); a blastwave or fireball formed from a martial artist&apos;s life energy (or ki&#x2f;ch&apos;i).  The hands are brought together, heels of the palms touching, and moved to beside the fighter&apos;s waist (which is as close as one can get to the center of the body, where the most ch&apos;i gathers).  The energy is then focused into the hands, and when both arms are thrown forward, palms outward, the energy wave is fired in the same direction as the double palm punch.  Very similar in nature to other ch&apos;i-based fireball attacks, including Son Goku&apos;s _kamehameha_, Piccolo&apos;s _ma kou sen_, the fireballs used by Liu Kang and Johnny Cage, and other cast members of Mortal Kombat, Fatal Fury, and especially Street Fighter.  The Hadoken technique itself was developed by the shotokan karate master Gotetsu, who taught it to his disciple Goken, who in turn taught it to Ryu and Ken Masters, along with his other special techniques, the ShoRyuKen (Dragon Power Fist) and the TatsuMakiSenPuKyaku (Hurricane Kick).<br /><br />2. In the webcomic _8-Bit Theater_, by Brian Clevinger, the character Black Mage casts a 9th-level spell called Hadoken.  The spell seems to be a pumped-up version of the Final Fantasy I spell &quot;NUKE&quot; (also called &quot;FLARE&quot; in later sequels of the game), though in Final Fantasy I, there were only 8 spell levels (9 being the number of spell levels traditionally used in Dungeons &amp; Dragons).","time":1441248469006},"teppanyaki":{"definition":"To receive a speedy, or fast, backhanded hand job.","time":1441248546322},">:3":{"definition":"It&apos;s a lion. Yeah, a liJESUS CHRIST IT&apos;S A LION GET IN THE CAR!!<br /><br />","time":1441248556280},"shinkuhadoken":{"definition":"a huge ass version of the hadoken. its used by ryu and some other street fighter characters in some of street fighter games. its like a hadoken, but much more powerful","time":1441248563607},"ragingdemon":{"definition":"Jab Jab Forward Short Fierce","time":1441248589089},"evilryu":{"definition":"The American counterpart name for &quot;Satsu No Hadou RYU.&quot;<br />This is what Ryu, from Street Fighter, becomes when he gives in to the Satsu No Hadou, or what CAPCOM of America likes to call &quot;Evil Intent&quot;.<br />Evil Ryu can use Normal Ryu&apos;s special attacks, except for the Shin Shoryuken, and he can also use some of Gouki&apos;s (Akuma) moves, like Shun Goku Satsu and Messatsu Gou Shoryu.<br />Satsu No Hadou RYU is more powerful than GOUKI, but weaker (or evened out) against Shin GOUKI.","time":1441248612981},"labium":{"definition":"The lips of the [vagina].  Frequently these are what create the famous [camel toe] when they press into a woman&apos;s underwear or bikini","time":1441248673167},"laid":{"definition":"to be fucked.","time":1441248713585},"shinshoryuken":{"definition":"(n.) The super-powerful form of Ryu&apos;s Shoryuken technique.  When not used at extremely close range it deals mediocore damage, but if used at such a range it deals horrendously massive damage (Somewhere around 1&#x2f;3 of a full health bar, on average).","time":1441248770289},"haram":{"definition":"doing haram things, on the weekends... o so ya haram???","time":1441248882237},"sloppy":{"definition":"A Girl who is the one that you smile at and she sucks your dick.  This is the one that you dont have to put any effort into, and you know she wants it.  This is not a girl you have to talk to and get to know, this is the one that your see at a party drunk off her ass and no spitting game is needed. True sloppy girls dont even need to be drunk.","time":1441249094431},"redhanded":{"definition":"adj. Derived from the term &quot;bloody-hand&quot;, which was one of four kinds of offences in the king&apos;s forest, by which the offender is supposed to have killed a deer.  In Scotland, in such like crimes they say &quot;Taken in the fact, or with the red hand&quot;.<br />    - Thomas Blount&apos;s Law Dictionary and Glossary, 1717<br /><br />In modern times, this term refers to catching someone in the act of doing something they aren&apos;t supposed to do.","time":1441249259334},".i.":{"definition":"Showing someone your middle finger.<br />Often falsely mistaken as a dick.","time":1441249382548},"chakras":{"definition":"Chakras are also, in Yoga and many new-age psychic circles, the energy points in the spirit&#x2f;soul&#x2f;energy body where different kinds of energy flow through. As one progresses from bottom to top, each chakra delves into theoretically more complex forms of thought and emotion.<br /><br />There are seven, though some consider the eighth to be the aura or something along those lines. There can really be more or less, depending on how complex the mysticism makes it. I&apos;ve seen three, and I&apos;ve seen 20+ (usually any beyond 7 include &apos;lesser&apos; chakras, energy conduits on the body that don&apos;t serve a function other than taking in and expelling psychic energy).","time":1441249395493},"edm":{"definition":"abbreviation for &quot;Electronic Dance Music&quot;<br /><br />- includes trance, house, techno, breakbeat, gabber, hardcore, and much, much more.","time":1441249398357},"oio":{"definition":"1)A now rather common place &quot;smily&quot; for a penis.","time":1441249403708},"queef":{"definition":"an expulsion of wind from the vulva during coitus; a vaginal fart.","time":1441249413573},"agnostic":{"definition":"An agnostic is a person who believes that the existence of a greater power, such as a god, cannot be proven or disproved; therefore an agnostic wallows in the complexity of the existence of higher beings. <br /><br />Agnostics on religion (Christianity, Islam, Buddhists, etc): Religious zealots are often viewed as ignorant by agnostics’ because of their blind following of a supreme being which may or may not exist. Agnostics will often question the existence of a supreme power because a lot of modern religious beliefs have no basis in modern logic; therefore blind following of popular religions is viewed as an easy out for people who chose not to think for themselves. <br /><br />Agnostics on atheism: On the other end of the spectrum, unlike atheists, an agnostic uses a more scientific approach to their belief system. An agnostic knows that just because there is no physical proof of the existence of a higher being, it dose not automatically mean that one does not exist. An agnostic views an atheist on the same plane as a religious zealot; often because the belief that human beings are the pinnacle of intelligence and there are few things that we do not or have the potential to understand.<br /><br />The realization of knowing that “we cannot know everything” is the backbone of the agnostic belief.","time":1441249896404},"hobknocker":{"definition":"when a guy hits you in the face with his penis.","time":1441250630296},"hingo":{"definition":"The bane of everything that is good in the universe.  Should be avoided and shunned at all costs.  Widely associated with the fall of civilization into the depths of Hell.  Also, the exact opposite of [blarg].","time":1441250857235},"8^":{"definition":"someone with glasses and a big nose, like Groucho Marks. Possibly trying to be sneaky.","time":1441250907665},"zztop":{"definition":"a kick ass rock band that i listen to every day, NOT to be confused with all of the rest of the southern&#x2f;mid western garbage crap","time":1441251306423},"pinkkryptonite":{"definition":"That soft pink treat between a females legs","time":1441252222803},"bd":{"definition":"BIG DICK","time":1441252745384},"lapping":{"definition":"Oral sex on a woman","time":1441252790225},"shialabeouf":{"definition":"When a man defecates into a woman&apos;s mouth and then stirs it around with his erect penis.","time":1441252830266},"tryhard":{"definition":"A person who puts a large amount of effort into achieving a certain image, or counter-image, to the point where it is obviously contrived. Rather than achieving an image through genuine personality, the try-hard consciously attempts to fit a certain style through deliberate imitation, forced style, or scripted behavior. That is to say, he&#x2f;she is trying hard to create an image.<br />","time":1441252861731},"rule34":{"definition":"Generally accepted internet rule that states that pornography or sexually related material exists for any conceivable subject.<br /><br />Additionally it is accepted that the rule itself has limitations and you cannot be too specific on the content of the item in question.<br /><br />Most commonly used on various message boards for various reasons, from humor to cruelty.","time":1441252937859},"spartan":{"definition":"The spartans were a group of elite warriors from ancient greece, located on the island province of Sparta. <br />Spartan warriors are trained from infancy to be nothing but soldiers. They are to be perfect in every respect and aspect of war, and nothing else. Weaklings perish soon after birth; youth are taught to thieve and terrorize the slave class to harden them; young men are taught to nothing unless it has something to do with the arts of war - Even music and dance are tehre only to help keep step when marching and obeying  orders. The result is a man who thinks nothing of danger, expects to win, and creates a sense of dread in his opponents.<br /><br />Spartans fight in the traditional fashion of the hoplites, carrying a long thrusting spear and a large round hoplon shield. They, like the hoplites, were known to form a formation called a [phalanx] (A close packed mass of men moving as one to crush their enemies)<br /><br />There have been both a movie and graphic novel based on the most notable spartan accomplishment in written history.<br /><br />300 spartan warriors (the personal guard of the spartan republic&apos;s current king Leonidas), held back the entire Persian army (massing up to 30.000) in a single tactical position, popularily called a &quot;bottlehead&quot;. Eventually, after having held the persian army off for multiple days, devestating the persian morale, they died a martyr death. The martyr death was, without a question, a tactical move. After the death of King Leonidas and his men, all of greece united and fought back the persian army.","time":1441253008495},"tfw":{"definition":"That Feel When<br />Followed by some feel you should be able to relate to.","time":1441253143201},"pervert":{"definition":"What we all are, but are too afraid to admit.","time":1441253789959},"perverted":{"definition":"What many of the posts on this website here are.<br />What happened to everyone&apos;s mentality?","time":1441253792010},"stop":{"definition":"To cease a motion.<br />","time":1441254221448},"rigormortis":{"definition":"when someone&apos;s dead for a while and their limbs stiffen (not the penis, though if the corpse is laid face down, the flow of blood to the penis can result in an erection.. a treat for [necrophiliac]s)","time":1441254270621},"help":{"definition":"what i need","time":1441254320315},"foh":{"definition":"acronym for &quot;Fuck Outa Here&quot;","time":1441254732363},"pda":{"definition":"Public Displays of Affection, can be seen in the form of kissing, touching, groping, licking, nuzzling, cuddling, crossing hands into each other&apos;s opposite back pockets, etc. Usually spotted among new couples, frisky teenagers, and occasionally the &quot;young at heart&quot; (god help us).<br /><br />Also, a handheld computer of sorts.","time":1441255317048},"keldeo":{"definition":"The first of the three Generation V Pokemon that wasn&apos;t revealed at first. It is the 4th member of the Musketeer Quartet along with Colbalion, Terrakion and Virizion. It is based on the mythical water demon [Kelpie] as well as [d&apos;Artagnan], the 4th musketeer.","time":1441255670959},"gyarados":{"definition":"The accidental yet embarrassing act of blowing water out of a bong through the slider, soaking the Marijuana. It gets its name because the action closely resembles the Pokemon Gyarados.<br />It often happens with first time bong users who forget they can&apos;t blow out the ash like they can with a bowl or pipe.","time":1441255818152},"colon":{"definition":"The bloated sack in which resides in the anus. It is blissfully restocked with gas, daily. The toxins in the gas are enough to render a [snob] unconscious. The gases are expelled on a daily basis from the anus approximately 15 times a day. 2 times if you are a gimboid. 30 if you work at a fast food retaurant.","time":1441256286807},"table":{"definition":"An inanimate object that James Hetfield of Metallica claims to be.","time":1441256316893},"yuri":{"definition":"1. Explicit lesbian relationships in anime or manga<br />2.To be the first to do something. Derived from Yuri Gagarin, first human in space. ","time":1441256364784},"mmm":{"definition":"Used to express pleasure or contentment--not necessarily related to food.","time":1441256810053},"sandnigger":{"definition":"noun; a person of Middle Eastern descent due to the various desert regions there.  Usually meant in a disparaging and demeaning way.","time":1441256983544},"infinite":{"definition":"A South Korean Boy group evolving of 7 members: Sungkyu, Dongwoo, Woohyun, Hoya, Sungyeol, L &amp; Sungjung. They first debuted in June 2010 with their debut song, &quot;Come Back Again&quot; on M! Countdown. They are known for their synchronized dancing, Soprano singing &amp; charms.  On M! Countdown, Infinite had won 1st place for their song, &quot;Be Mine&quot; in September 2011. Their recent hit song, &quot;Paradise&quot; was popular &amp; was known for their &quot;sexy&quot; dance moves during the chorus. Their official fanclub name was chosen as &quot;INSPIRIT&quot;.","time":1441257063702},":/":{"definition":"Hard one to define imo.. I guess it&apos;s<br />1. This sucks.<br />2. Whatever<br />3. Greeeeeeeat (sarcasticly)","time":1441257338094},"ofwgktadgafllbblsbfbn":{"definition":"The full name for Odd Future it means-Odd Future Wolf Gang Kill Them All Dont Give A Fuck Litter Life Bacon Boys Loiter Squat Butt Fuck Bitch Niggas","time":1441257351459},"shadaloo":{"definition":"Used specifically to refer to a person who acts in morally underhanded ways to achieve goals using dishonesty and deception. This includes [hoodwinkery] and [bamboozlement].","time":1441257511286},"juri":{"definition":"-noun  1) Means law in Latin. As in jurisdiction, jury, and juris doctorate, etc.  2) A male name of Latvian origin. In general Juris’ tend to be ridiculously hot, flirtatious, self-centered, manipulative, intelligent, funny, ego-maniacs with an inferiority complex. They party like rock-stars and make bad choices in their youth and find it very hard to grow up. They use their good looks and natural charm to manipulate women and get their way in adverse situations. They make lousy boyfriends and tend to break up with you via text message if they notify you at all of the breakup, but wonderful husbands and fathers if you are lucky enough to tame one. Be wary, they use their bad-boyfriend image to attract more than their allotment of women, and have been known to date your friends and your friends’ friends, leaving a trail of broken hearts and bitterness wherever they go. They are INTENSE lovers, generous friends, slow to anger, excellent flirts, and fun at parties.","time":1441257739273},"guile":{"definition":"He is a character from Street Fighter series. His real name is William F. Guile. Guile is a colonel is the United States army. He uses a combination street and military fighting style, and sports a unique flat-top hair cut. He has sworn revenge against M. Bison, the ruthless dictator who killed his best friend Charlie, years ago. He occasionally collaborates with detective Chun-Li to share information on and combat M. Bison&apos;s Shadowloo terrorist organization.","time":1441257827319},"hypocrite":{"definition":"(1) A person who engages in the same behaviors he condemns others for.<br /><br />(2) A person who professes certain ideals, but fails to live up to them.<br /><br />(3) A person who holds other people to higher standards than he holds himself.","time":1441257904449},"faggot":{"definition":"In these times not really used if somebody is really a homosexual mostly used insteap of calling somebody stupid or a loser.","time":1441258120563},"facevalue":{"definition":"The value someting gains by being put up on or displayed on facebook. thus making it that much more &quot;real&quot;. This can be varified by checking [facebook] or by a spot of [facebooking]. When checking the [face value] of something a person cannot be said to be a facebook stalker.<br />Also a person who makes a comment which has no face value may be humiliated, insulted and called a total [loser] very publically.","time":1441258370905},"kush":{"definition":"A high grade strand of marijuana.","time":1441258436631},"stufu":{"definition":"shut the fuck up<br />(the extra &quot;u&quot; is there just to make it sound good)","time":1441259226615},"stfu":{"definition":"1) Acronym used for the phrase &quot;shut the fuck up&quot; for efficiency reasons.","time":1441259257583},":>":{"definition":"an emote used primarily in Yahoo messenger; like a smile, but better","time":1441260549524},"lebanese":{"definition":"One who has originated from the country of Lebanon.","time":1441260859100},"lebanon":{"definition":"Officially - A country in the Middle East<br />Actually - A place where great food and the most GORGEOUS women come from","time":1441260862904},"ba":{"definition":"BA means bad ass, prounouced as B.A.","time":1441261233026},"fam":{"definition":"a word use to describe your peoples. ones that you can trust dearly. someone you consider family ","time":1441261314441},"lol":{"definition":"The name &apos;Lol&apos; is an abreviated form of the name &apos;[Laurence]&apos;.","time":1441263029861},"laurence":{"definition":"A fine specimen of man, often with great sexual prowess and a master of modern dance. Most commonly found in the places of learning or culture.","time":1441263035859},"lolz":{"definition":"Everybody else here is entirely incorrect, and it&apos;s unbelievable to what a degree.<br /><br />&quot;LOL&quot; is the signular form, and &quot;LOLZ&quot; is simply the plural.<br /><br />Meaning &quot;lol&apos;s&quot; or more than one &quot;lol&quot;.<br /><br />Adding a lowercase &quot;z&quot; at the end (Proper form, LOLz, or LoLz to switch between capitals and lowercase as is commonly done by a number of prepubescent horny teens, namely girls) does not necessarily add another word to the acronym. Just like if I were to write to you about &quot;STDs&quot;, I would not be talking about Sexually Transmitted Disease Succotash, but rather multiple Sexually Transmitted Diseases.","time":1441263043466},"dos":{"definition":"1. Disk Operating System: a disk-based operating system, usually referring to MS-DOS. Originally developed by Microsoft for IBM, MS-DOS was once the standard operating system for IBM-compatible personal computers.<br /><br />2. Denial of Service: a type of attack on a network that is designed to bring the network to its knees by flooding it with useless traffic.<br /><br />3. Department of State: a federal or state governmental department handling issues central to the country or each of the individual States, such as travel, tourism, elections, charters and licensing, historic records, and overall public security.<br /><br />4. Department of Safety: a department used by some U.S. states and cities which usually handles driver and vehicle, police, enforcement, fire, corrections, and crime statistics services for the public.<br /><br />5. Department of Statistics: a department used by some countries for handling statistical reports vital to their economies and governments.","time":1441263990577},"proxy":{"definition":"A sort of &quot;middle man&quot; on the internet.  Normally when you go to a website, you send your &quot;request&quot; packets straight to the site&apos;s server, and then the server sends &quot;reply&quot; packets back which is what you see as the website.  With a proxy, you send your request packet to a server, which then sends a new request packet to the website&apos;s server, which then sends back a reply to the proxy&apos;s server, and the proxy sends the web site to your computer.  This can be used for anonymous surfing on the web.  Not all proxys are anonymous, though.  Some just edit the packet they send to have your IP address instead of the proxy&apos;s, then the reply goes straight to you.","time":1441264774987},"doodoo":{"definition":"poop","time":1441266385711},"atns":{"definition":"answer the ninja. used when speaking to inferior people, reminding them of your power and authority.","time":1441266951162},"vain":{"definition":"What vain really is,a someone who cares alot about themselves, has a mirror in hand at any given time. Cares alot about looks, always in style, usually come from a well off family with loads of money to spend on stupid brand name clothing, gucci hats and $400 shoes...Can be a girl or boy. People usually hate them since they feel so comfortable about themselves and others are just jealous.They think that their the best in everything and that theres always an easy way out because their dad or mommmy has a lot of money so they can always run to them. Vain teens usually have it best of things,cash,cars,clothing and easier than others, having expensive things to brag about. In short words, full of it, conceited,best friend is the mirror..and drug store and mall.....worships money...","time":1441267418159},"invain":{"definition":"something done for nothing, vainly","time":1441267429474},"relentless":{"definition":"someone who is cruel, evil, pitiless, merciless, and that never ceases to be bad to others. (the jails are full of these people). ","time":1441267924699},"reform":{"definition":"(noun and verb) polite euphemism for corn-hole or corn-holing.","time":1441268413838},"bn":{"definition":"short for &quot;bitch nigga&quot; or a young black lady who is annoying or complains too much; can also be applied to black people in general ","time":1441274796065},"b&n":{"definition":"[Barnes and Noble], fool!<br /><br />That one store that&apos;s got books and shit. You know, the magical place where you&apos;re suddenly interested in books and then once you buy one you never look at it again.","time":1441274814374},"cuss":{"definition":"A slang word for &apos;&apos;curse&apos;&apos;.","time":1441275493487},"y":{"definition":"Depending on the context it can mean either why or yes.","time":1441275938125},"op":{"definition":"Short for Original Poster.  Used on online message boards and forums.","time":1441276841119},"ambition":{"definition":"1. A strong general desire for accomplishment, wealth or power, generally described as a positive trait.<br /><br />2. A specific, overwhelming, desire in the vein of (1).<br /><br />3. A card game played mainly by American college students, and the center of a minor scandal: falsely believing the game was written for political purposes (to unite international socialists) a group of right-wing Interneters mounted a campaign to supress and defame the game. The political motives behind the game have been debunked, though the game occasionally shows up in some [tinfoil hat] conspiracy theories.","time":1441277294566},"lpm":{"definition":"Licks Per Minute<br /><br />See [pussy]","time":1441277309329},"omh":{"definition":"acronym for &quot;oh my hell&quot;. Used on the interent.","time":1441278237284},"milf":{"definition":"&quot;Mother I&apos;d Like (to) Fuck&quot;","time":1441279037670},"dirty":{"definition":"not clean","time":1441279269184},"breasts":{"definition":"[Tits], [titties], [tig ol&apos; bitties], [boobs], [jugs], [melons], [cans], [hooters], [dirty pillows], [gazongas], [yabbos], [tig bitties], [knockers], [mammaries], [fun bags], [honkers], [headlights], [baps], [meat puppets], [ta-tas], [naturals], [boobies], [guns], [bahama mammas], [balloons], [bawagos], [big brown eyes], [blinkers], [bobambas], [bodacious tatas], [bombs], [bosom], [bosooms], [boulders], [Bristols], [brown suckies], [bubatoes], [bups], [bust], [busts], [Cadillac bumper bullets], [casabas], [chest], [chuberteens], [cones], [gedoinkers], [doorknobs], [floppers], [fried eggs], [fugis], [gams], [gazangas], [jungle tits], [golden bazoos], [golden winnebagoes], [mounds], [mountains], [marshmallows], [Maguffies], [grenadoes], [hogans], [honkers], [itty-bitty-titties], [jalobes], [bazongoes], [bazookas], [bazooms], [bazoos], [ninnies], [nips], [nupies], [pair], [nice pair], [penis squeezers], [beamers], [starter buttons], [tads], [handles], [tatas], [tittyboppers], [bee stings], [jiggers], [jobes], [rolling hills], [cup cakes], [cushions], [dairy section], [highbeams], [hinyackas], [knobs], [love apples], [love monkeys], [luscious scoops of flesh], [twins], [love warts], [watermellons], [wazoos], [whoppers], [winnebagos], [yabos], [mambas], [mammas], [mamms], [massive mammaries], [mazabas], [mellons], [milk factories], [Mcguffies], [mosquito bites],[perkies], [pillows], [pimples], [pink chewies], [rack], [set], [smosabs], [stacked], [torpedoes], [towel racks].","time":1441279353651},"bitties":{"definition":"a hot girl","time":1441279361219},"jugs":{"definition":"A woman&apos;s breasts. Especially when large and shapely.","time":1441279366822},"glands":{"definition":"A more scientifically correct way of describing your penis, without sounding too rude.","time":1441279412016},"mammaryglands":{"definition":"Scientific term for [titties].","time":1441279421297},"milk":{"definition":"The most tasty shit EVER.","time":1441279433451},"milking":{"definition":"The act of manipulating the prostate gland through the anus, so as to discharge as much seminal fluid as possible. Often used in BSDM circles.","time":1441279434437},"bsdm":{"definition":"See [sado-masochistic]","time":1441279447028},"sado-masochistic":{"definition":"The combination of sadism and masochism, in particular the deriving of pleasure, especially sexual gratification, from inflicting or submitting to physical or emotional abuse.","time":1441279456257},"sadism":{"definition":"Origin: Derived from the [marquis de sade]<br /><br />Function (n.) one who derives sexual pleasure from hurting others.","time":1441279470144},"masochism":{"definition":"1)The deriving of sexual gratification, or the tendency to derive sexual gratification, from being physically or emotionally abused. <br />2)The deriving of pleasure, or the tendency to derive pleasure, from being humiliated or mistreated, either by another or by oneself. <br />3)A willingness or tendency to subject oneself to unpleasant or trying experiences.","time":1441279486643},"fish":{"definition":"An animal that lives in the water and swims.  They might kill you in some instances.","time":1441279669126},"tg":{"definition":"short for TOO GOOD<br />also commonly seen as tgtgtg","time":1441280650713},"unf":{"definition":"Universal Noise of Fucking. See above definition for onomatopoeic use as a sound itself.","time":1441281364494},"ballcock":{"definition":"part in the toilet that lets in the water. also known as a fill valve.","time":1441281365743},"pant":{"definition":"rubbish, no good, bag of shite","time":1441281408606},"paint":{"definition":"The greatest art package of all time. Ships with versions of [word]windows[&#x2f;word]. Pictures created in Paint often look like they were drawn by children.","time":1441281416149},"panting":{"definition":"Overuse of the :P smily","time":1441281433807},"tired":{"definition":"Getting run over by an automobile and having a large treadmark left across your body.","time":1441281475965},"internet":{"definition":"A vast array of [word]pornography[&#x2f;word] and advertisements.","time":1441281554502},"lewd":{"definition":"What anime fans say when they&apos;re vaguely uncomfortable with how they&apos;re drooling over 14 year old girls","time":1441281723045},"moe":{"definition":"also written as moé.<br /><br />A [Japanese] slang term (ironically, first employed by [otaku]) used to refer to the [fetish] for or sexual attraction to idealized people, usually a fictional perfect young [girl].  <br /><br />Since then, moé has come to be used as a general term for a [hobby], [mania] or [fetish] (non-sexual or otherwise).  This is contrasted with [otaku], which would be taking the specific [hobby], [mania] or [fetish] to harmful levels.","time":1441282806754},"pomf":{"definition":"The sound you make when you fall backwards onto the bed while being a little girl.","time":1441282892661},"ohyah":{"definition":"The way to answer a question..... meaning very cool or definitely ","time":1441282993378},"ohyeah":{"definition":"An expression used by many, but none more than by Greto the Dorito.  Oh yeah!, can imply many different things on the chain.  It can express excitement, happiness, I&apos;m the man, you da man, he&apos;s da man, this is da bomb, she&apos;s da bomb, etc.","time":1441283001809},"bang":{"definition":"1) To have sex with someone.<br />2) A loud noise.<br />Do not get the two confused.","time":1441283020326},"gang":{"definition":"The Little League of organized crime.  A social club for teenagers or young adults without a drive to contribute to society in a positive manner.  Members often lack any sense of self-esteem so seek out like minds and congregate in large groups.  Scholastic vocabulary is limited so they communicate via cryptic hand signals.  Can be comparable to a Dark Side of the Mickey Mouse Club:  Members often engage in theft, vandalism, rape, murder, in order to get respect and recognition that they fail to receive in their very short lives.","time":1441283126484},"gangbang":{"definition":"When multiple partners, usually 3 or more, engage in sexual intercourse with a single willing partner. (If partner is unwilling it is called gang rape).","time":1441283133177},"chands":{"definition":"Portmanteau of Chimp and Hands. Used to describe an individuals inability to roll joints due to deterioration in either physical dexterity or mental competence, often resulting from prior consumption of Mariujana.","time":1441283140766},"sideboob":{"definition":"A view of the female [breast] seen from a side; generally under loosely-fitting clothes.  Very titillating (pun intended) and sexual without showing any overt nudity.","time":1441284401661},"bob":{"definition":"Box Office Bomb  Any movie that fails financially, big time, in box office receipts.<br />Investor&apos;s nightmare.<br />Loss of millions of dollars on appallingly acted or scripted movies.<br />Any thing with Pauly Shore in it. LOL","time":1441284413165},"tli":{"definition":"Abbreviation for &apos;Too little information&apos; ; lack of relevant information pertaining to a subject. <br /><br />Antonyms: TMI - &apos;Too much information&apos;  ","time":1441284494609},"spanish":{"definition":"the best looking people.","time":1441284711248},"lale":{"definition":"Lale  Turkish name for Tulip. Brunette. Cool, calm and collected, but also known for having strong emotions. This girl is complicated. Great taste in clothing and fashion, but a bad taste in friends. Lale could also be called Lala, Lulu, Lala Bear.","time":1441284716280},"beastboobs":{"definition":"When a female has humongous, gargantuan boobs. As large as they are unable to touch.","time":1441285216721},"beastwomen":{"definition":"Noun. Also known as BW.  An African-American female with beast-like qualities. An extremely arrogant and uncouth female that is more suited for a zoo than a civilized society. The life of a Beast Woman is nothing more than a never-ending chain of nigga moments.  Common characteristics include a trigger-happy temper, frequent loud skawking, neck-twisting, finger-snapping and exaggerated gestures, and the more-than-the-occasional all-out brawling.  Not to be confused with a Black Woman (also known as BW), although, in the right circumstances, the Black Woman will turn into a Beast Woman, however temporarily.","time":1441285433125},"niga":{"definition":"Spelling of the term &quot;Nigga&quot; by people who can&apos;t spell most of the words in the English dictionary.","time":1441285449803},"nigga":{"definition":"Nigga is a word which evolved from the derogative term &quot;nigger&quot;. Tupac best defined the distinction between the two.<br /><br />NIGGER- a black man with a slavery chain around his neck. <br /><br />NIGGA- a black man with a gold chain on his neck.","time":1441285451723},"imminent":{"definition":"ready to take place; hanging threateningly over ones head.","time":1441285552273},"crab":{"definition":"crabs:A tiny bug like creature that will infiltrate the pubis maximus,and lead you to isle 3 at the local pharmacy for some blue ointment.","time":1441285593523}}